[
    {
        "title": "Dotnet Developer",
        "job_id": "4285577757",
        "company_name": "Travelopedia Ltd.",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            ".NET Core",
            "ASP.NET MVC",
            "Object-Oriented Programming (OOP)"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285577757/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n \nTravelopedia Ltd. is a leading destination management company established on August 3, 2012. As a one-stop travel solution provider, we offer the best deals on flight bookings, hotel accommodations, holiday packages, and car hire worldwide. We help perfect your dream vacations, ensuring a smooth travel experience regardless of your destination.\n\n Role Description\n \nThis is a full-time, on-site role for a Dotnet Developer located in Delhi, India. The Dotnet Developer will be responsible for designing, developing, and maintaining software applications using .NET technologies. Daily tasks include coding, testing, debugging, and maintaining software applications, as well as collaborating with cross-functional teams to ensure high-quality software solutions.\n\n Qualifications\n \n\nStrong understanding of Object-Oriented Programming (OOP) and Software Development principles\nProficiency in .NET Core and ASP.NET MVC\nExperience in Programming and problem-solving\nExcellent analytical and troubleshooting skills\nAbility to work collaboratively in a team environment\nBachelor's degree in Computer Science, Information Technology, or related field\nExperience in the travel industry is a plus",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Flutter Developer",
        "job_id": "4288023443",
        "company_name": null,
        "location": "India",
        "experience": "1+ years",
        "salary": null,
        "key_skills": [
            "Flutter",
            "bloc",
            "riverpod",
            "getx",
            "source control",
            "continuous integration",
            "unit testing"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288023443/",
        "posted_at": null,
        "job_description": "About the job\n\nThe ideal candidate will be responsible for the technical design and implementation of new products and enhancements. They will work in all phases of the development cycle: concept to implementation. \n\n \n\nResponsibilities\n\nPerform full life-cycle development.\nUnderstanding of Flutter with bloc/riverpod/getx statemanagement \nAdhere to agreed upon delivery schedules\nUtilizes source control, continuous integration, and unit testing best practices\nWork cross-functionally to define and write code for new features\n\n\n\n\nQualifications\n\nBachelor's degree or equivalent in Computer Science\n1+ years' experience in related area\nExperience with iOS and Android platforms",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Website Developer Intern",
        "job_id": "4288060099",
        "company_name": "Sunsys Techsol Pvt. Ltd.",
        "location": "India",
        "experience": null,
        "salary": "Unpaid",
        "key_skills": [
            "HTML",
            "CSS",
            "JavaScript",
            "WordPress",
            "Webflow"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288060099/",
        "posted_at": null,
        "job_description": "About the job\n\nInternship Opportunity: Website Developer Intern\n\n📍 Company: Sunsys Techsol Pvt. Ltd.\n\n 🌎 Location: Remote (PAN India)\n\n 🗓️ Duration: 6 Months\n\n 🕐 Timing: Flexible (Part-time, ~6 hours/day)\n\n 💸 Stipend: Unpaid\n\n🎁 Perks & Benefits:\nCertificate of Completion\nLetter of Recommendation (LOR)\nLinkedIn Recommendation from Official Company Page\nMentorship by Senior Developers & UI/UX Experts\nReal-world Project Experience (Live Projects)\nExposure to both Full-stack and CMS (WordPress/Webflow) Projects\nFlexible Working Hours (Remote, Output-based)\n\n\n\n\n🏢 About Sunsys Techsol Pvt. Ltd.:\n\nSunsys Techsol is an innovation-driven company operating across IT Services, Renewable Energy, and Digital Solutions. Our mission is to build digital platforms that create social impact in the areas of clean energy, education, and inclusion. We promote a remote-first culture that nurtures growth and hands-on learning for young professionals.\n\n👨‍💻 Role Overview:\n\nWe’re seeking a Website Developer Intern who is creative, self-motivated, and tech-savvy. You’ll work directly with our UI/UX and development teams to create and manage impactful, user-friendly websites.\n\n🔧 Key Responsibilities:\nDesign, develop, and maintain responsive websites using HTML, CSS, JavaScript, and frameworks\nTranslate UI/UX designs into functional front-end code\nIntegrate APIs and CMS (WordPress/Webflow) with backend systems\nEnsure SEO optimization, page speed, and cross-browser compatibility\nTest and debug for a seamless user experience\nUpdate content regularly through CMS platforms like WordPress, Webflow, or Wix\n✅ Required Skills:\nStrong knowledge of HTML5, CSS3, JavaScript\nFamiliarity with front-end frameworks like Bootstrap, Tailwind CSS, React.js\nExperience or comfort working with WordPress (Must-have)\nBasic understanding of API integration and JSON\nGood communication & time management skills\nEagerness to learn and work in a flexible, remote environment\n🌟 Preferred/Bonus Skills:\nUI/UX design using tools like Figma or Adobe XD\nSEO Optimization Techniques\nFamiliarity with Git/GitHub for version control\nKnowledge of CMS alternatives like Webflow or Wix\nUnderstanding of Google Analytics or related tools\n🎓 Eligibility:\nPursuing or completed Bachelor's in Computer Science, IT, or related fields\nFinal-year students and freshers are welcome\n📩 How to Apply:\n\nSend your resume and portfolio/GitHub/website links to:\n\n 📧 admin@sunsystechsol.com\n\n Subject Line: Application for Website Developer Intern\n\nShortlisted candidates will be contacted for a virtual interview.\n\nIndustry: IT Services & IT Consulting\n\n Employment Type: Internship",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "Junior Java Engineer",
        "job_id": "4288446104",
        "company_name": "Miratech",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Java"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288446104/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nMiratech helps visionaries change the world. We are a global IT services and consulting company that brings together enterprise and start-up innovation. Today, we support digital transformation for some of the world's largest enterprises. By partnering with both large and small players, we stay at the leading edge of technology, remain nimble even as a global leader, and create technology that helps our clients further enhance their business. We are a values-driven organization and our culture of Relentless Performance has enabled over 99% of Miratech's engagements to succeed by meeting or exceeding our scope, schedule, and/or budget objectives since our inception in 1989.\n\nMiratech has coverage across  5 continents and operates in over 25 countries around the world. Miratech retains nearly 1000 full-time professionals, and our annual growth rate exceeds 25%. \n\nJob Description\n\nWe are seeking a highly motivated Junior Java Engineer to join our dynamic team. As part of our team, you will have the opportunity to work on exciting projects, contribute to innovative solutions, and grow your career in a collaborative environment.\n\nResponsibilities: \n\n\nCollaborate with cross-functional teams to design and maintain various platform components. \nImplement new user interfaces and business functionalities according to specifications and requirements. \nAnalyze and enhance the performance of applications and operational workflows to improve efficiency. \nConduct development testing of software components to ensure quality and reliability. \nSupport level 2 and 3 applications, troubleshooting issues, and identifying opportunities for improvement. \nWork independently in a globally distributed team, demonstrating adaptability and self-motivation. \nStay updated with emerging technologies and be willing to learn and work with different technologies. \nFocus on architectural design to contribute to architectural decisions. \n\n\nQualifications\n\n\nBachelor's degree in Computer Science, Engineering, or related field. \n1+ years of experience in Java development. \nKnowledge of Spring, Spring Boot, Hibernate, and JSP. \nFamiliarity with multi-threading concepts. \nBasic understanding of relational databases (SQL Server preferred). \nUnderstanding of software development methodologies and Agile/Scrum practices. \nStrong analytical, problem-solving, and communication skills. \nAbility to work effectively in a team environment and handle multiple tasks. \n\n\nNice to have:\n\n\nExperience with GitLab / GitLab CI. \n\n\nWe offer:\n\n\nCulture of Relentless Performance: join an unstoppable technology development team with a 99% project success rate and more than 30% year-over-year revenue growth. \nCompetitive Pay and Benefits: enjoy a comprehensive compensation and benefits package, including health insurance, language courses, and a relocation program. \nWork From Anywhere Culture: make the most of the flexibility that comes with remote work. \nGrowth Mindset: reap the benefits of a range of professional development opportunities, including certification programs, mentorship and talent investment programs, internal mobility and internship opportunities. \nGlobal Impact: collaborate on impactful projects for top global clients and shape the future of industries. \nWelcoming Multicultural Environment: be a part of a dynamic, global team and thrive in an inclusive and supportive work environment with open communication and regular team-building company social events. \nSocial Sustainability Values: join our sustainable business practices focused on five pillars, including IT education, community empowerment, fair operating practices, environmental sustainability, and gender equality. \n Miratech is an equal opportunity employer and does not discriminate against any employee or applicant for employment on the basis of race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity, or any other protected status under applicable law.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Development Team Member (Flash Devices)",
        "job_id": "4288433829",
        "company_name": "Sandisk",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Flash"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288433829/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nSandisk understands how people and businesses consume data and we relentlessly innovate to deliver solutions that enable today’s needs and tomorrow’s next big ideas. With a rich history of groundbreaking innovations in Flash and advanced memory technologies, our solutions have become the beating heart of the digital world we’re living in and that we have the power to shape.\n\nSandisk meets people and businesses at the intersection of their aspirations and the moment, enabling them to keep moving and pushing possibility forward. We do this through the balance of our powerhouse manufacturing capabilities and our industry-leading portfolio of products that are recognized globally for innovation, performance and quality.\n\nSandisk has two facilities recognized by the World Economic Forum as part of the Global Lighthouse Network for advanced 4IR innovations. These facilities were also recognized as Sustainability Lighthouses for breakthroughs in efficient operations. With our global reach, we ensure the global supply chain has access to the Flash memory it needs to keep our world moving forward.\n\nJob Description\n\nBe part of the Development team that validated the Sandisk’s Enterprise flash devices.\n\nLearn and understand complex technical flash devices specifications and apply that knowledge to enhance test suite and test processes.\n\nExecuted regression and end-to-end scenario test cases to validate business, system and operational requirements.\n\nDevelop software tools to improve test processes.\n\nProactively seize for test suite quality improvement plans with data analytic approach.\n\nDevise strategies for in-depth functionality and compatibility testing of complex drive features.\n\nCollaborate with Test Dev engineers, Firmware Engineers and other functional teams, independently in issue resolutions.\n\nFamiliar with using Protocol Analyzers to understand and analyze traces for failure investigation.\n\nQualifications\n\nREQUIRED\n\nBachelor or Master in Computer Science, Computer/Electronics Engineering or equivalent required.\n\nCapable of quickly learning hardware, systems, tools, and methodologies.\n\nDesired Skills\n\nKnowledge of storage protocols: UFS, eMMC, NVMe\n\nProgramming language skills (Python, C, C++, Python).\n\nExperience in testing/product engineering. Experienced and familiar with firmware development, Integration and validation\n\nHardware and software debugging skills. Able to methodically root cause complex failure mechanism\n\nSoft skills, Excellent written and verbal skills, be a Team player\n\nAdditional Information\n\nSandisk thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution.\n\nSandisk is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at jobs.accommodations@sandisk.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.",
        "source": "linkedin",
        "relevance_score": "medium"
    },
    {
        "title": "AI/ML Developer – NLP & Generative AI",
        "job_id": "4288044667",
        "company_name": "Revin",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "AI/ML",
            "NLP",
            "RAG pipelines",
            "LangGraph",
            "LangChain",
            "vector databases",
            "Hugging Face Transformers"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288044667/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout the Job!!\n\n\n\n\nYou will be our:AI/ML Developer – NLP & Generative AI\n\nYou will be based at Palakkad, Kerala \n\n\n\n\nWho We Are\n\nAt Revin, we are building the next-generation AI-powered tutoring platform to make competitive exam preparation smarter, faster, and personalized. Emerging from IIT Palakkad, our mission is to empower students across India by transforming their doubts into discovery.\n\nThrough advanced AI, instant doubt-solving, adaptive test generation, and personalized learning paths,With its flagship edtech product Tutoz, Revin is redefining exam preparation for JEE, NEET, GATE, CAT, and UPSC aspirants.\n\n\n\n\nhttps://tutoz.in/\n\nhttps://revin.co.in/\n\n \n\nYour Role at Revin\n\nWe are looking for an innovative and hands-on AI/ML Developer with strong expertise in NLP, RAG pipelines, LangGraph, LangChain, and vector databases. You will play a central role in building conversational AI systems, semantic search engines, and adaptive tutoring features that power the Tutoz learning experience.\n\nYou will work with backend engineers, data scientists, and product teams to design scalable ML pipelines that make education more intelligent and accessible.\n\n\n\n\nWhat You’ll Do at RevinCore AI/ML Development\nDesign and implement RAG-based AI pipelines for real-time doubt solving.\nDevelop conversational AI models that deliver human-like tutoring experiences.\nFine-tune Hugging Face Transformers for education-specific tasks.\nData & Vector Intelligence\nIntegrate vector databases (Pinecone, Weaviate, Milvus) for semantic search.\nBuild embeddings-based retrieval systems for large-scale learning content.\nCollaboration & Deployment\nWork with backend engineers to expose ML models via APIs.\nOptimize models for deployment on AWS/GCP/Azure cloud infrastructure.\nCollaborate with educators to align models with exam preparation needs.\nRequirements – Who You Are\nPython Expert: Skilled in writing production-ready ML pipelines.\nNLP Practitioner: Strong grasp of embeddings, tokenization, fine-tuning, and transformers.\nApplied AI Builder: Hands-on with LangChain, LangGraph, and Hugging Face models.\nData & Infra Aware: Knowledge of SQL, NoSQL, and vector databases.\nCloud Ready: Experience deploying on AWS/GCP/Azure.\nPreferred\nPrior work in chatbots, tutoring systems, or adaptive learning platforms.\nFamiliarity with retrieval-augmented generation (RAG) at scale.\nUnderstanding of model optimization techniques for performance.\n\n\n\n\nHere’s what we are looking for:\nStrong Python programming skills.\nBachelor’s or Master’s degree in Computer Science or a related field.\nExperience with LangChain, LangGraph, Hugging Face.\nKnowledge of SQL, NoSQL, and vector databases (e.g., Pinecone, Weaviate, Milvus).\nFamiliarity with AWS, GCP, or Azure.\nUnderstanding of RAG pipelines and conversational AI systems.\nPrior experience in chatbots, tutoring systems, or adaptive learning platforms (preferred).\n\n\n\n\nWhy Join Revin?\nWork on cutting-edge AI in education impacting millions of students.\nCollaborate with researchers and engineers at the intersection of AI + EdTech.\nOpportunity to lead innovation in NLP-driven tutoring.\nBe part of a fast-growing IIT-incubated startup scaling nationally.\n\n\n\n\nHow to Apply? \n\n\n\n\nIf you’re ready to design the future of learning, send your updated resume and portfolio to:\n\n📧 connect@revinkrishi.com",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Front-End Developer (React / Next.js)",
        "job_id": "4288049048",
        "company_name": null,
        "location": "India",
        "experience": "2-3 Years",
        "salary": null,
        "key_skills": [
            "React",
            "Next.js",
            "JavaScript",
            "CSS",
            "Bootstrap",
            "Tailwind",
            "Redux",
            "RTK Query",
            "TypeScript",
            "AJAX",
            "jQuery",
            "REST/JSON APIs",
            "WebSocket",
            "Socket.IO",
            "Node.js"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288049048/",
        "posted_at": null,
        "job_description": "About the job\n\nPosition: Front-End Developer\n\nExperience: 2-3 Years\n\nWork Location: Strictly work from Office (Kolkata, Sector 5, Saltlake)\n\nFrontend Developer (React / Next.js)\n\nKey Responsibilities\n\nDevelop and maintain performant, scalable web applications using React and Next.js.\nImplement Server-Side Rendering (SSR), dynamic routing, and component optimization.\nCollaborate with backend developers and UI/UX designers to deliver high-quality features.\nWrite clean, maintainable, and well-documented code.\nEnsure responsive design and cross-browser compatibility.\n\nRequired Qualifications\n\n2–3 years of professional experience in frontend development.\nStrong proficiency in React, Next.js, and modern JavaScript (ES6+).\nHands-on experience with CSS frameworks (Bootstrap, Tailwind, etc.) and frontend build tools.\nFamiliarity with Redux, RTK Query, TypeScript, AJAX, jQuery, REST/JSON APIs, WebSocket / Socket.IO, Figma, and Dynamic Form Component Building.\nUnderstanding of responsive web design principles.\n\nPreferred Skills\n\nExperience with Node.js and backend integration.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "PHP Developer",
        "job_id": "4285569246",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "PHP",
            "Back-End Web Development",
            "Object-Oriented Programming (OOP)",
            "Front-End Development",
            "Git"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285569246/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n \nWe suggest you enter details here.\n\n Role Description\n \nThis is a full-time on-site role for a PHP Developer, located in Rajkot. The PHP Developer will be responsible for back-end web development, collaborating with front-end developers, and ensuring the integration of user-facing elements. Daily tasks include writing clean, efficient code, troubleshooting and debugging applications, and optimizing applications for maximum speed and scalability. The role requires maintaining high standards for code quality and ensuring the software development lifecycle is followed.\n\n Qualifications\n \n\nProficient in Back-End Web Development and Object-Oriented Programming (OOP)\nExperience with Front-End Development and Software Development\nExcellent Programming skills\nStrong problem-solving abilities and attention to detail\nAbility to work independently and collaboratively in a team environment\nExperience with version control systems like Git is a plus\nExcellent written and verbal communication skills\nBachelor's degree in Computer Science, Engineering, or a related field is preferred",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Web Developer",
        "job_id": "4285525102",
        "company_name": null,
        "location": "India",
        "experience": "0-6 months",
        "salary": null,
        "key_skills": [
            "PHP",
            "MySQL",
            "HTML",
            "JavaScript",
            "CSS"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285525102/",
        "posted_at": null,
        "job_description": "About the job\n\nThe ideal candidate is a highly resourceful and innovative developer with extensive experience in the layout, design and coding of websites specifically in PHP format. You must also possess a strong knowledge of web application development using PHP programming language and MySQL Server databases. \n\n \n\nResponsibilities\n\nPerform a mix of maintenance, enhancements, and new development as required\nWork in a data analyst role and with business intelligence applications\nDocument features, technical specifications & infrastructure Responsibilities\nWork cross-functionally to convert business needs into technical specifications\n\n\n\n\nQualifications\n\n0-6 months of experience in web development and software design\nExpertise in front-end technologies (HTML, JavaScript, CSS), PHP frameworks, and MySQL databases",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Back End Developer",
        "job_id": "4285555854",
        "company_name": null,
        "location": "India",
        "experience": "1 - 4 years",
        "salary": null,
        "key_skills": [
            "Node.js",
            "Express.js",
            "MongoDB",
            "PostgreSQL",
            "MySQL",
            "Redis",
            "AWS",
            "CI/CD",
            "Docker",
            "Kubernetes",
            "Git",
            "Jira",
            "Jenkins"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285555854/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Role: Back End Developer\n\nJob Type: Permanent Full Time\n\nNotice Period: Immediate to 30 days.\n\nExperience: 1 - 4 years\n\n\n\n\nKey Responsibilities:\n\nDesign and develop robust backend systems using Node.js and Express.js, ensuring scalability and performance.\nLead and mentor junior developers, providing guidance and fostering their professional growth.\nProficiently handle database design, optimizing for efficiency and data integrity.\nCollaborate with frontend teams to ensure smooth integration and seamless user experiences.\nArchitect system solutions, considering performance, security, and scalability.\nImplement CI/CD pipelines for efficient deployment and maintain DevOps workflows.\nKnowledge of cloud deployments using AWS technologies, ensuring system reliability and scalability.\nAdapt to a fast-paced startup environment, demonstrating a \"startup mindset\" and the ability to thrive in a dynamic setting.\n\n\n\n\nQualifications:\n\nBachelor's degree in computer science or a related field (or equivalent professional experience).\nA minimum of 1+ year of hands-on experience in backend development experience, with expertise in Node.js and Express.js.\nStrong database design skills, including proficiency in MongoDB/ PostgreSQL /MySQL / Redis, etc.,\nProficiency in system design and architecture, with a focus on scalability and security.\nExperience with CI/CD pipelines for efficient deployment, including Git, Jira, Jenkins, Docker, Kubernetes etc.\nKnowledge of AWS technologies for cloud deployments, ensuring system reliability and scalability.\nAbility to lead projects, guide junior developers, and foster a startup mindset.\nPrevious startup experience is an asset.\nExceptional problem-solving skills and teamwork.\nAdaptability to a fast-paced, evolving environment.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "MERN Stack Developer",
        "job_id": "4288031158",
        "company_name": null,
        "location": "India",
        "experience": "1-2 Years",
        "salary": null,
        "key_skills": [
            "MERN Stack",
            "MongoDB",
            "Express.js",
            "React.js",
            "Node.js",
            "JavaScript",
            "TypeScript",
            "RESTful APIs",
            "Git"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288031158/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Title: MERN Stack Developer (1-2 Years Experience)\n\n\n\n\nLocation: Onsite\n\n\n\n\nEmployment Type: Full-Time\n\n\n\n\n⸻\n\n\n\n\nJob Summary\n\n\n\n\nWe are looking for a passionate MERN Stack Developer with around 1- 2 years of hands-on experience in building scalable web applications. The candidate will be responsible for developing, maintaining, and deploying applications using MongoDB, Express.js, React.js, and Node.js.\n\n\n\n\n⸻\n\n\n\n\nKey Responsibilities\n\n • Develop, test, and deploy end-to-end web applications using the MERN stack.\n\n • Build reusable, responsive, and modular UI components using React.js.\n\n • Work on RESTful APIs and integrate with third-party services.\n\n • Design and optimize MongoDB schemas and queries for high performance.\n\n • Collaborate with the product and design teams to deliver user-friendly solutions.\n\n • Maintain code quality, documentation, and version control (Git).\n\n • Troubleshoot, debug, and enhance existing applications.\n\n • Stay updated with the latest trends and best practices in JavaScript/TypeScript and full-stack development.\n\n\n\n\n⸻\n\n\n\n\nRequired Skills & Qualifications\n\n • 1-2 years of professional experience as a MERN Stack Developer or similar role.\n\n • Strong proficiency in JavaScript (ES6+) and TypeScript (preferred).\n\n • Hands-on experience with:\n\n • React.js (hooks, context API, state management – Redux/Zustand/MobX).\n\n • Node.js and Express.js for backend development.\n\n • MongoDB (schema design, aggregation, indexing).\n\n • Good understanding of RESTful APIs and integration practices.\n\n • Experience with Git/GitHub and collaborative workflows.\n\n • Familiarity with HTML5, CSS3, TailwindCSS/Bootstrap.\n\n • Basic knowledge of authentication, JWT, OAuth, and security best practices.\n\n • Experience deploying applications on cloud platforms (AWS, DigitalOcean, or similar) is a plus.\n\n • Problem-solving skills and ability to work in an agile team environment.\n\n\n\n\n⸻\n\n\n\n\nPreferred Skills (Nice to Have)\n\n • Experience with Next.js for server-side rendering.\n\n • Knowledge of GraphQL.\n\n • Familiarity with CI/CD pipelines, Docker, Kubernetes.\n\n • Understanding of testing frameworks (Jest, Mocha, Cypress).\n\n\n\n\n⸻\n\n\n\n\nEducation\n\n • Bachelor’s degree in Computer Science, Information Technology, or a related field (or equivalent practical experience).\n\n\n\n\nSalary 30k - 40k INR/- (Monthly)",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Backend Developer (Travelport GDS Integration)",
        "job_id": "4285516301",
        "company_name": "Webestica.dev",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Travelport GDS",
            "Node.js",
            "Java",
            "Python",
            ".NET",
            "RESTful APIs",
            "microservices",
            "AWS",
            "Azure",
            "GCP",
            "React",
            "Angular",
            "Vue"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285516301/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nAt Webestica.dev, we blend No-Code Power with Custom Code Precision by specializing in Webflow & Bubble.io solutions. Our modern tech stacks build web applications that are as unique as your business. We are dedicated to leveraging cutting-edge technology to create seamless, efficient, and high-performing web solutions tailored to our clients' distinct needs.\n\n\n\n\nRole Description\n\nLead the integration of Travelport GDS APIs into a custom web-based booking platform.\nDesign and develop scalable and secure booking and ticketing workflows.\nBuild and maintain services for flight search, fare display, reservation, and payment.\nCollaborate with UI/UX designers, front-end developers, and business stakeholders to deliver a seamless customer experience.\nEnsure compliance with airline and industry standards (e.g., PCI-DSS, IATA).\nTroubleshoot, optimize, and continuously improve system performance.\n\n\n\n\nQualifications\n\nProven experience integrating Travelport GDS (Galileo, Apollo, or Worldspan) into web applications.\nSolid understanding of PCCs, PNRs, fare rules, and ticketing processes.\nStrong backend development skills (Node.js, Java, .NET, or Python preferred).\nExperience with RESTful APIs, microservices, and cloud infrastructure (AWS, Azure, or GCP).\nKnowledge of frontend technologies (React, Angular, or Vue) is a plus.\nExperience in building travel booking websites or platforms (Expedia, Kayak, etc. style) is highly desirable.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full Stack Engineer",
        "job_id": "4288031200",
        "company_name": "Flashoot",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "JavaScript",
            "TypeScript",
            "React",
            "Node.js",
            "SQL",
            "NoSQL",
            "AWS",
            "GCP",
            "Azure",
            "API design",
            "Git",
            "CI/CD"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288031200/",
        "posted_at": null,
        "job_description": "About the job\n\nAt Flashoot, we’re building the future of creator-led content technology, and we’re looking for a Full Stack Engineer who’s excited to roll up their sleeves and help us shape it.\n\nThis isn’t just another coding job. We’re searching for someone who thrives in building products end-to-end — from crafting sleek, intuitive interfaces to designing resilient backend systems that scale. You’ll work closely with designers, product managers, and other engineers to bring ideas to life and make an impact on how creators and businesses connect.\n\n\n\n\nWhat You’ll Do\nCollaborate with the team to design, develop, and ship new features for our platform.\nBuild and maintain scalable APIs, backend services, and database systems.\nDevelop clean, user-friendly web and mobile interfaces.\nEnsure performance, security, and reliability across the stack.\nParticipate in code reviews, brainstorm sessions, and sprint planning.\nTake ownership — we love engineers who don’t just execute, but also suggest and improve.\n\n\n\n\nWhat We’re Looking For\nStrong experience with JavaScript/TypeScript (React, Node.js) or equivalent full stack frameworks.\nFamiliarity with databases (SQL or NoSQL) and cloud infrastructure (AWS, GCP, or Azure).\nGood grasp of API design, authentication, and scalability challenges.\nComfort working with version control (Git) and CI/CD pipelines.\nAn eye for detail in UI/UX, with the ability to turn designs into smooth user experiences.\nProblem-solving mindset, ownership attitude, and eagerness to learn.\n\n\n\n\nNice to Have\nExperience with Flutter or mobile app development.\nFamiliarity with security best practices and penetration testing.\nContributions to open-source projects or a portfolio showcasing your work.\n\n\n\n\nWhy Join Us?\nBe part of a fast-growing startup shaping India’s creator economy.\nWork on problems that directly empower creators and brands.\nA collaborative team that values creativity, initiative, and impact.\nCompetitive pay, room to grow, and the chance to leave your mark on a product loved by thousands.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": ".NET Developer",
        "job_id": "4288024676",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            ".NET",
            ".NET Core",
            "C#",
            "HTML",
            "CSS",
            "JavaScript",
            "Typescript"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288024676/",
        "posted_at": null,
        "job_description": "About the job\n\nWe are looking for a skilled .NET Developer to design, develop, test, and deploy applications in .NET and .NET Core. You will work in close collaboration with the UI/UX teams and be responsible for delivering high-quality, scalable, and efficient solutions. This role requires a passion for coding, problem-solving, and working as part of a dynamic team.\n\n\n\n\nKey Responsibilities:\n\nDevelop, test, and deploy .NET applications based on business requirements.\nWork with front-end technologies (HTML, CSS, JavaScript) in collaboration with UI/UX teams to ensure seamless integration and responsive design.\nWrite clean, scalable, and efficient code in C# and .NET Core to build robust applications.\nParticipate in the full software development lifecycle (SDLC), including requirement gathering, design, coding, testing, and ongoing maintenance.\nTroubleshoot, debug, and optimize applications to ensure high performance, reliability, and user satisfaction.\nCollaborate with cross-functional teams to design, implement, and maintain software solutions that meet business needs.\nIntegrate third-party APIs and services into existing systems to enhance functionality and features.\n\n\n\n\nRequired Skills and Qualifications:\n\nProficiency in C# and .NET Core for application development.\nSolid understanding of front-end technologies such as HTML, CSS, and JavaScript/Typescript.\nStrong problem-solving skills and ability to optimize code for performance.\nFamiliarity with software development methodologies and tools (Agile, Git, etc.).\nExcellent communication skills for collaborating with team members and stakeholders.\n\n\n\n\nPreferred Qualifications:\n\nExperience with database management (SQL Server, etc.).\nKnowledge of cloud computing platforms (Azure, AWS).\nFamiliarity with RESTful API development and integration.\nAngular or AngularJS knowledge is a good-to-have to facilitate better integration with front-end components and enhance full-stack development.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Backend Developer (Medical Billing Software)",
        "job_id": "4288023801",
        "company_name": "FriskaAi",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "C#",
            "ASP.NET Core",
            "Entity Framework",
            "SQL Server",
            "REST APIs",
            "microservices",
            "Dapper",
            "Azure DevOps"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288023801/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Us:\n\nAt FriskaAi, we’re redefining healthcare through AI-driven personalized solutions. From precision health recommendations to population health analytics, our platform empowers better outcomes—one algorithm at a time.\n\n\n\n\nJob Description:\n\nWe are looking for a skilled Backend Developer with experience in medical billing software to join our team. The ideal candidate will have strong expertise in C#, ASP.NET Core, Entity Framework, SQL Server, and REST APIs, along with hands-on experience in microservices architecture, stored procedures, and Azure DevOps. You will design, develop, and maintain robust backend systems that power our web applications and services. Proficiency in Dapper, IIS hosting, and ASP.NET Core Web API is essential.\n\n\n\n\nKey Responsibilities:\n\n1. Backend Development:\n\nDesign, develop, and maintain backend services and APIs using C# and ASP.NET Core.\nImplement RESTful APIs and ASP.NET Core Web API for seamless frontend-backend communication.\nBuild and optimize microservices for scalability, reliability, and performance.\n\n2. Database Management:\n\nDesign and optimize SQL Server schemas, stored procedures, and complex queries.\nUse Entity Framework and Dapper for high-performance database operations.\n\n3. API Development & Integration:\n\nDevelop and maintain RESTful APIs, including integrations with medical billing software.\nEnsure secure, efficient data exchange between systems.\n\n4. Microservices Architecture:\n\nBreak down monolithic applications into independent, scalable services.\nImplement inter-service communication via messaging queues or REST APIs.\n\n5. DevOps & Deployment:\n\nManage CI/CD pipelines using Azure DevOps.\nDeploy applications on IIS or Azure and monitor production systems.\n\n6. Testing & Debugging:\n\nWrite unit/integration tests and resolve performance bottlenecks.\n\n7. Collaboration:\n\nWork cross-functionally with frontend teams, product managers, and stakeholders.\n\n\n\n\nMandatory Requirements:\n\n2+ years of backend development in C#/ASP.NET Core.\nProven experience with medical billing software (e.g., claims processing, HIPAA compliance, EHR integrations).\nExpertise in SQL Server, including stored procedures, query optimization.\nHands-on experience with Entity Framework, Dapper, REST APIs, and microservices.\nFamiliarity with Azure DevOps, IIS, Git.\n\n \n\nPreferred Skills:\n\nDocker/Kubernetes, message brokers (RabbitMQ/Kafka), cloud platforms (Azure/AWS).\nSecurity best practices, testing frameworks (xUnit/NUnit).\n\n\n\n\nWhat We Offer:\n\nCompetitive salary & benefits.\nImpactful projects in AI-driven healthcare.\nCollaborative, growth-focused culture.\n\n\n\n\n🔗 Apply Now!",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full-Stack Developer",
        "job_id": "4288023840",
        "company_name": null,
        "location": "India",
        "experience": "2-3 years",
        "salary": null,
        "key_skills": [
            "React",
            "TypeScript",
            "JSX",
            ".NET 8",
            "C#",
            "SQL",
            "Azure SQL Server",
            "APIs"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288023840/",
        "posted_at": null,
        "job_description": "About the job\n\nThe ideal candidate will be familiar with the full software design life cycle. They should have experience in designing, coding, testing and consistently managing applications They should be comfortable coding in a number of languages and have an ability to test code in order to maintain high-quality code.\n\n\n\n\nExp: 2-3 years\n\nLocation: Chennai\n\nMode of Work: Office\n\n\n\n\nYour Responsibilities:\n\nDevelop responsive, modular front-end components using React, TypeScript/JSX, and the MUI library.\nDesign and implement secure, scalable backend services with .NET 8 and C#.\nOptimize SQL queries and work with Azure SQL Server Managed Instances.\nPartner with product and design teams to transform requirements into functional features.\nIntegrate APIs and data sources with the UI, working across the full stack.\nContribute to design discussions, performance enhancements, and scalable system architecture.\nGrow into leadership by gradually owning features or modules.\n\nQualifications:\n\n2–3 years of full-stack development experience.\nStrong skills in React, JSX, TypeScript, and MUI.\nHands-on experience with .NET 8 and C#.\nSolid database knowledge, preferably with Azure SQL Server.\nUnderstanding of frontend-backend integration and API design.\nProactive mindset with a desire to take ownership and grow into leadership.\nExcellent communication skills and a collaborative approach.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full Stack Developer",
        "job_id": "4288022662",
        "company_name": null,
        "location": "India",
        "experience": "0-3 years",
        "salary": null,
        "key_skills": [
            "JavaScript",
            "Python",
            "Node.js",
            "React",
            "Vite framework",
            "Django",
            "Flask",
            "RESTful API",
            "SQL",
            "NoSQL",
            "Git"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288022662/",
        "posted_at": null,
        "job_description": "About the job\n\nRole Overview:\n\n\n\n\nWe are seeking a seasoned Full Stack Developer with a robust background in JavaScript frameworks and Python. The ideal candidate will have 0-3 years of experience, demonstrating a strong aptitude for backend development while also being proficient in frontend technologies. This role involves leading complex projects, mentoring junior developers, and contributing to architectural decisions.\n\n\n\n\nKey Responsibilities:\n\n\n\n\nDesign, develop, and maintain scalable backend services using Node.js and Python.\n\n\n\n\nArchitect and implement RESTful APIs and integrate third-party services.\n\n\n\n\nOptimize applications for maximum speed and scalability.\n\n\n\n\nLead code reviews, testing, and deployment processes.\n\n\n\n\nTroubleshoot and resolve technical issues across the stack.\n\n\n\n\nStay updated with emerging technologies and propose innovative solutions.\n\n\n\n\nRequired Qualifications:\n\n\n\n\nBachelor’s degree in Computer Science, Engineering, or a related field.\n\n\n\n\n0-3 years of experience in full stack development.\n\n\n\n\nProficiency in JavaScript, with hands-on experience in react, Vite framework.\n\n\n\n\nSolid understanding of Python and its web frameworks (e.g., Django, Flask).\n\n\n\n\nExperience with RESTful API design and implementation.\n\n\n\n\nFamiliarity with database systems (SQL and NoSQL).\n\n\n\n\nKnowledge of version control systems, preferably Git.\n\n\n\n\nStrong problem-solving skills and attention to detail.\n\n\n\n\nExcellent communication and teamwork abilities.\n\n\n\n\nPreferred Qualifications:\n\n\n\n\nExperience with cloud platforms such as AWS, Azure, or Google Cloud.\n\n\n\n\nUnderstanding of DevOps practices and CI/CD pipelines.\n\n\n\n\nFamiliarity with containerization tools like Docker and orchestration tools like Kubernetes\n\n\n\n\nExperience with frontend frameworks like React or Angular.\n\n\n\n\nKnowledge of microservices architecture and serverless computing.\n\n\n\n\nAbout the Company:\n\n\n\n\nFounded by engineers from IIT Delhi and backed by SKETS Studio, we create solutions that help people interact smarter, decide faster, and build better. From hyper-realistic interviews with Cerebrus to different frameworks across industries, our work blends cutting-edge tech with real-world clarity.\n\n\n\n\nWe collaborate across disciplines like AI, ML, and VR, designed to rethink how tools should function. Our backing from SKETS Studio (with 2,000+ global projects) grounds our innovation in experience, scale, and design excellence.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "React.js Developer",
        "job_id": "4284763841",
        "company_name": "Visdum",
        "location": "India",
        "experience": "1-4 years",
        "salary": null,
        "key_skills": [
            "React.js"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4284763841/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Visdum:\n\nHeadquartered in Delaware, USA, Visdum is the world’s leading SaaS Solution for Sales Compensation Management.\n\n\n\n\nFounded in 2020 by ex-Oracle, Naukri, JP Morgan executives who have 50+ years of experience in the IT industry, we’re an early-stage SaaS startup with a mission to democratize sales commissions.\n\n\n\n\nVisdum helps Finance, Revenue Operations, and Sales teams manage and optimize sales incentive compensation process, giving real-time visibility to payouts and a decrease in calculation errors. SaaS teams around the world save hundreds of hours by automating commissions and drive higher sales revenue with a motivated sales team by using our sales compensation software.\n\n\n\n\nWe are ISO 27001 and SOC2 certified and adhere to top global standards in cloud based product development and information security.\n\n\n\n\nOur Impact So Far:\n\n13+ Countries Served\n\n$50M+ Commissions Processed\n\n\n\n\nThe Opportunity:\n\nWe are seeking a highly skilled React.js Developer with 1-4 years of experience to join our dynamic team. The ideal candidate will be responsible for developing high-quality web applications using React.js and will be able to work collaboratively with other developers, designers, and project managers.\n\n\n\n\nResponsibilities:\n\n● Develop high-quality, responsive web applications using React.js\n\n● Collaborate with cross functional teams to define, design, and ship new\n\nfeatures.\n\n● Ensure the technical feasibility of UI/UX designs\n\n● Optimize web applications for maximum speed and scalability\n\n● Implement automated testing and deployment processes\n\n● Participate in code reviews and provide constructive feedback to other\n\ndevelopers\n\n\n\n\nRequirements:\n\n● 1-3 years of experience in React.js development\n\n● Thorough understanding of React.js and its core principles\n\n● Strong proficiency in JavaScript, HTML, CSS and related web technologies\n\n● Understanding of RESTful API design and implementation\n\n● Familiarity with version control systems (Git, SVN, etc.)\n\n● Experience with popular React.js workflows (such as Flux or Redux)\n\n● Familiarity with code versioning tools.(such as git)\n\n● Experience with modern build pipelines e.g., Webpack or Babel",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "BI & Data Engineer",
        "job_id": "4288026198",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Azure Data Factory",
            "DataBricks",
            "Power BI",
            "DAX queries",
            "SQL",
            "ETL workflows"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288026198/",
        "posted_at": null,
        "job_description": "About the job\n\nWe are looking for a BI & Data Engineer! who can help our client build scalable data solutions, insightful dashboards, and business-driven data products.\n\nResponsibilities\n\n\nWork with business to understand a BI and data product requirement. \nIdentify right sources of data and understand the data with business data analysts. \nGet the required data in CDL (Azure Corporate Data Lake) platform. \nBuild data transformation (Data Bricks) to develop the required data sets and data product. \nBuild data visualization (Power BI) utilizing the data in CDL. \nSupport developed solution. \nMonitor usage and user satisfaction (continuous improvement). \nCollaborate with cross-functional teams including business analysts, data engineers, and stakeholders to align solutions with business goals. \nDocument processes, data flows, and technical solutions for knowledge sharing and future reference. \nEnsure data quality, governance, and security compliance in all deliverables. \nTroubleshoot issues, perform root cause analysis, and provide long-term fixes. \nStay updated with new features of Azure, Databricks, and Power BI to propose innovative solutions. \nProvide training or knowledge transfer sessions to business teams where required. \n\n\nTechnical Must Have\n\n\nAzure Data Factory \nDataBricks \nPower BI , DAX queries \nSQL \nGood command over English communication (Mandatory) \nStrong problem-solving and debugging skills \nExperience in designing scalable data pipelines and ETL workflows \n\n\nTechnical Good To Have\n\n\nMicrosoft Azure (ADF, Synapse, Logic Apps, Azure Functions, etc.) \nData Stage \nMicro Strategy \nLean & Agile \nExposure to CI/CD for data solutions \nKnowledge of data modeling and dimensional design \nUnderstanding of data governance, data security, and compliance frameworks \n\n\nSkills: Azure Data Factory,Power BI,Databricks,DAX,SQL,ETL,Azure Corporate Data Lake,Business Intelligence",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "WordPress Developer (Intern)",
        "job_id": "4285540364",
        "company_name": null,
        "location": "India",
        "experience": "6-8 months",
        "salary": null,
        "key_skills": [
            "WordPress",
            "HTML",
            "CSS",
            "PHP",
            "Elementor",
            "WPBakery"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285540364/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout the Role\n\nWe’re looking for a motivated WordPress Developer with around 6-8 months of prior experience to join our team as an intern. This is a great opportunity to work on real-world projects, sharpen your development skills, and contribute to creative web solutions for our clients.\n\nDuration: 3 months (can be extended based on performance)\n\n\n\n\nKey Responsibilities\n\nDevelop, customize, and maintain WordPress websites\n\n\n\n\nWork with themes, plugins, and custom code to meet project requirements\n\n\n\n\nEnsure responsive, mobile-friendly, and SEO-compliant design\n\n\n\n\nTroubleshoot and debug WordPress issues\n\n\n\n\nCollaborate with the design and content teams to implement changes\n\n\n\n\nMaintain proper backups and site security measures\n\n\n\n\nRequirements\n\n6-8 months of hands-on WordPress experience (including internships/freelance)\n\n\n\n\nStrong understanding of HTML, CSS, and basic PHP\n\n\n\n\nFamiliarity with popular page builders (Elementor, WPBakery, etc.)\n\n\n\n\nKnowledge of WordPress theme and plugin customization\n\n\n\n\nAbility to work in a fast-paced, deadline-driven environment\n\n\n\n\nGood problem-solving skills and attention to detail\n\n\n\n\nGood to Have\n\nKnowledge of basic SEO best practices\n\n\n\n\nPerks\n\nWork on live client projects and build your portfolio\n\n\n\n\nPossibility of a full-time offer based on performance\n\n\n\n\nWork Mode: On-site only (No work from home)\n\nStipend: As per company policy",
        "source": "linkedin",
        "relevance_score": "medium"
    },
    {
        "title": "Entry-Level Node.js Developer",
        "job_id": "4288016543",
        "company_name": null,
        "location": "India",
        "experience": "6 months – 1 year",
        "salary": null,
        "key_skills": [
            "Node.js",
            "JavaScript",
            "TypeScript",
            "REST APIs",
            "SQL",
            "NoSQL",
            "Git"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288016543/",
        "posted_at": null,
        "job_description": "About the job\n\nExperience: 6 months – 1 year of software development experience\n\n\n\n\nJob Description:\n\n We are seeking an enthusiastic Entry-Level Node.js Developer to join our team. The candidate will assist in developing, testing, and maintaining server-side applications using Node.js. You will work closely with senior developers to implement features, debug issues, and contribute to code reviews.\n\n\n\n\nResponsibilities:\n\nWrite clean, maintainable Node.js code under guidance\nAssist in building APIs and backend services\nDebug and troubleshoot application issues\nCollaborate with team members on design and implementation\nLearn and adapt to new tools, frameworks, and best practices\n\n\n\n\nRequirements:\n\n6m–1y experience in JavaScript/TypeScript and Node.js\nBasic understanding of REST APIs and databases (SQL/NoSQL)\nFamiliarity with version control (Git)\nStrong problem-solving skills and eagerness to learn",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "WordPress Web Developer",
        "job_id": "4288015722",
        "company_name": "Sense Digital",
        "location": "India",
        "experience": "1-2 years",
        "salary": null,
        "key_skills": [
            "WordPress",
            "PHP",
            "HTML5",
            "CSS3",
            "JavaScript",
            "MySQL",
            "Elementor",
            "Gutenberg",
            "SEO",
            "Git"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288015722/",
        "posted_at": null,
        "job_description": "About the job\n\nRole Description\n\nSense Digital is looking for a motivated WordPress Web Developer with approximately 1-2 years of hands-on experience to join our on-site team in Gurugram. You’ll support the design, development, and maintenance of WordPress websites that power our digital and marketing campaigns. This is a great opportunity for someone looking to grow their skills in a performance-driven, creative environment.\n\nKey Responsibilities\n\nBuild and maintain WordPress websites using custom themes and plugins.\nModify existing themes based on design guidelines and functionality requirements.\nImplement front-end changes using HTML, CSS, JavaScript, and WordPress tools.\nAssist with back-end development tasks such as custom post types, plugin configurations, and integrations.\nEnsure websites are mobile responsive, SEO-friendly, and fast-loading.\nSupport testing, debugging, and troubleshooting across multiple browsers and devices.\nWork closely with designers, content creators, and marketing teams to execute web projects.\n\nQualifications\n\nAround 1 year of hands-on experience in WordPress development.\nProficient in PHP, HTML5, CSS3, JavaScript, and basic MySQL.\nFamiliarity with theme customization and page builders like Elementor or Gutenberg.\nBasic understanding of SEO principles and web performance optimization.\nExposure to using tools like Git, FTP, and cPanel.\nStrong attention to detail and problem-solving mindset.\nBachelor’s degree in Computer Science, Web Development, or a related field (preferred).\nGood communication skills and ability to collaborate in a team environment.",
        "source": "linkedin",
        "relevance_score": "medium"
    },
    {
        "title": "Computer Vision Engineer",
        "job_id": "4288015519",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Python",
            "Image Processing",
            "OpenCV",
            "SciPy",
            "NumPy",
            "Keras",
            "TensorFlow",
            "PyTorch",
            "Ludwig",
            "TensorRT",
            "Nvidia DeepStream",
            "NLP",
            "NLU",
            "NLTK",
            "SpaCy",
            "Flair",
            "Docker",
            "Kuber"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288015519/",
        "posted_at": null,
        "job_description": "About the job\n\nSummary\n\n\n\n\nWe are seeking a highly skilled and motivated Computer Vision Engineer with strong expertise in Python, image processing, and algorithm design. The ideal candidate should be adept at developing fault-tolerant systems and optimizing data pipelines. This role requires an innovative thinker who thrives in a startup environment and is passionate about building scalable and efficient solutions.\n\n\n\n\nSkills Required\n\nStrong experience in Python and writing fault-tolerant code\nExtensive expertise in Image Processing, OpenCV, SciPy, and NumPy\nGood understanding of optimizing data processing pipelines\nCommand over geometry, statistics, and designing complex algorithms\nAbility to work and thrive in a startup environment, learn rapidly, and master diverse web technologies and techniques\n\n\n\n\nRoles and Responsibilities\n\nLeverage open-source code and libraries to quickly experiment and build novel solutions\nIndependently think of solutions to complex requirements; possess exceptional logical skills\nAnalyze current products in development, including performance, diagnosis, and troubleshooting\nWork with the existing framework and help evolve it by building reusable code and libraries\nSearch for and introduce new software-related technologies, processes, and tools to the team\n\n\n\n\nBrownie Points\n\nKnowledge of Keras, TensorFlow, PyTorch, Ludwig, TensorRT\nExperience with Nvidia DeepStream\nKnowledge of NLP and NLU (NLTK, SpaCy, Flair, etc.)\nUnderstanding of Docker, Kubernetes, and Git\nFamiliarity with JavaScript\n\n\n\n\nWhat We Have to Offer\n\nWork with a performance-oriented team driven by ownership and open to experimenting with cutting-edge technologies\nLearn to design systems for high accuracy, efficiency, and scalability\nMeritocracy-driven, candid startup culture",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Magento Developer",
        "job_id": "4288382458",
        "company_name": "emizentech.com",
        "location": "India",
        "experience": "2+ Years",
        "salary": null,
        "key_skills": [
            "Magento Development",
            "PHP",
            "MySQL",
            "JavaScript",
            "HTML",
            "CSS"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288382458/",
        "posted_at": null,
        "job_description": "About the job\n\n🚀 We’re Hiring! Magento Developer – Jaipur 🚀\n\nPosition: Magento Developer\n\n Experience Required: 2+ Years\n\n Location: Jaipur (Onsite)\n\n Interview Mode: Face-to-Face Only\n\nRequirements:\n\n ✅ Minimum 2+ years hands-on experience in Magento Development\n\n ✅ Strong knowledge of PHP, MySQL, JavaScript, HTML, CSS\n\n ✅ Experience in custom module development & theme integration\n\n ✅ Problem-solving skills & teamwork mindset\n\nWhat We Offer:\n\n 🌟 Competitive Salary\n\n 🌟 Growth-Oriented Environment\n\n 🌟 Exciting Projects & Career Advancement\n\n📍 Work Location: Jaipur\n\n 📅 Interview Mode: Face-to-Face Only\n\n👉 If you are passionate about eCommerce and want to grow your career with us, we’d love to meet you!\n\n📧 Send your CV to: hr@emizentech.com\n\n 📞 Contact: 960251777",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "PHP & Wordpress Developer",
        "job_id": "4285536127",
        "company_name": "ZenwareIT Software Solutions LLP",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "PHP",
            "Wordpress",
            "HTML",
            "CSS",
            "JavaScript",
            "Responsive Web Design"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285536127/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n \n\nZenwareIT Software Solutions LLP is a global IT services company delivering comprehensive software solutions to businesses of all sizes. Our mission is to empower organizations with reliable, scalable, and innovative technology tailored to their unique goals. We specialize in web development, mobile app development, digital marketing, cloud migration services, and IT consultation. With a presence in Bangalore, Tirupati, and Denmark, ZenwareIT combines global expertise with local understanding to solve complex business challenges and ensure our clients stay ahead in a digital-first world.\n\n\n Role Description\n \n\nThis is a full-time on-site role located in Tirupati for a PHP & Wordpress Developer. The PHP & Wordpress Developer will be responsible for developing, maintaining, and enhancing web applications, including both back-end and front-end work. You will collaborate with the design and content teams to implement responsive web designs, troubleshoot and resolve issues, and ensure the overall efficiency of web projects.\n\n\n Qualifications\n \nBack-End Web Development: Must possess skills in PHP and database management.\nFront-End Development: Proficient in HTML, CSS, JavaScript, and associated frameworks.\nResponsive Web Design: Experience with creating and implementing responsive design principles.\nWeb Design: Ability to work with design tools to translate visual designs into functional websites.\nWeb Development: Overall competency in web development best practices.\nExcellent problem-solving skills and attention to detail.\nAbility to work collaboratively within a team and effectively communicate ideas.\nPrevious experience in a similar role is preferred.\nBachelor's degree in Computer Science, Information Technology, or a related field is advantageous.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full Stack App Developer",
        "job_id": "4281091694",
        "company_name": "Hedgium",
        "location": "India",
        "experience": "2+ years",
        "salary": null,
        "key_skills": [
            "Python",
            "Django",
            "Angular",
            "React Native",
            "PostgreSQL",
            "SQLAlchemy",
            "RESTful APIs",
            "Go",
            "Git",
            "Docker"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4281091694/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Info:\n\nHedgium is a next-gen quantitative trading & advisory firm blending our deep market expertise and decades of experience with AI-powered algorithmic models. We design and deploy real-time adaptive strategies that capture opportunities, manage risk, and help investors stay ahead in fast-moving markets. Our risk-first approach focuses on performance and wealth preservation.\n\n\n\n\nØ We’re Hiring: Full Stack App Developer (Python-Django, Angular/React Native, PostgreSQL)\n\nØ Location: Thane, Maharashtra | Mode: Hybrid (3+2)\n\nØ Experience: 2+ years\n\n\n\n\nIf you’re a Full Stack Developer ready to be at the forefront of building a game-changing algorithmic trading platform, this is your moment. Join us as we engineer cutting-edge systems that blend AI, big data, and real-time market intelligence\n\n\n\n\nØ What You’ll Do:\n\n· Build responsive Web & Mobile apps (iOS/Android) using Python Django with Angular or React Native.\n\n· Design optimized PostgreSQL databases with ORMs like SQLAlchemy.\n\n· Implement secure authentication, payment gateways\n\n· Leverage RESTful APIs or languages like Go for critical microservices.\n\n· Apply async programming, concurrent services, and modular coding for scalable architecture.\n\n· Debug, test, and optimize frontend & backend for speed, security, and reliability.\n\n· Use AI-based tools to enhance code quality and performance.\n\n· Collaborate with product & design teams to deliver impactful features.\n\n· Manage workflows with Git, Docker, and CI/CD pipelines.\n\n· Bring problem-solving skills and a results-driven mind-set to every project.\n\n\n\n\nØ Why Join Us?\n\n· Flexible hybrid work + collaborative culture.\n\n· Chance to work on cutting-edge, AI-powered fintech solutions.\n\n· Recognition for performance + Potential to grow exponentially\n\n· ++ Free use of the platform to help build your personal portfolio/ trading income.\n\n\n\n\nIf this sounds like you, apply now at contact@hedgium.in or DM",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full Stack Engineer",
        "job_id": "4288015009",
        "company_name": null,
        "location": "India",
        "experience": "2–6 years",
        "salary": "Competitive Salary",
        "key_skills": [
            "Next.js",
            "React.js",
            "TypeScript",
            "Node.js",
            "Python",
            "Go",
            "Django",
            "FastAPI",
            "PostgreSQL",
            "MongoDB",
            "Redis",
            "AWS",
            "GCP",
            "Docker",
            "Kubernetes",
            "Terraform",
            "GraphQL",
            "WebSockets",
            "Kafka",
            "RabbitMQ",
            "AI/ML"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288015009/",
        "posted_at": null,
        "job_description": "About the job\n\nLocation: Bangalore (In-Office, 5 Days)\n\n\n\n\nExperience: 2–6 years\n\nType: Full-time\n\nPerks: Competitive Salary, Health Insurance, ESOP\n\n\n\n\nAbout the Role\n\nWe're hiring a Full Stack Engineer (Next.js) to help us build scalable, AI-powered financial tools for investors and financial institutions. You’ll work closely with our AI/ML team to bring intelligence and automation into real-world workflows, while also shaping the core architecture of our tech stack.\n\nThis is your chance to join early, move fast, and build something that actually matters.\n\n\n\n\nWhat You’ll Do\n\n\n\n\nBuild and maintain fast, scalable web apps using React.js/Next.js\nDesign APIs and microservices with Node.js, Python, or Go\nWork with AI/ML engineers to integrate intelligent features into our platform\nProcess and serve financial data through secure, efficient pipelines\nCraft responsive UIs with clean UX and performance in mind\nCollaborate with product, design, and business teams\nMaintain high code quality and follow dev best practices\n\n\n\n\nOur Stack (Preferred but Not Mandatory)\n\n\n\n\nFrontend: React.js, Next.js, TypeScriptBackend: Node.js, Django/FastAPI, GoDatabase: PostgreSQL, MongoDB, RedisInfra: AWS/GCP, Docker, Kubernetes, TerraformOther: GraphQL, WebSockets, Kafka/RabbitMQ\n\n\n\n\nWhat You’ll Bring\n\n2–6 years of full-stack dev experience\nStrong problem-solving chops and a builder’s mindset\nExperience with distributed, scalable systems\nExposure to AI/ML products is a big plus\nComfort working in a fast-paced, high-ownership environment\n\n\n\n\nWhat You’ll Get\n\nCompetitive pay and meaningful ESOPs\nHealth insurance and wellness perks\nOwnership, autonomy, and a chance to shape core systems\nA smart team building real AI solutions for BFSI\n\n\n\n\nWork Mode\n\nThis is a full-time, in-office role (Bangalore, 5 days/week). We believe the best products get built when great people work together in real life!",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Frontend Developer",
        "job_id": "4265874315",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Reactjs",
            "Typescript",
            "JavaScript",
            "HTML",
            "CSS",
            "Angular",
            "React.js",
            "Vue.js",
            "CSS",
            "Tailwind CSS",
            "SCSS",
            "JavaScript",
            "TypeScript",
            "RESTful APIs",
            "UI/UX"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4265874315/",
        "posted_at": null,
        "job_description": "About the job\n\nThe ideal candidate will be responsible for designing, developing, testing, and debugging responsive web and mobile applications for the company. Using Reactjs, Typescript, JavaScript, HTML, and CSS, this candidate will be able to translate user and business needs into functional frontend design. \n\n \n\nResponsibilities\n\n\n\n\n Work on technologies like Angular, React.js, TypeScript, Vue.js.\n Building reusable code and libraries for future use.\n Collaborate with back-end developers to integrate front-end functionality with server-side logic.\n Ensure the technical feasibility of UI/UX designs.\n Optimize applications for maximum speed and scalability.\n Knowledge of web design and user application requirements.\n Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model.\n Identifying web-based user interactions.\n Developing and implementing highly responsive user interface components using React concepts.\n Writing application interface codes using JavaScript following React.js workflows.\n Troubleshooting interface software and debugging application codes.\n Developing and implementing front-end architecture to support user interface concepts.\n Documenting application changes and developing updates.\n Familiarity with RESTful APIs.\n Mentor junior developers and provide technical guidance to the : \n In-depth knowledge of front-end coding languages including React, CSS, Tailwind CSS, SCSS, JavaScript, TypeScript.\n Must have knowledge of TypeScript, React.js, Vue.js, HTML, CSS.\n Experience with RESTful APIs and AJAX, familiarity with front-end build tools (Webpack, Grunt, Gulp, etc.\n\n\n\n\nQualifications\n\nBachelor's degree or equivalent in Computer Science\n2+ years' experience in frontend development\nExperience building object oriented web applications in JavaScript, HTML5, and CSS3",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Python Engineer",
        "job_id": "4285097889",
        "company_name": "NextBurb",
        "location": "India",
        "experience": "0–2 years",
        "salary": null,
        "key_skills": [
            "Python",
            "AI",
            "LLM APIs",
            "OpenAI",
            "Claude",
            "Vector databases",
            "LangChain",
            "Data processing",
            "Web scraping",
            "API integrations"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285097889/",
        "posted_at": null,
        "job_description": "About the job\n\nRole: Python Engineer (Fluent with AI Tools)\n\nLocation: Pune (Balewadi to be precise)\n\nWork Timings: Flexible hours but note it is in-office 5-days a week.\n\nTeam: NextBurb — data-powered real-estate startup, US HQ, with founders in Boston 🇺🇸 and Pune 🇮🇳\n\n\n\n\nAbout NextBurb\n\n\n\n\nNextBurb crunches millions of data points to help US real estate pros spot the next hot neighborhood — before it’s obvious.\n\n📈 Profitable and product-market fit. Home buyers and Real Estate Agents vouch for Nextburb\n\n🛠️ Fast experiments, fast learning — you ship, test, and see results\n\n⚡ Lean team, zero fluff — your work directly impacts users and revenue\n\n\n\n\nWhat you’ll work on\n\n\n\n\n🔍 Build robust Python-based systems to process and analyze real estate data at scale\n\n🧠 Apply LLMs and AI tools to rank properties, recommend neighborhoods, and personalize user experiences\n\n⚙️ Automate data flows, web scraping, API integrations, and enrichment pipelines\n\n🔗 Connect to tools like Zillow, Google Maps, Vector DBs, and CRM APIs + Real Estate MLS\n\n🧪 Build internal tools to help our team move faster — from dashboards to data validators\n\n\n\n\nYou’ll fit right in if you\n\n\n\n\nHave 0–2 years of professional experience — recent grads and self-taught devs welcome\nAre strong in Python and curious about data, automation, and applied AI\nHave tinkered with LLM APIs (OpenAI, Claude), vector databases, or tools like LangChain\nEnjoy solving messy data problems and writing clean, modular code\nBonus points: exposure to FastAPI, Postgres, Redis, or frontend (React)\n\n\n\n\nWhy you’ll love working here\n\n\n\n\n💵 Earn in USD + performance-based annual bonuses\n\n🧘 Remote + async flexibility — manage your own time and workspace\n\n🚀 Get stuff live, fast — your work hits production and drives business impact\n\n🤝 Work directly with technical founders and a high-trust, no-BS team\n\n\n\n\nFresh, fast, and AI-fluent?\n\nApply now — or share this with someone who’d be a perfect fit! 🌟🏡",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full Stack Engineer",
        "job_id": "4282534857",
        "company_name": "Digital Xplode",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Full Stack Development",
            "Front-End Development",
            "HTML",
            "CSS",
            "JavaScript",
            "Back-End Web Development",
            "Software Development",
            "Coding",
            "Testing",
            "Debugging"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4282534857/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nDigital Xplode, founded in Noida in 2015, is a comprehensive web solution provider that offers services such as Search Engine Optimization, Social Media Marketing, Pay Per Click Advertising, and Web Design. Our primary focus is to integrate technology with storytelling to help businesses grow and adapt in the digital world. We are dedicated to leading digital transformations by creating strategic, creative, and digital ideas. Serving over 100 clients across various sectors in the USA, we are committed to breaking digital barriers.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Full Stack Engineer located in Noida. The Full Stack Engineer will be responsible for both front-end and back-end web development, including software development tasks. Daily responsibilities include developing and maintaining web applications, collaborating with the design and marketing teams, troubleshooting issues, and ensuring optimal performance and responsiveness of applications.\n\n\n\n\nQualifications\n\nProficiency in Front-End Development, including HTML, CSS, and JavaScript\nExperience in Back-End Web Development with server-side languages and frameworks\nSolid understanding of Full-Stack Development principles and best practices\nStrong Software Development skills, including coding, testing, and debugging\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a team environment\nBachelor's degree in Computer Science, Information Technology, or a related field is preferred\nPrior experience in a similar role is a plus.\nAI/ML knowledge is an added advantage.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Software Developer Intern",
        "job_id": "4285098797",
        "company_name": "Averoft",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Software infrastructure development",
            "Robotics",
            "Artificial Intelligence",
            "Machine Learning",
            "ERP Software",
            "mobile applications"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285098797/",
        "posted_at": null,
        "job_description": "About the job\n\nAveroft has been established as a Digital Solutions company in Australia, since 2012. Our traditional business model is based on providing innovative digital solutions and specializing in everything from conceptualization to ongoing maintenance. Based on the decision of the company to diversify our projects; we have now established this corporation in India, USA, Tanzania, & Congo and a clientele in USA, UK, Africa, Brazil and India.\n\n\n\n\nCompany Strategy\n\n\n\n\nCore values: We believe in treating our customers with respect and faith. We grow through creativity, invention and innovation. We integrate honesty, integrity and business ethics into all aspects of our business functioning.\n\n\n\n\nGoals: \n\n- > Expansion of business in India in the field of Research & Development with major focus on Robotics, Artificial Intelligence, Machine Learning, ERP Software & mobile applications and develop a strong base of key customers.\n\n- > We believe and aim that every business deserves and should have a website. People use the internet like they used to use the phone book. A business website gives your business legitimacy. What’s Your Reason for Not Being Online?\n\n- > Launching new projects with innovative technology and manufacturing devices to create more jobs.\n\n\n\n\nAveroft, Bhopal seeks a Software Developer Intern at our Vidya Nagar, Bhopal, MP, India office.\n\n\n\n\nSelected intern's day-to-day responsibilities include:\n\n1. Working on software infrastructure development\n\n2. Gathering requirements to design and plan software solutions\n\n3. Implementing software solutions by writing code in a matter consistent with our company's coding standards and guidelines\n\n4. Keeps track of bugs in their code, and fixes bugs in a timely manner.\n\n5. Participating in the planning and scheduling of tasks and meeting deadlines as determined jointly with their manager\n\n6. Protecting operations by keeping information confidential\n\n7. Handling other duties as assigned\n\n\n\n\nRequired Experience\n\n\n\n\nPursuing or Completed Bachelor’s Degree in Computer Science or related field\nKnowledge of Programming Language's\n\n\n\n\nJob Type : Full-Time\n\nSalary: Unpaid Internship\n\n\n\n\nLocation: Bhopal (On Site)\n\nAddress: Averoft, Sector A, Vidya Nagar, Bhopal, MP, India\n\nwww.averoft.com\n\njobs.in@averoft.com",
        "source": "linkedin",
        "relevance_score": "medium"
    },
    {
        "title": "Full Stack Software Engineer",
        "job_id": "4287859211",
        "company_name": "Smart Commerce Solutions Pvt. Ltd.",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "PHP",
            "Drupal",
            "MySQL",
            "HTML",
            "CSS",
            "JavaScript",
            "Python",
            "Flutter",
            "Drupal custom module development",
            "Agile"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287859211/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nSmart Commerce Solutions Pvt. Ltd. specializes in product development and automating business processes on Web and Mobile for businesses using our proprietary Low Code Platform. Our offerings caters to Startups, SMEs, and large corporations. We prioritise building products that serve businesses and are tailored to their specific needs. Our focus is on delivering neat, compact, comprehensive, and affordable solutions.\n\n\n\n\nRole Description\n\nAs a Full Stack Software Engineer, you will be responsible for building and deploying web-based solutions for enterprise clients. You will work across the stack using PHP, Drupal, MySQL, HTML/CSS/JavaScript, with opportunities to contribute using Python and Flutter. The role involves both independent problem-solving and collaborative development in an Agile environment.\n\n\n\n\nKey Responsibilities\n\n • Develop and maintain web applications using PHP and Drupal\n\n • Create custom Drupal modules and ensure scalable, efficient code\n\n • Work with MySQL databases to design and develop efficient queries\n\n • Collaborate with customers to deliver automation solutions on Smart Platform\n\n • Explore and contribute using Python and/or Flutter where applicable\n\n\n\n\nQualifications\n\nIn Depth knowledge of PHP and MYSQL is essential.\nExperience in Drupal custom module development is preferable\nProficiency in HTML/CSS/JS\nKnowledge of flutter and / or Python would be a plus\nStrong problem-solving and analytical skills\nAbility to work independently and collaboratively in a team\nBachelor's degree in Computer Science or related field\nExperience with Agile development methodologies is a plus",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Fullstack Developer",
        "job_id": "4287848359",
        "company_name": "Ira Technologies India Pvt Ltd",
        "location": "India",
        "experience": "2–5 years",
        "salary": null,
        "key_skills": [
            "React",
            "Node.js",
            "React.js",
            "Node.js",
            "REST APIs",
            "Git",
            "Fullstack Development"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287848359/",
        "posted_at": null,
        "job_description": "About the job\n\n\n\n\nAbout Us:\n\nAt Ira Technologies India Pvt Ltd, we are building innovative and impactful solutions with a passionate engineering team. We are looking for talented developers who are eager to grow, contribute, and thrive in a collaborative environment.\n\n\nFullstack Developer (React + Node.js)\n\n\n\n\nResponsibilities:\n\nDesign, develop, and maintain scalable fullstack applications using React and Node.js\nCollaborate with cross-functional teams to define, design, and ship new features\nWrite clean, efficient, and maintainable code\nOptimize applications for maximum speed and scalability\nParticipate in code reviews, troubleshooting, and debuggin\n\n\n\n\nRequirements:\n\n2–5 years of hands-on development experience\nStrong proficiency in React.js and Node.js\nGood understanding of REST APIs, databases, and front-end technologies\nFamiliarity with version control systems (Git)\nStrong problem-solving and communication skills\nImmediate joiners preferred\n\n\n\n\nLocation: Sector 62, Noida ( Onsite)\n\n\n\n\nPlease share your resume at ridhi.rawal@iratechnologies.com",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Data Engineer",
        "job_id": "4287856160",
        "company_name": "Databerry Technologies",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Data Governance",
            "Data Quality",
            "Data Product Requirements",
            "Data Pipelines",
            "SQL",
            "Python",
            "Azure Databricks",
            "Azure Data Factory",
            "SQL Server",
            "Azure Synapse Analytics",
            "Data Modeling",
            "Kimball",
            "Star Schema",
            "Datavault",
            "Big-data tools",
            "Cloud",
            "ELT",
            "ETL",
            "PySpark",
            "API Ingestion",
            "CI/CD",
            "Terraform"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287856160/",
        "posted_at": null,
        "job_description": "About the job\n\nAs a member of the Data Engineering team, you will:\n\n\n\n\nImplement continuous improvements to our data governance practices and implement data \n\nquality improvements.\n\nPartner with key stakeholders to understand and refine data product requirements.\n\nDesign and develop reliable data product pipelines that transform data at scale, orchestrated \n\nvia Azure Data Factory, using SQL and Python in Azure Databricks.\n\n\n\n\nWhat you will bring to Databerry Technologies:\n\nExperience with relational and MPP databases such as SQL Server and Azure Synapse Analytics.\n\nExperience with data modeling techniques (Kimball/Star, Datavault, etc).\n\nExperience with SQL and query design on large, complex datasets.\n\nExperience with cloud and big-data tools and frameworks like Azure Databricks and Azure Data \n\nFactory.\n\nExpertise in designing and developing with distributed data processing platforms.\n\nExperience using Azure Data Factory to develop data pipelines.\n\nExperience using ELT/ETL tools such as Azure Data Factory and Azure Databricks (with \n\nPython/PySpark).\n\nFamiliarity with API ingestion processes.\n\nCI/CD with Terraform (Nice to have).\n\nAbility to learn new technical concepts quickly.\n\nAbility to operate in a fast-paced and dynamic environment.\n\nStrong collaboration and communication skills.\n\n\n\n\nPassion! \n\nWe are passionate about our mission and technology, and we want you to \n\ndemonstrate that too.\n\n\n\n\nOwnership! \n\nWe want you to own your work, be accountable, and push it through to the finish line.\n\n\n\n\nExpertise! \n\nWe do not need you to know everything, but we hope you have deep knowledge in \n\nat least one area and can start contributing quickly. We would love to learn from you in your \n\narea(s) of expertise.\n\n\n\n\nKey Attributes Required:\n\nPeople Skills:\n\nAbility to work effectively in cross-functional teams and collaborate openly with data engineers, \n\nsoftware engineers, and other stakeholders.\n\nProven track record in conflict resolution, effective communication, and fostering a positive \n\nwork environment.\n\nCustomer Service / External Impact:\n\nStrong focus on internal customer service to assist software and data engineering teams in \n\nachieving their objectives.\n\nThe ability to effectively communicate with external vendors, client-facing teams, and \n\nsometimes clients themselves to ensure seamless deployment and maintenance of services.\n\n\n\n\nDecision-Making:\n\nCapacity for high-level, strategic decision-making to choose appropriate tools and technologies, \n\nwhile also being capable of low-level technical decisions required for immediate problem solving.\n\nAbility to weigh pros and cons and consult with teams for decisions that impact system uptime, \n\nsecurity, and the delivery process.\n\n\n\n\nInitiative and Independence:\n\nSelf-starter who can independently identify issues and formulate solutions with minimal \n\nsupervision.\n\nComfortable taking the initiative to lead projects or research and introduce new technologies \n\nthat can benefit the system's efficiency, security, and performance.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "PHP Developer",
        "job_id": "4285097259",
        "company_name": "Lowe Creative Atelier",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "PHP",
            "Back-End Web Development",
            "Object-Oriented Programming",
            "Front-End Development",
            "Software Development",
            "SEO",
            "PPC Advertising",
            "Social Media Marketing"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285097259/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nLowe Creative Atelier is a leading IT company specializing in mobile application development, web development, and digital marketing. We are dedicated to creating user-friendly and innovative digital solutions that revolutionize the way people interact with technology. Our expert developers specialize in custom mobile apps and stunning, functional websites tailored to meet our clients' specific business needs. We also offer top-notch digital marketing services, including SEO, PPC advertising, and social media marketing, to help our clients increase their online visibility and brand awareness.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a PHP Developer located in Ahmedabad. The PHP Developer will be responsible for developing back-end components, connecting the application with other web services, and supporting front-end developers by integrating their work with the application. Additional responsibilities include building efficient, testable, and reusable PHP modules and solving complex performance problems and architectural challenges.\n\n\n\n\nQualifications\n\nStrong skills in Back-End Web Development and Object-Oriented Programming (OOP)\nExperience in Front-End Development and Programming\nProficiency in Software Development techniques and best practices\nExcellent problem-solving skills and attention to detail\nAbility to work both independently and as part of a team\nBachelor's degree in Computer Science, Software Engineering, or a related field\nExperience with PHP frameworks like Symfony, Laravel is a plus\nFamiliarity with SQL/NoSQL databases\n\n\n\n\nPerks\n\n5 Days working\nFlexible working hours",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Internship",
        "job_id": "4287845527",
        "company_name": "LeadMasters AI",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "AI",
            "Automation",
            "Marketing Automation",
            "CRM",
            "Full-stack development",
            "API integration",
            "Web development",
            "Backend development",
            "Databases"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287845527/",
        "posted_at": null,
        "job_description": "About the job\n\nInternship Opportunity – LeadMasters AI (Dubai-Registered AI Company)\n\n\n\n\nAbout LeadMasters AI\n\n LeadMasters AI is a Dubai-registered Company operating out of Hyderabad. We build solutions in AI-driven marketing automation, social media management, CRM workflows, and intelligent lead generation. Our mission is to help businesses scale with agentic AI-powered automation — blending technology, strategy, and execution into one seamless platform.\n\nAt LeadMasters AI, interns don’t just observe. They work directly with our team to build, ship, and learn by doing in a fast-paced startup environment.\n\n\n\n\nInternship (Work From Office, Hyderabad)\n\n We are looking for motivated interns who want to kickstart their careers by working on real-world AI and automation projects. This internship is hands-on and meant for candidates who want practical startup exposure rather than classroom-style training.\n\n\n\n\nResponsibilities\n\nWork with developers on AI-driven projects in marketing automation and CRM\nBuild, test, and improve features used in production environments\nGain exposure to full-stack development, API integration, and workflow automation\nLearn how startups develop and scale AI-powered products\n\n\n\n\nExpectations\n\nInterest in software development, AI, and automation\nBasic understanding of web development (frontend, backend, or databases preferred)\nAbility to learn quickly, adapt, and solve problems independently\nMust report to the office daily in Sainikpuri, Hyderabad\n\n\n\n\nSelection Process\n\n Candidates must complete an assessment project to qualify.\n\n\n\n\n📂 Assessment Project:\n\n https://drive.google.com/drive/folders/1ViJEhOYOmWwqPrjyARgVk5fnPfRlh3zt\n\n\n\n\n📩 Submit your work within 1 day to support@leadmasters.ai\n\n\n\n\nSuccessful submissions will be shortlisted for the next Technical Call.\n\n\n\n\nLeadMasters AI Team",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full Stack Developer Intern",
        "job_id": "4287853406",
        "company_name": "Mindcraft Labs",
        "location": "India",
        "experience": "Internship",
        "salary": "₹20,000 per month",
        "key_skills": [
            "Full Stack Developer",
            "Node.js",
            "React",
            "TypeScript",
            "Python",
            "AI-automation",
            "JavaScript",
            "Express",
            "Fastify",
            "Python",
            "FastAPI",
            "MongoDB",
            "PostgreSQL",
            "Tailwind",
            "MUI"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287853406/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Title: Full Stack Developer — Intern (Node.js / React / TypeScript / Python)\n\n Company: Mindcraft Labs\n\nLocation: Remote (India)\n\n Stipend: ₹20,000 per month during a 3‑month probation / internship\n\n CTC on PPO: ₹12 LPA on successful conversion to full‑time\n\n Position Type: Full‑Time after PPO | Internship during probation\n\n\n\n\nAbout Mindcraft\n\nMindcraft is a cutting‑edge AI‑automation agency that partners with businesses across industries to build custom, AI‑driven solutions. From voice AI to workflow bots, we spearhead projects that streamline operations, elevate customer engagement, and unlock new revenue streams.\n\n\n\n\nRole Overview\n\nWe’re looking for a motivated Full Stack Developer Intern who is eager to work across multiple ongoing client and internal projects—not tied to a single product but spanning web apps, API services, and AI integrations. You’ll spend your internship building end‑to‑end features with modern JavaScript/TypeScript and Python stacks, receiving mentorship from senior engineers, and—if you crush it—earning a Pre‑Placement Offer (PPO) for a permanent role at ₹12 LPA.\n\nThis is a high‑impact opportunity for someone who loves to learn fast, ship code, and see their work in production.\n\n\n\n\nKey Responsibilities\nBuild responsive front‑end components with React (TypeScript) and Tailwind/MUI.\nDesign back‑end services and REST/GraphQL APIs with Node.js (Express/Fastify) and Python (FastAPI).\nWork with multiple data stores: MongoDB, PostgreSQL, Supabase, Firebase, and AWS Aurora.\nWrite clean, testable, version‑controlled code (Git & GitHub flow).\nDeploy and monitor applications on AWS/Azure; set up CI/CD pipelines when needed.\nCollaborate closely with AI engineers to wire up chatbots, voice AI, or other ML services.\nParticipate in daily stand‑ups, code reviews, and sprint demos—remote‑first.\n\n\n\n\nRequired Skills\nSolid grasp of JavaScript/TypeScript, React, and modern front‑end tooling.\nWorking knowledge of Node.js and at least one Python web framework.\nComfort with RESTful design principles, JSON, and API integrations.\nExperience using Git for version control and collaborating via pull requests.\nBasic query skills in either SQL (Postgres) or NoSQL (MongoDB/Firebase).\nAbility to learn quickly, troubleshoot independently, and communicate clearly in a remote setup.\n\n\n\n\nPreferred Qualifications\nExposure to cloud services (AWS, Azure) and containerization (Docker).\nFamiliarity with serverless architectures or edge functions (Supabase, Vercel, Cloudflare).\nCuriosity about AI/LLM platforms (OpenAI, Cohere) or voice AI stacks.\nPrior contribution to open‑source projects or a public portfolio on GitHub.\n\n\n\n\nWhat We Offer\nReal ownership: Ship production code on live projects from week one.\n1‑on‑1 mentorship: Code reviews, pair programming, and career coaching.\nRemote‑friendly culture: Flexible hours, async communication, zero micromanagement.\nPath to PPO: Top performers receive a full‑time offer at ₹12 LPA plus growth opportunities.\nAI playground: Access to leading AI APIs and the freedom to prototype your ideas.\n\n\n\n\nIf you're ready to build the future with AI and want to work with a team that's redefining automation, we’d love to hear from you!\n\nMindcraft AI Automation Agency\n\n Innovate, Automate, Elevate\n\n https://mindcraftlabs.io",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Android Mobile Developer",
        "job_id": "4287845823",
        "company_name": "FriskaAi",
        "location": "India",
        "experience": "1–3 years",
        "salary": null,
        "key_skills": [
            "Android Development",
            "Kotlin",
            "Java",
            "Jetpack Compose",
            "Android SDK",
            "Android Studio",
            "FHIR",
            "HL7",
            "EHR",
            "EMR",
            "HIPAA",
            "OAuth2.0",
            "JWT",
            "Azure DevOps",
            "Docker",
            "Git",
            "GitLab",
            "PostgreSQL",
            "MySQL",
            "MongoDB",
            "Cosmos DB",
            "TLS/SSL",
            "AES encryption",
            "Espresso",
            "JUnit",
            "WebSockets",
            "Firebase Cloud Messaging",
            "Healthcare",
            "AI",
            "HealthTech"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287845823/",
        "posted_at": null,
        "job_description": "About the job\n\nRole: Android Mobile Developer (Healthcare Domain)\n\nExperience: 1–3 years\n\nIndustry: HealthTech / AI\n\n\n\n\nAbout FriskaAi\n\nAt FriskaAi, we’re revolutionizing personalized healthcare through cutting-edge AI. Our mission is to empower individuals and communities with intelligent, tailored health solutions that drive better outcomes. By combining advanced technology with a human-centric approach, we’re transforming the way people engage with their well-being.\n\n\n\n\nResponsibilities\n\nDesign, build, and maintain Android applications using Kotlin/Java with Android SDK and Jetpack Compose.\nCollaborate with backend engineers to integrate FHIR/HL7 APIs and healthcare workflows (EHR/EMR systems).\nImplement HIPAA-compliant data handling, encryption, and secure authentication.\nWork with product and UI/UX teams to deliver high-quality healthcare apps.\nManage CI/CD pipelines via Azure DevOps and containerized builds with Docker.\nWrite unit tests (Espresso/JUnit) and ensure high code coverage.\nBuild real-time communication features using WebSockets and push notifications (Firebase Cloud Messaging).\n\n\n\n\nCore Technical Skills\n\nAndroid Development: Kotlin, Java, Jetpack Compose, Android SDK, Android Studio.\nAPIs & Integration: RESTful APIs, OAuth2.0/JWT, HL7/FHIR.\nCloud & DevOps: Azure App Services, Azure Functions, Azure Blob Storage, Docker, Git/GitLab.\nDatabase Knowledge: PostgreSQL/MySQL, MongoDB/Cosmos DB.\nSecurity & Compliance: HIPAA, GDPR, TLS/SSL, AES encryption.\nTesting: Espresso, JUnit, Postman/Newman for APIs.\n\n\n\n\nNice-to-Have\n\nCross-platform framework experience (Flutter / React Native).\nFamiliarity with FastAPI backend and GraphQL APIs.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Developer",
        "job_id": "4288066168",
        "company_name": "QualityKiosk Technologies",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "JavaScript",
            "TypeScript",
            "React",
            "React Native",
            "Node.js",
            "Express.js",
            "AI",
            "Quality Engineering",
            "QA Automation",
            "Performance Assurance",
            "Intelligent Automation",
            "Customer Experience Management"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288066168/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nQualityKiosk Technologies is a leading independent Quality Engineering (QE) provider and digital transformation enabler. Founded in 2000, the company specializes in quality engineering, QA automation, performance assurance, intelligent automation, and customer experience management. With operations across 25+ countries and a workforce of over 3500 employees, QualityKiosk Technologies supports some of the top brands in banking, e-commerce, automotive, telecom, and other industries in their business transformation goals. The company has been recognized by global advisory firms and received awards for its innovative solutions and positive client impact.\n\n\n\n\nRole Description\n\nThis is a full-time hybrid role for a Developer located in Bengaluru. The Developer will work on AI-native platforms by building snap-ins on DevRev, integrating the PLuG SDK with web and mobile applications, and implementing backend customizations. Day-to-day tasks include coding, debugging, API integrations, writing logic, and collaborating with cross-functional teams to deliver seamless platform solutions. The Developer will also contribute to client engagements, technical documentation, and follow best practices to ensure high-quality outcomes.\n\n\n\n\nPreferred Qualifications\n\nProficiency in JavaScript/TypeScript\nHands-on experience or strong fundamentals in React/React Native for web & mobile development\nKnowledge of Node.js and backend frameworks (Express.js or similar)\nUnderstanding of REST APIs, GraphQL, webhooks, JSON handling\nFamiliarity with SDK integration into applications\nVersion control with Git/GitHub\nStrong problem-solving skills, debugging abilities, and eagerness to learn new platforms\nAbility to work collaboratively in a team environment\nBachelor’s degree in Computer Science, Engineering, or a related field\n\n\n\n\nFreshers or early-career developers with good coding fundamentals are welcome to apply",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "AI Developer",
        "job_id": "4285570623",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "AI",
            "Machine Learning",
            "Biologics",
            "Drug Discovery",
            "PyTorch",
            "TensorFlow",
            "Cheminformatics",
            "RDKit",
            "Python",
            "Bioinformatics",
            "Computational Biology",
            "protein structure modeling",
            "docking simulations",
            "molecular dynamics"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285570623/",
        "posted_at": null,
        "job_description": "About the job\n\n🚀 Job Opportunity – AI Developer (Biologics & Drug Discovery)\n\n📍 Location: Hyderabad, Onsite.\n\n\n\n\nAbout the Role:\n\nWe are seeking an innovative AI Developer with a strong life sciences background to design and implement machine learning solutions that accelerate biologics research. You will work at the cutting edge of AI and drug discovery, building models for protein-ligand interactions, compound screening, and predictive therapeutic modeling.\n\n\n\n\nKey Responsibilities:\n\n • Develop and deploy AI/ML models for protein binding affinity prediction, compound screening, and structure–activity relationship (SAR) analysis.\n\n • Integrate diverse biological datasets (protein structures, assay results, omics data) into model pipelines.\n\n • Collaborate with cross-functional teams of bioinformaticians, chemists, and data scientists to refine algorithms and validate results.\n\n • Build knowledge graphs and embeddings to represent biological entities and their relationships.\n\n • Contribute to the design of AI-driven discovery platforms for biologics optimization.\n\n\n\n\nRequired Qualifications:\n\n • Master’s/PhD in Computer Science, Bioinformatics, Computational Biology, or related field.\n\n • Expertise with deep learning frameworks (PyTorch, TensorFlow) and cheminformatics tools (RDKit).\n\n • Experience with protein structure modeling, docking simulations, or molecular dynamics.\n\n • Strong Python skills and familiarity with scientific computing workflows.\n\n • Understanding of biologics (antibodies, peptides) and therapeutic applications.\n\n\n\n\nPreferred Skills:\n\n • Experience with graph neural networks (GNNs) or transformer models for protein sequences (AlphaFold, ESM).\n\n • Knowledge of high-throughput screening (HTS) and assay data analytics.\n\n • Exposure to cloud platforms (AWS, GCP) and MLOps practices.\n\n\n\n\n📩 How to Apply:\n\nIf you are passionate about combining AI with life sciences to transform drug discovery, we’d love to hear from you! Send your CV to vishal.raj@therxcloud.com.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Software Developer",
        "job_id": "4288015736",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Node.js",
            "Express",
            "Apollo GraphQL",
            "Socket.io",
            "Jest",
            "TypeScript",
            "PostgreSQL",
            "MySQL",
            "WebSocket",
            "REST",
            "AWS",
            "Git",
            "Swagger",
            "Redis",
            "JWT",
            "OAuth2",
            "microservices architecture",
            "Docker",
            "Kubernetes",
            "Python"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288015736/",
        "posted_at": null,
        "job_description": "About the job\n\nRoles and Responsibilities:  \n\nDesign and develop highly complex application components, and integrate software packages, programs, and reusable objects capable of running on multiple platforms. \nLeverage open-source code and libraries to quickly experiment and build novel solutions. \nIndependently think of solutions to complex requirements; possess exceptional logical skills. \nAnalyze current products in development, including performance, diagnosis, and troubleshooting. \nWork with the existing framework and help evolve it by building reusable code and libraries. \nSearch and introduce new software related technologies, processes, and tools to the team. \n\n \n\nSkills required: \n\nProficiency in Node.js, Express, Apollo GraphQL, Socket.io, Jest, and TypeScript.\nSolid understanding of PostgreSQL and MySQL.\nProficiency with WebSocket and REST.\nFamiliarity with cloud platforms like AWS and tools like Git and Swagger.\nExperience with Redis, JWT, OAuth2, and microservices architecture.\nAbility to write clean, performant, and maintainable code.\nUnderstanding the nature of asynchronous programming and its challenges and workarounds.\n\n \n\nBrownie Points: \n\nKnowledge of Docker & Kubernetes \nFamiliarity with Python \n\n \n\nWhat we have to offer:  \n\nWork with a performance-oriented team driven by ownership and open to experiments with cutting-edge technologies. \nLearn to design systems for high accuracy, efficiency, and scalability. \nFlexible hours. \nLearn to innovate. \nMeritocracy driven, candid startup culture.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Manual Testers",
        "job_id": "4285523230",
        "company_name": null,
        "location": "India",
        "experience": "2–4 years",
        "salary": null,
        "key_skills": [
            "Manual Testing",
            "API testing",
            "Postman",
            "Swagger",
            "Web application testing",
            "Mobile application testing",
            "JIRA",
            "Bugzilla",
            "Agile methodology",
            "Charles Proxy",
            "Fiddler",
            "SQL"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285523230/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Description :\n\n\n\n\nWe are seeking detail-oriented Manual Testers with 2– 4 years of hands-on experience in API testing. The ideal candidate will bring strong analytical skills, a deep understanding of testing methodologies, and a passion for delivering high-quality products. Experience with web and mobile application testing is a strong advantage.\n\n\n\n\nKey Responsibilities:\n\nDesign, develop, and execute test cases for functional, integration, and regression testing\nPerform API testing using tools like Postman, Swagger, etc.\nCollaborate with developers and product teams to understand requirements and report bugs effectively\nIdentify, document, and track bugs using tools like JIRA, Bugzilla\nConduct manual testing across web and mobile platforms (iOS/Android)\nEnsure quality benchmarks are met prior to product release\nParticipate in test planning, effort estimation, and strategy discussions\n\n\n\n\nRequired Skills & Experience:\n\n2– 4 years of experience in manual testing\nStrong hands-on experience in API testing (REST/SOAP)\nSkilled in writing clear, concise test cases and test scenarios\nExposure to web and mobile application testing (iOS/Android)\nSolid understanding of SDLC, STLC, defect lifecycle, and Agile methodology\nExcellent communication and collaboration skills\nStrong analytical and problem-solving abilities\n\n\n\n\nGood to Have:\n\nExperience with Charles Proxy, Fiddler, or browser developer tools\nKnowledge of basic SQL for data validation\nPrevious experience working in Agile/Scrum teams",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Sales Engineer",
        "job_id": "4287876060",
        "company_name": null,
        "location": "India",
        "experience": "2+ years",
        "salary": null,
        "key_skills": [
            "DevOps",
            "Cloud",
            "Kubernetes",
            "Platform Engineering",
            "AWS",
            "Azure",
            "GCP",
            "CI/CD",
            "infrastructure automation",
            "containerization",
            "Sales",
            "Solutions Engineering",
            "Pre-sales"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287876060/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Us:\n\nWe are a fast-growing DevOps consulting firm specializing in cloud, Kubernetes, and platform engineering solutions. Our team works with startups, mid-sized companies, and enterprises to help them scale, modernize, and secure their infrastructure.\n\n\n\n\nRole Overview:\n\nWe are looking for a Sales Engineer with at least 2 years of experience who can bridge the gap between technical expertise and client engagement. You will work closely with our sales, marketing, and engineering teams to understand client needs, design tailored DevOps solutions, and help close deals.\n\n \n\nKey Responsibilities:\n\n \n\nCollaborate with the sales team to engage with prospective clients and understand their technical requirements.\n\n\n\n\nDeliver technical presentations and product/service demonstrations to clients.\n\n\n\n\nProvide consultative pre-sales support for DevOps, cloud, and Kubernetes engagements.\n\n\n\n\nWork with engineering teams to create proposals, architecture diagrams, and solution roadmaps.\n\n\n\n\nStay updated on the latest DevOps tools, cloud platforms (AWS, Azure, GCP), and Kubernetes best practices.\n\n\n\n\nSupport RFP/RFI responses with technical inputs.\n\n \n\n \n\nRequirements:\n\n \n\n2+ years in a technical sales, solutions engineering, or pre-sales role.\n\n\n\n\nStrong understanding of DevOps practices, CI/CD pipelines, and infrastructure automation.\n\n\n\n\nHands-on experience with at least one major cloud platform (AWS, Azure, or GCP).\n\n\n\n\nGood understanding of Kubernetes and containerized application deployments.\n\n\n\n\nExcellent communication skills with the ability to explain technical concepts to non-technical stakeholders.\n\n\n\n\nAbility to create clear technical documentation and presentations.\n\n \n\n \n\nNice to Have:\n\n \n\nExperience in client-facing consulting or solution design.\n\n\n\n\nPrior experience in a startup or consulting environment.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Generative AI Engineer Intern",
        "job_id": "4277605639",
        "company_name": "Growhut Technologies Private Limited",
        "location": "India",
        "experience": "Internship",
        "salary": "INR 15,000 - 20,000 per month",
        "key_skills": [
            "Generative AI",
            "AI",
            "Agentic AI",
            "LLMs",
            "RAG pipelines",
            "Multi-modal processing",
            "Tool-use agents",
            "LangGraph",
            "CrewAI",
            "AutoGen",
            "Autogen Studio",
            "Python"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4277605639/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Role: Generative AI Engineer Intern\n\nCompany: Growhut Technologies Private Limited\n\nJob Type: Full-Time Internship \n\nLocation: Remote\n\nStipend: INR 15,000 - 20,000 per month\n\nDuration: 6 Months\n\n\n\n\n\n\n\n🚀 About Growhut\n\n\n\n\nAt Growhut, we’re not just building AI products — we’re shaping the future of intelligent systems. We create real-world impact by developing AI solutions that blend human intuition with machine precision, across language, vision, and agentic automation. As a fast-growing AI lab, we work with global clients and build our own in-house products — including voice AI, agent orchestration tools, and futuristic collaboration systems.\n\n\n\n\nNow, we’re looking for Generative AI Engineer Interns who are obsessed with building agentic AI systems — systems that don’t just answer questions but get things done.\n\n\n\n\n\n\n\n\n\n\n🧠 The Role: Generative AI Engineer – Agentic AI (Internship)\n\n\n\n\nAs an intern at Growhut, you’ll work at the cutting edge of agentic workflows, using multi-agent frameworks to build systems that reason, plan, and execute in real time. You’ll collaborate with a team of builders to implement AI systems that combine LLMs, RAG pipelines, multi-modal processing, and tool-use agents.\n\n\n\n\n\n\n\n\n\n\n🔧 What You’ll Do\n\n\n\n\nDesign, build, and test agentic AI workflows using frameworks like Krivya, LangGraph, CrewAI, AutoGen, or Autogen Studio.\nIntegrate LLMs (GPT-4, Claude, Lamma, etc.) into real-world automation pipelines with live APIs and tool usage.\nDeploy autonomous agents that can perform tasks such as research, document generation, summarization, and coordination.\nWork with retrieval-augmented generation (RAG) techniques, memory systems, and context-aware task planning.\nExperiment with prompt chaining, long-term memory, and multi-agent collaboration protocols.\nContribute to building scalable backend infrastructure for inference, tool integration, and async workflows.\nCollaborate on internal research initiatives and proof-of-concept projects in AI-human collaboration.\n\n\n\n\n\n\n\n\n\n\n🧪 Technical Requirements\n\n\n\n\nWe’re looking for someone with hands-on experience or a firm grasp of the following:\n\n\n\n\n\n\n\nMust-Have:\n\n\n\n\nStrong understanding of Agentic AI, multi-agent workflows, and orchestration strategies.\nExperience with open-source frameworks like LangGraph, Krivya, AutoGen, CrewAI, or similar tools.\nFamiliarity with vector databases (e.g., Pinecone, Weaviate, Qdrant) and RAG systems.\nProficiency in Python, and working knowledge of LangChain, Transformers, and Prompt Engineering.\nExposure to LLMs (e.g., GPT-4, Claude, Gemini, Mistral) and their APIs.\nComfort with cloud-managed services: AWS Bedrock, Google Vertex AI, or Azure OpenAI.\nUnderstanding of tool calling, function calling, and memory management in LLM contexts.\nFamiliarity with LiveKit, real-time communication protocols, and event-driven systems.\n\n\n\n\n\n\n\nNice-to-Have:\n\n\n\n\nExperience with audio/voice models or multi-modal agents.\nThere is interest in task decomposition strategies like ReAct, Tree of Thought, and Plan-and-Execute.\nExposure to LangChain Expression Language (LCEL) and custom agent toolkits.\n\n\n\n\n\n\n\n\n\n\n🌱 Why Join Growhut?\n\n\n\n\nBuild Real Systems: Not just research — you’ll build end-to-end agentic products for real users.\nMentorship from Experts: Collaborate with a team that’s pushing boundaries in AI and automation.\nGlobal Exposure: We work with clients and users around the world across BFSI, health, SaaS, and beyond.\nCutting-Edge Infrastructure: Work on high-impact projects using the latest open-source tools and enterprise-grade services.\n\n\n\n\n\n\n\n\n\n\n🎯 The Growhut Difference\n\n\n\n\nAt Growhut, we believe in building executional AI — systems that don’t just predict or inform but actually act. We’re creating the infrastructure of tomorrow’s autonomous work. You’ll get to build with full-stack agents that talk, listen, plan, and execute across real-world workflows.\n\n\n\n\n\n\n\n\n\n\n✉️ Ready to Apply?\n\n\n\n\nIf you’re serious about building the next generation of autonomous AI agents, apply now and join us in building the future — one agent at a time.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Software Engineer",
        "job_id": "4287846201",
        "company_name": "CodeChavo",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Java",
            "Python",
            "API design",
            "Microservices architecture",
            "Unit Testing",
            "Test Automation",
            "CI/CD",
            "Jenkins",
            "GitHub Actions",
            "GitLab CI",
            "Apache Kafka",
            "ELK",
            "Prometheus",
            "Grafana",
            "OpenTelemetry",
            "CSV",
            "JSON",
            "XML"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287846201/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nCodeChavo is a global digital transformation solutions provider based. The company partners with clients from design to operation, embedding innovation and agility into organizations. CodeChavo works closely with top technology companies to make a real impact through transformation and helps companies outsource their digital projects and build quality tech teams.\n\n\n\n\n1. Core Technical Skills\n\n● Programming: Good coding proficiency in Java or Python (both preferred, at least one\n\nmandatory). Ability to write clean, maintainable, and efficient code.\n\n● Application Development: Hands-on experience in API design and development, good\n\nexposure to Microservices architecture and related design patterns.\n\n● Quality Practices: Basic understanding and implementation of Unit Testing and Test\n\nAutomation. Familiarity with CI/CD pipelines (e.g., Jenkins, GitHub Actions, GitLab CI, or\n\nsimilar) is good to have.\n\n● Messaging & Event Streaming: Basic experience with Apache Kafka or other event-driven\n\nmessaging systems.\n\n● Observability & Monitoring: Familiarity with logging, metrics, tracing tools (e.g., ELK,\n\nPrometheus, Grafana, OpenTelemetry).\n\n● File Handling & Processing: Good to have practical experience with file I/O, parsing,\n\ntransformations (CSV, JSON, XML, etc.).\n\n\n\n\n2. Problem-Solving & Analytical Skills\n\n● Strong debugging and troubleshooting abilities.\n\n● The capability to break down complex problems into smaller, manageable components.\n\n● Ability to work with real-world constraints (e.g., performance, scalability, fault tolerance).\n\n\n\n\n3. Behavioural & Team Skills\n\n● Team Collaboration: Actively contributes to team discussions, supports peers, and shares\n\nknowledge.\n\n● Ownership Mindset: Takes responsibility for deliverables and follows through to\n\ncompletion.\n\n● Adaptability: Comfortable with changing priorities, new tools, and evolving requirements.\n\n\n\n\n4. Work Attitude & Professionalism\n\n● Focused & Determined: Demonstrates persistence in solving issues without unnecessary\n\nescalations.\n\n● Self-Driven: Can work independently with minimal supervision.\n\n● Proactive: Anticipates risks and blockers, addressing them early.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Android Application Developer",
        "job_id": "4287846267",
        "company_name": "OneBanc",
        "location": "India",
        "experience": "2+ years",
        "salary": null,
        "key_skills": [
            "Android application development",
            "Java",
            "Kotlin",
            "UI elements",
            "Mobile development life cycle",
            "Scalable architecture"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287846267/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Us:\n\nOneBanc is a neo-bank, building the economic infrastructure for the workforce of India. The idea of OneBanc started when a young girl asked Vibhore, a serial entrepreneur, why the money in her piggybank never grew. Adopting this philosophy of #DemandMore, OneBanc connects enterprises, banks, and HR Tech platforms to enhance value for all stakeholders. The core team has proven their vision and executive prowess in CoCubes – a complete assessment solution for students and institutes, which was acquired by Aon. They are now building the squad to enable FinTech revolution of the future. \n\n \n\nMust Have's\n\n2+ years of experience in Android application development.\nAwareness of general mobile landscape, architectures, trends, and emerging technologies\nFamiliarity with scalable architecture, strong knowledge of UI elements and understanding of the full mobile development life cycle.\nGood Knowledge of Java and Kotlin\n\n \n\nYour Day\n\nDesign and build advanced applications for Android platform using Java and Kotlin\nUnit-test code for robustness, including edge cases, usability, and general reliability",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Backend Developer",
        "job_id": "4287848023",
        "company_name": null,
        "location": "India",
        "experience": "1-6 years",
        "salary": null,
        "key_skills": [
            "Backend development",
            "Java",
            "Golang",
            "Node.js",
            "Spring Boot",
            "MySQL",
            "Microservices architecture",
            "Relational databases",
            "Non-relational databases",
            "Unit testing",
            "Integration testing",
            "Performance testing"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287848023/",
        "posted_at": null,
        "job_description": "About the job\n\nAre you passionate about building robust and scalable backend systems? Do you thrive on solving complex problems and developing features from scratch? Join our innovative team as a Backend Developer and play a key role in shaping the future of our cutting-edge solutions.\n\n\n\n\nWhat You’ll Do\n\nAs a Backend Developer, you will:\n\n\n\n\nCollaborate with developers to design, develop, and implement highly scalable applications using Java, Golang, Node.js, Spring Boot, MySQL, and Microservices architecture.\nBe at the forefront of developing features from the ground up, bringing your ideas to life.\nIdentify performance bottlenecks and bugs, and devise solutions to address them, ensuring applications are robust and maintainable.\nTroubleshoot, debug, and fine-tune applications to ensure seamless performance and a superior user experience.\nDesign and optimize relational and non-relational databases, writing efficient queries and ensuring data integrity.\nWork closely with cross-functional teams including Product Managers, Frontend Developers, and QA to deliver top-notch solutions.\nParticipate in code reviews, adopt best practices, and stay ahead of emerging technologies to ensure high-quality deliverables.\nCreate and execute unit, integration, and performance test cases to ensure the application’s quality and reliability.\n\n\n\n\nWhat You Bring\n\nProficiency in Java, Golang, or Node.js.\n1-6 years of working experience in Backend development.\nHands-on experience with Spring Boot, MySQL, and Microservices.\nA proven track record of developing and deploying features from scratch.\nStrong problem-solving skills and the ability to debug complex systems.\nA collaborative mindset and excellent communication skills.\nA passion for learning and staying up-to-date with the latest technologies.\n\n\n\n\nWhy Join Us?\n\nChallenging Projects: Work on exciting, high-impact projects that challenge and grow your skillset.\nInnovative Environment: Be part of a forward-thinking team that values innovation and creativity.\nCareer Growth: Opportunities for skill development, mentoring, and career progression.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Web Developer & Website Designer",
        "job_id": "4287836818",
        "company_name": "Debate Marketers",
        "location": "India",
        "experience": null,
        "salary": "Based on experience and skill set",
        "key_skills": [
            "Web Developer",
            "Website Designer",
            "WordPress",
            "Shopify",
            "Webflow",
            "HTML",
            "CSS",
            "JavaScript",
            "UI/UX",
            "API integration",
            "SEO",
            "Digital Marketing"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287836818/",
        "posted_at": null,
        "job_description": "About the job\n\n\n\n\nCompany: Debate Marketers – Digital Marketing & Branding Agency\n\nSalary: Based on experience and skill set\n\nJoining: Immediate preferred\n\n\n\n\nAbout Debate Marketers\n\nDebate Marketers is a creative and strategy-driven digital marketing agency that helps brands grow through bold storytelling, smart design, and result-oriented digital solutions. From social media to web development – we do it all.\n\n\n\n\nRole Overview\n\nWe are looking for a highly creative and technically skilled Web Developer & Website Designer to join our dynamic team. You will be responsible for building visually appealing, user-friendly websites that align with our marketing campaigns and brand vision. If you’re passionate about design, clean code, and creating experiences that convert – we want you!\n\n\n\n\nKey Responsibilities\n\nDesign modern, responsive websites using platforms like WordPress, Shopify, and Webflow\nDevelop custom themes and front-end layouts in HTML, CSS, JavaScript\nImplement UI/UX best practices to improve user engagement\nIntegrate APIs, third-party tools, and marketing automation platforms\nMaintain and update existing websites\nCollaborate with content, SEO, and branding teams to align on design goals\nOptimize websites for speed, performance, and SEO\nDebug issues and perform regular website maintenance\nWork on landing pages, sales funnels, and microsites as required\n\n\n\n\nSkills & Qualifications\n\nProven experience in web design and front-end development\nProficient in HTML5, CSS3, JavaScript, jQuery\nExperience with WordPress (Elementor, custom themes), Shopify, and/or Webflow\nStrong understanding of responsive design and cross-browser compatibility\nKnowledge of basic SEO principles and page-speed optimization\nFamiliarity with tools like Figma, Adobe XD, or Photoshop\nKnowledge of version control systems (Git) is a plus\nAbility to work independently and meet deadlines in a fast-paced environment\n\n\n\n\nBonus Points\n\nExperience with animation libraries (GSAP, Lottie)\nKnowledge of backend (PHP, Node.js) is a plus\nUnderstanding of eCommerce UX and conversion principles\n\n\n\n\nWhat We Offer\n\nOpportunity to work on exciting, high-impact projects\nFreedom to experiment with creative ideas\nFlexible work environment\nGrowth and learning opportunities",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Senior Engineer, Firmware Engineering",
        "job_id": "4288375077",
        "company_name": "Sandisk",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Firmware Engineering",
            "Embedded C",
            "UFS",
            "eMMC",
            "Storage Devices",
            "4IR innovations"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288375077/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nSandisk understands how people and businesses consume data and we relentlessly innovate to deliver solutions that enable today’s needs and tomorrow’s next big ideas. With a rich history of groundbreaking innovations in Flash and advanced memory technologies, our solutions have become the beating heart of the digital world we’re living in and that we have the power to shape.\n\nSandisk meets people and businesses at the intersection of their aspirations and the moment, enabling them to keep moving and pushing possibility forward. We do this through the balance of our powerhouse manufacturing capabilities and our industry-leading portfolio of products that are recognized globally for innovation, performance and quality.\n\nSandisk has two facilities recognized by the World Economic Forum as part of the Global Lighthouse Network for advanced 4IR innovations. These facilities were also recognized as Sustainability Lighthouses for breakthroughs in efficient operations. With our global reach, we ensure the global supply chain has access to the Flash memory it needs to keep our world moving forward.\n\nJob Description\n\nWe are seeking a Senior Engineer, Firmware Engineering specializing in Embedded C, UFS/eMMC to join our team in Bengaluru, India. In this role, you will be responsible for developing and optimizing firmware for storage devices, with a focus on UFS and eMMC technologies.\n\n\nDesign, develop, and maintain firmware for embedded storage systems using Embedded C\nImplement and optimize UFS and eMMC protocols for various storage devices\nCollaborate with hardware engineers to ensure seamless integration of firmware with hardware components\nDebug complex firmware issues and develop efficient solutions\nPerform code reviews and maintain high coding standards within the team\nStay up-to-date with the latest trends and advancements in storage technologies\nMentor junior engineers and contribute to the team's technical growth\nParticipate in all phases of the firmware development lifecycle, from requirements gathering to deployment and support\n\n\nQualifications\n\n\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field\n2+ years of experience in firmware engineering, with a focus on Embedded C programming\nStrong expertise in UFS and eMMC storage technologies\nProven track record of successful firmware development projects\nIn-depth knowledge of embedded systems and low-level hardware interactions\nExcellent debugging and troubleshooting skills\nProficiency with version control systems, preferably Git\nStrong analytical and problem-solving skills\nExcellent communication and teamwork abilities\nExperience with other storage technologies is a plus\nAbility to work efficiently in a fast-paced, dynamic environment\n\n\nAdditional Information\n\nSandisk thrives on the power and potential of diversity. As a global company, we believe the most effective way to embrace the diversity of our customers and communities is to mirror it from within. We believe the fusion of various perspectives results in the best outcomes for our employees, our company, our customers, and the world around us. We are committed to an inclusive environment where every individual can thrive through a sense of belonging, respect and contribution.\n\nSandisk is committed to offering opportunities to applicants with disabilities and ensuring all candidates can successfully navigate our careers website and our hiring process. Please contact us at jobs.accommodations@sandisk.com to advise us of your accommodation request. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.",
        "source": "linkedin",
        "relevance_score": "medium"
    },
    {
        "title": ".Net Developer",
        "job_id": "4203871222",
        "company_name": null,
        "location": "India",
        "experience": "2-3 years",
        "salary": null,
        "key_skills": [
            ".NET framework",
            "Angular",
            "C#",
            ".NET",
            "Angular",
            "HTML",
            "CSS",
            "JavaScript",
            "MVC",
            ".NET 4.5+",
            "ADO.NET",
            "Entity framework",
            "Angular 7+",
            "WCF services",
            "MS SQL Server",
            "Stored procedures",
            "Functions",
            "Service Broker",
            "WPF",
            "Couchbase Lite",
            "RESTful API",
            "SOAP APIs",
            "Object-oriented programming",
            "Git",
            "Bitbucket",
            "Azure DevOps"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4203871222/",
        "posted_at": null,
        "job_description": "About the job\n\nResponsibilities\n\nDesign, develop, and maintain web applications using the .NET framework and Angular, ensuring high performance and responsiveness.\nWrite clean, well-documented, and efficient code, following best practices and coding standards.\nCollaborate with internal teams to produce software design and architecture.\nRevise, update, refactor and debug code.\nIdentify and address performance bottlenecks and optimization opportunities in both front-end and back-end components.\nImplement security best practices and standards to protect the application from potential vulnerabilities.\nServe as an expert on applications and provide technical support.\n\nRequirements\n\nBachelor's degree in Computer Science or relevant field.\n2-3 years of proven working experience as a .Net developer or Application developer.\n Experience developing web-based applications in C#, .Net, Angular, HTML/CSS/JavaScript.\nFamiliarity with design/architectural patterns (e.g. Model-View-Controller (MVC)).\nProficient with .NET 4.5+, ADO.NET, Entity framework, Angular 7+, WCF services, etc.\nExperience working with MS SQL Server, Stored procedures, Functions, Service Broker, etc.\nWPF and Couchbase Lite would be a plus.\nExperience with RESTful API design, and integration and good understanding of SOAP APIs.\nStrong understanding of object-oriented programming.\nProficient in understanding code versioning tools such as Git, Bitbucket Azure DevOps, etc.\nFamiliarity with agile development methodologies and excel in problem-solving and debugging skills.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Data Engineer",
        "job_id": "4285065708",
        "company_name": "Startup Gala Intelligence",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Web Scraping",
            "Crawling",
            "Data Parsing",
            "Data Cleaning",
            "ETL",
            "NoSQL"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285065708/",
        "posted_at": null,
        "job_description": "About the job\n\nWe're looking for an entrepreneurial, passionate, and driven Data Engineer to join Startup Gala Intelligence backed by Navneet Tech Venture. As we're building our technology platform from scratch, you'll have the unique opportunity to shape our technology vision, architecture, and engineering culture right from the ground up. You’ll directly contribute to foundational development and establish best practices, while eventually building and contributing to our engineering team.\n\n\n\n\nThis role is ideal for someone eager to own the entire tech stack, who thrives on early-stage challenges, and loves building innovative, scalable solutions from day zero.\n\n\n\n\nWhat You’ll Do\nWeb Scraping & Crawling: Build and maintain automated scrapers to extract structured and unstructured data from websites, APIs, and public datasets.\n\n\n\n\nScalable Scraping Systems: Develop multi-threaded, distributed crawlers capable of handling high-volume data collection without interruptions.\n\n\n\n\nData Parsing & Cleaning: Normalize scraped data, remove noise, and ensure consistency before passing to data pipelines.\n\n\n\n\nAnti-bot & Evasion Tactics: Implement proxy rotation, captcha solving, and request throttling techniques to handle scraping restrictions.\n\n\n\n\nIntegration with Pipelines: Deliver clean, structured datasets into NoSQL stores and ETL pipelines for further enrichment and graph-based storage.\n\n\n\n\nData Quality & Validation: Ensure data accuracy, deduplicate records, and maintain a trust scoring system for data confidence.\n\n\n\n\nDocumentation & Maintenance: Keep scrapers updated when websites change, and document scraping logic for reproducibility.\n\n\n\n\nWho You Are\n\nTechnical Skills:\n\n2+ years of experience in web scraping, crawling, or data collection.\nStrong proficiency in Python (libraries like BeautifulSoup, Scrapy, Selenium, Playwright, Requests).\nFamiliarity with NoSQL databases (MongoDB, DynamoDB) and data serialization formats (JSON, CSV, Parquet).\nExperience in handling large-scale scraping with proxy management and rate-limiting.\nBasic knowledge of ETL processes and integration with data pipelines.\nExposure to graph databases (Neo4j) is a plus.\n\n\n\n\nSoft Skills:\n\nDetail-oriented, ensuring accuracy and reliability of collected data.\nStrong problem-solving skills, particularly in adapting scrapers to evolving web structures.\nCurious mindset with a drive to discover new data sources.\nComfortable working in a fast-paced, early-stage startup environment.\n\n\n\n\nWho We Are & Our Culture\n\n\n\n\nGala Intelligence, backed by Navneet Tech Ventures, is a tech-driven startup dedicated to solving one of the most pressing business challenges - fraud detection and prevention. We're building cutting-edge, real-time products designed to empower consumers and businesses to stay ahead of fraudsters, leveraging innovative technology and deep domain expertise.\n\n\n\n\nOur culture and values:\n\nWe’re united by a single, critical mission - stopping fraud before it impacts businesses. Curiosity, innovation, and proactive action define our approach. We value transparency, collaboration, and individual ownership, creating an environment where talented people can do their best work.\n\n\n\n\nProblem-Driven Innovation: We're deeply committed to solving real challenges that genuinely matter for our customers.\nRapid Action & Ownership: We encourage autonomy and accountability—own your projects, move quickly, and shape the future of Gala Intelligence.\nCollaborative Excellence: Cross-team collaboration ensures alignment, sparks innovation, and drives us forward together.\nContinuous Learning: Fraud evolves rapidly, and so do we. Continuous improvement, experimentation, and learning are core to our success.\n\n\n\n\nIf you're excited by the opportunity to leverage technology in the fight against fraud, and you're ready to build something impactful from day one, we want to hear from you!",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Junior Engineer Electrical & Instrumentation",
        "job_id": "4285542752",
        "company_name": "HPSL LTD",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Electrical Design",
            "Electricity",
            "Electrical Engineering",
            "Power Distribution",
            "Power Systems",
            "Instrumentation"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285542752/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n \nWe suggest you enter details here.\n\n Role Description\n \nThis is a full-time remote role for a Junior Engineer Electrical & Instrumentation at HPSL LTD. The Junior Engineer will be responsible for designing electrical systems, managing power distribution, supporting electrical engineering projects, and ensuring proper instrumentation. Day-to-day tasks include drafting electrical designs, troubleshooting electrical issues, monitoring power systems, and collaborating with other engineering teams.\n\n Qualifications\n \n\nExpertise in Electrical Design, Electricity, and Electrical Engineering\nExperience with Power Distribution and Power Systems\nExcellent analytical and problem-solving skills\nStrong communication and teamwork abilities\nBachelor's degree in Electrical Engineering or related field\nPrior experience in a similar role is a plus",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "Cloud Computing Specialist",
        "job_id": "4288057861",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Cloud Computing",
            "AWS",
            "Azure",
            "GCP",
            "Networking",
            "Virtualization",
            "Cloud Security",
            "DevOps",
            "Docker",
            "Kubernetes",
            "Terraform"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288057861/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Summary:\n\nA Cloud Computing Specialist designs, manages, and supports cloud-based infrastructure and applications.\nThey help organizations migrate to the cloud, ensure scalability, security, and reliability, and optimize cloud resources for cost and performance.\n\n\n\n\nResponsibilities:\n\nDesign and deploy cloud solutions using platforms like AWS, Azure, or Google Cloud.\nManage cloud infrastructure, including storage, networking, and virtualization.\nMigrate applications and data from on-premises systems to the cloud.\nMonitor cloud performance, troubleshoot issues, and optimize resource usage.\nImplement security policies, backup strategies, and disaster recovery plans.\nCollaborate with development, DevOps, and IT teams to integrate cloud services.\nStay updated on cloud computing trends and emerging technologies.\n\n\n\n\nRequired Skills & Qualifications:\n\nBachelor’s degree in Computer Science, IT, or related field.\nExperience with major cloud platforms (AWS, Azure, GCP).\nStrong knowledge of networking, virtualization, and cloud security.\nFamiliarity with DevOps tools (Docker, Kubernetes, Terraform).\nProblem-solving skills and ability to work in fast-paced environments.\nCloud certifications (AWS Certified Solutions Architect, Azure Administrator, etc.) preferred.\n\n\n\n\nWork Environment:\n\nCloud Computing professionals are employed in IT services, consulting, finance, healthcare, and technology sectors. \nRoles may be on-site, hybrid, or fully remote depending on the organization.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Electrical / Electronic Engineer",
        "job_id": "4288386358",
        "company_name": null,
        "location": "India",
        "experience": "Fresher or 1 year max.",
        "salary": "1.68 To 2.00 LPA Max.",
        "key_skills": [
            "Electrical Engineering",
            "Electronic Engineering",
            "Motor Drives",
            "Power Conversion",
            "Circuit Design",
            "Schematics"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288386358/",
        "posted_at": null,
        "job_description": "About the job\n\nPosition – Entry Level\n\nLocation - Chakan( Apply only if you are ready for Chakan Location)\n\nExperience - Fresher or 1 year max.\n\nCTC - 1.68 To 2.00 LPA Max.\n\n\n\n\nResponsibilities\n\n1. Creative, design-thinking Electrical / Electronic Engineer with extensive knowledge / experience in\n\ndesigning cost-effective motor drives, power conversion products and other appliances.\n\n2. Thrives in a dynamic and fast-paced startup environment.\n\n3. Evaluated systems operations and recommended cost-effective design modifications\n\n4. Tested the phosphorescent and thermoelectric properties of various materials\n\n5. Maintained an updated inventory of available electronic parts and supplies\n\n6. Assisted with the design and production of integrated circuit systems\n\n7. Reviewed and interpreted schematics and maintenance manuals.\n\n8. Coordinate with production and QA teams to record and update test results and material movement.\n\n9. Assist in documentation and validation of meter testing as per IS standards and other applicable\n\nstandards.\n\n10. Review and interpret schematics, testing procedures, and manuals to support documentation\n\naccuracy.\n\n11. Assist in internal and external audit documentation (BIS, ISO, etc.) and certification readiness.\n\n12. Work with R&D teams to compile GTPs (Guaranteed Technical Particulars), Type Test Reports, and\n\nProduct Catalogs\n\n13. Help create user manuals, training material, and standard operating procedures (SOPs) for products and processes.\n\n\n\n\nEducation\n\nBachelor of Science – Electrical / Electronic\n\nEngineering Technology\n\n\n\n\nTechnical Skills set\n\n• 1–3 years of experience in technical documentation or QA support in an electronics manufacturing setup.\n\n• Familiarity with metering standards and testing protocols (IS 13779, IS 16444 part 1, DLMS/COSEM, etc.) is a strong plus.\n\n• Proficient in MS Office, especially Excel and Word; familiarity with ERP systems is desirable.\n\n• Strong attention to detail, structured approach to documentation, and ability to manage multiple records simultaneously.\n\n• Basic understanding of electrical schematics, circuit diagrams, and component identification.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "SAS Developer",
        "job_id": "4285571275",
        "company_name": "XpertDox",
        "location": "India",
        "experience": "At least 2 years",
        "salary": "10-15 LPA",
        "key_skills": [
            "SAS",
            "Statistical Programming",
            "Data Management",
            "Healthcare"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285571275/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nXpertDox is a software company based in Scottsdale, AZ. The company specializes in using advanced data analytics to improve clinical care and healthcare efficiency. XpertCoding, its flagship product, leverages AI to automate medical coding, thus improving accuracy and efficiency while reducing costs.\n\n\n\n\nRole Description\n\nThis is a full-time, on-site role for an SAS Developer located in Noida, India. The SAS Developer will be responsible for developing and maintaining SAS programs, conducting statistical analyses, managing data, and ensuring the accuracy and efficiency of programs. The role involves collaborating with cross-functional teams to enhance data-driven decision-making processes and improve healthcare outcomes.\n\n\n\n\nQualifications\n\nProficiency in Statistical Programming and general Programming skills\nStrong Analytical Skills and knowledge of Statistics\nExperience in Data Management and data-driven decision-making\nExcellent problem-solving abilities and attention to detail\nAbility to work on-site in Noida, India\nAt least 2 years of SAS programming experience\nExperience in the healthcare industry is a plus\n\n\n\n\n\n\n\nSalary\n\n\n\n\n10-15 LPA",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "WooCommerce Backend Developer",
        "job_id": "4288428671",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "WooCommerce",
            "WordPress",
            "Backend Development",
            "PHP",
            "MySQL",
            "HTML",
            "CSS",
            "JavaScript",
            "APIs"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288428671/",
        "posted_at": null,
        "job_description": "About the job\n\nWooCommerce Backend Developer\n\nShift Timings: 1:00 PM – 10:00 PM (Full-time, Work From Office)\n\n\n\n\nAbout the Role\n\n We are looking for a skilled WordPress/WooCommerce Developer with strong backend expertise. The ideal candidate will have proven experience in building and customizing WooCommerce stores, handling complex integrations, and ensuring robust performance. This role offers the opportunity to work on challenging projects, collaborate with a passionate team, and grow your technical expertise while maintaining a healthy work-life balance.\n\n\n\n\nKey Responsibilities\n\nDevelop, customize, and maintain WordPress and WooCommerce websites with a focus on backend functionality.\nBuild and optimize custom themes, plugins, and advanced WooCommerce features.\nIntegrate third-party APIs and payment gateways.\nTroubleshoot, debug, and resolve complex backend issues.\nOptimize databases, queries, and overall site performance.\nEnsure security best practices, scalability, and SEO-friendly structures.\n\n\n\n\nRequirements\n\nProven experience with WooCommerce (mandatory).\nStrong knowledge of WordPress, PHP, MySQL, HTML, CSS, and JavaScript.\nHands-on experience in custom theme and plugin development.\nFamiliarity with REST APIs, database optimization, and performance tuning.\nStrong problem-solving skills and attention to detail.\nAbility to work independently and within a team environment.\n\n\n\n\nWhat We Offer\n\nOpportunity to work on diverse and technically challenging projects.\nA collaborative, supportive environment with great work-life balance.\nCareer growth and skill development in modern web technologies.\n\n\n\n\nAdditional Details\n\nWork Mode: Full-time, Work From Office\nLocation: Noida\nShift: 1:00 PM – 10:00 PM\nNote: Cab facility not available\n\n\n\n\nInterested candidates can share their resume at contact@lightfiresolutions.com\n\n with the subject line “Application – WordPress/WooCommerce Developer.”",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Laravel Developer",
        "job_id": "4288040640",
        "company_name": null,
        "location": "India",
        "experience": "Minimum 2+ years",
        "salary": null,
        "key_skills": [
            "Laravel",
            "PHP",
            "WordPress",
            "MySQL",
            "HTML",
            "CSS",
            "JavaScript",
            "RESTful APIs",
            "Git",
            "Docker",
            "AWS"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288040640/",
        "posted_at": null,
        "job_description": "About the job\n\nWe are looking for a passionate developer with strong expertise in Laravel, PHP, and WordPress to join our dynamic team. The ideal candidate will not only build robust web applications in Laravel but also handle custom WordPress development—website design to optimization and integrations.\n\nThis role is perfect for someone who enjoys solving real-world problems with code and can seamlessly switch between modern application development (Laravel) and content-driven platforms (WordPress).\n\n\n\n\nKey Responsibilities\n\nBuild and maintain scalable web applications using Laravel.\nCustomize WordPress themes and plugins.\nOptimize WordPress websites for speed, SEO, and security.\nWork with RESTful APIs, MySQL, HTML, CSS, and JavaScript.\nCollaborate with cross-functional teams to deliver high-quality projects.\nWrite clean, maintainable code and proper technical documentation.\n\n\n\n\nRequirements\n\nMinimum 2+ years of proven experience as a Laravel Developer.\nStrong working knowledge of PHP, Laravel, MySQL, HTML, CSS, JavaScript, RESTful APIs.\nHands-on experience with WordPress development\nExperience with version control systems (Git preferred).\nUnderstanding of software design patterns and best coding practices.\nStrong problem-solving skills and attention to detail.\n\n\n\n\nNice to Have\n\nExperience with Docker, AWS, or other cloud platforms.\nFamiliarity with front-end frameworks.\n\n\n\n\nSelection Process\n\nMock Interview: To assess your technical knowledge and problem-solving approach.\nLive Technical Round: Code live on a Laravel + WordPress problem/project.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "UI/UX Developer",
        "job_id": "4288434066",
        "company_name": "Revin",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "UI/UX Design",
            "Web Design",
            "Mobile Design",
            "User Research",
            "Usability Testing"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288434066/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout the Job !!\n\n\n\n\nYou will be our: UI/UX Developer\n\nYou will be based at: Palakkad, Kerala \n\n\n\n\nWho We Are\n\nAt Revin, we are reimagining the future of education with an AI-powered tutoring platform designed to make exam preparation accessible, personalized, and effective. Emerging from IIT Palakkad, Revin combines advanced AI with expert academic insights to empower students to transform their doubts into discovery.\n\nOur platform offers instant doubt resolution, AI-curated practice questions, personalized learning paths, digital notes, and real-time performance tracking — helping students excel in exams like JEE, NEET, GATE, CAT, and UPSC.\n\nIf you are passionate about designing intuitive and impactful learning experiences, and want to shape the future of EdTech with, we’d love to have you on our team with revin’s edtech product Tutoz!\n\nhttps://tutoz.in/\n\nhttps://revin.co.in/\n\n\n\n\nYour Role at Revin\n\n\n\n\nWe are looking for a creative and detail-driven UI/UX Designer to craft user experiences for our web and mobile applications. You will design intuitive, engaging, and accessible learning journeys that make AI-powered education simple and effective for millions of students.\n\nYou will collaborate with product managers, AI engineers, and educators to translate complex educational insights into easy-to-use, impactful interfaces.\n\n\n\n\nWhat You’ll Do at Revin\n\n\n\n\nUser Research & Experience Design\nConduct user research and usability testing and pitch out designs compatible for learning platforms.\nTranslate learning requirements into student-centric designs.\nDevelop personas, journey maps, and wireframes to reflect user needs.\nUI Design & Prototyping\nDesign responsive UI components for web, Android, and iOS apps.\nCreate interactive prototypes in Figma/Adobe XD/Sketch.\nMaintain a consistent design system across the Revin platform.\nLearning Experience & Interaction Design\nDesign interactive dashboards for progress tracking and analytics.\nCreate seamless navigation flows for AI-powered doubt solving and test-taking.\nEnsure smooth interactions that reduce cognitive load for learners.\nCollaboration & Iteration\nWork closely with frontend developers to ensure design fidelity.\nParticipate in sprint reviews, iterating designs based on feedback.\nUse student feedback & data insights to refine learning journeys.\nBranding & Visual Storytelling\nEnsure consistency with Revin’s product identity.\nContribute to marketing visuals, product presentations, and campaigns when needed.\n\n\n\n\nWho You Are \n\nUser-Centered Innovator: You blend empathy and creativity, delivering design solutions that are both beautiful and functional for learners across different backgrounds.\nSimplifier of Complexity: You excel at turning AI-driven insights and educational content into clear, intuitive, and interactive interfaces.\nCollaborative Designer: You work closely with product managers, developers, and educators to bring ideas to life.\nDetail-Oriented Creator: You maintain consistency across platforms with strong design systems and component libraries.\nGrowth-Oriented Professional: You’re eager to learn, adapt, and contribute to redefining how students prepare for exams with AI.\n\n\n\n\nHere’s what we are looking for: \n\nBachelor’s/Master’s in Computer Science, Design, or related field.\nProven UI/UX design experience (min. 1 year; strong internship/freelance portfolio considered).\nProficiency in Figma, Adobe XD, Sketch.\nStrong portfolio in web + mobile design.\nExperience in design systems and component libraries.\nFamiliarity with education platforms, dashboards, or SaaS design (preferred).\nBasic knowledge of HTML, CSS, React/Flutter (advantage).\nExcellent communication skills\n\n\n\n\n\n\n\nWhy Join Revin? \n\n\n\n\nBe part of a pioneering AI tutoring app shaping the future of education in India.\nCollaborate with experts in AI, NLP, and EdTech from IIT and beyond.\nCreate learning experiences that impact millions of students preparing for top exams.\nCareer growth in a fast-scaling education technology company.\n\n\n\n\n\n\n\nHow to Apply? \n\n\n\n\nIf you’re ready to design the future of learning, send your updated resume and portfolio to:\n\nconnect@revinkrishi.com",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "Online Educator",
        "job_id": "4282056249",
        "company_name": "Bambinos.live",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Teaching",
            "Lesson Planning",
            "Online Sessions",
            "Digital Tools",
            "Communication Skills",
            "Presentation Skills"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4282056249/",
        "posted_at": null,
        "job_description": "About the job\n\nWelcome to Bambinos.live – Educator Onboarding Guide\n\n\n\n\nAbout Us\n\nBambinos.live is India’s leading English learning platform, co-founded by IIM Calcutta alumni Ashish Gupta (ex-Amazon, Cult Fit, Accenture) and Gaurav Brar (former CEO, EuroKids; ex-Disney, J&J).\n\nBacked by a ⭐ 4.8/5 Google rating and trusted by 50K+ students globally, we offer world-class programs in:\n\nEnglish Communication\nPhonics\nMath\nBhagavad Gita (India’s first for children)\n\nAll taught by the top 1% of educators.\n\n\n\n\n💼 Current Open Roles\n\nWe’re hiring for two remote online teaching roles:\n\n1. Assessment Specialist\n\nConduct demo sessions\nEvaluate and recommend the right program for students\n\n2. Curriculum Specialist\n\nConduct regular classes\nTeach using Bambinos' in-house curriculum\n\n\n\n\nYou may choose to teach one or more of the following subjects:\n\nEnglish Communication, Phonics, Math, Bhagavad Gita\n\n\n\n\n📌 Role Description – Online Educator\n\nThis is a part-time remote role. Key responsibilities include:\n\nConducting engaging and impactful online classes\nPreparing lesson plans and delivering customized sessions\nMonitoring student progress and adapting instruction accordingly\nCommunicating with parents/guardians regarding student development\n\n\n\n\n✅ Qualifications\n\nPrior experience in teaching and lesson planning\nProficiency in conducting interactive online sessions using digital tools\nStrong communication and presentation skills\nAbility to engage young learners and adapt to their learning pace\nBachelor's degree in education or a related field (preferred)\nExperience in EdTech or online education platforms is a plus\n\n\n\n\n🎯 Why Join Us?\n\nBe part of a fast-growing, Shark Tank-backed global EdTech company\nEmpower the next generation through impactful teaching\nClear pathways for career growth through structured training and certification\n\n\n\n\n🚀 Apply Today. Get Hired Tomorrow!\n\n\n\n\nJoin Bambinos.live as an educator - faster than ever!\n\nFrom application to onboarding, your journey starts and finishes in just 24 hours.\n\n\n\n\n🔗 Apply here: https://hiring.bambinos.live\n\n\n\n\nFrom application to onboarding, your journey starts and finishes in just 24 hours.\n\n\n\n\nKnow someone who'd be perfect for this role? Share this with them!\n\n\n\n\nWe look forward to welcoming passionate educators who are excited to shape the future of learning. ✨\n\n\n\n\n\n\n\nWarm regards,\n\nTeam Bambinos.live",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "Electrochemistry Engineer",
        "job_id": "4288417734",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Electrochemistry",
            "R&D",
            "Electrolyzer",
            "Cyclic Voltammetry",
            "Electrochemical Impedance Spectroscopy",
            "Chronoamperometry",
            "CFD Analysis"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288417734/",
        "posted_at": null,
        "job_description": "About the job\n\nElectrochemistry Engineer\n\n\n\n\nDescription: We are seeking a highly motivated and innovative Electrochemistry Engineer to join our cutting-edge R&D team. In this role, you will focus on scaling up our proprietary cell technology and assembling short stacks. Your contributions will be critical in developing high-performance, cost-effective components for our advanced water electrolysis systems\n\n\n\n\nResponsibilities:\n\nTechnical \n\nAssemble single-cell electrolyser units and conduct performance and durability testing under controlled and real-world operating conditions. \nPerform advanced electrochemical techniques including cyclic voltammetry (CV), electrochemical impedance spectroscopy (EIS), and chronoamperometry to evaluate catalyst behaviour and cell performance. \nScale up from proof-of-concept (POC) to large-area cells and multi-cell stack configurations. Conduct polarization curve testing and design comprehensive testing protocols to validate the performance, efficiency, and long-term stability of electrolyser cells and stacks. \nActively support 3D CFD analysis for the scale-up of electrolyser cells, aiming to optimize flow field design, thermal management, and reactant distribution for improved scalability and manufacturability. \nConduct performance testing from small-scale single electrochemical cells to large-scale cells. Perform polarization curve testing and design comprehensive testing protocols to validate the performance, efficiency, and long-term stability of electrolyser cell and stack \nAnalyse experimental data to identify key factors influencing electrocatalyst and cell performance. Use these insights to guide further development and optimisation.\n\nDocumentation and Reporting: \n\nMaintain detailed records of experiments and results, and prepare technical reports, presentations, and publications to communicate findings to both internal teams and external stakeholders. \nStay up to date with the latest advancements in electrocatalysis and electrochemistry, and contribute to the continuous improvement of research methodologies and technologies. \n\n\n\n\nRequired Qualification:\n\nEducation \n\nMSc. in Chemistry, or a closely related field, with a strong interest in electrical fundamentals \n\nSkills \n\nData Analysis & Interpretation: Ability to analyze complex datasets, identify trends, and draw meaningful conclusions to inform scientific research and development processes. \nCritical Thinking: Employ logical reasoning to evaluate hypotheses, design experiments, and troubleshoot issues that arise during research projects. \nInnovative Problem Solving: Develop creative solutions to scientific challenges, leveraging a deep understanding of the underlying principles of your field. \nAttention to Detail: Ability to meticulously examine experimental data, identify inconsistencies, and ensure the accuracy and reliability of results. \nCollaboration & Communication: Work closely with cross-functional teams to diagnose problems, share insights, and develop comprehensive solutions. Communicate complex analytical findings clearly to both technical and non-technical stakeholders. \nScientific Report Writing: Prepare clear, structured, and well-supported technical reports and documentation to communicate research findings, methodologies, and recommendations effectively. \n\nPersonal Attributes: \n\nA proactive and innovative mindset with a strong drive for research excellence. \nAbility to work effectively in a collaborative, interdisciplinary research environment. \nPassion for sustainability and the development of clean energy technologies.\n\n\n\n\nPreferred Qualification:\n\nProven experience (academic/industrial) in the synthesis, characterization, and testing of electrocatalysts, ideally with a focus on applications in water splitting \nStrong background in electrochemical techniques and surface science, with hands-on experience in operating and maintaining relevant laboratory equipment. \nRelevant industry experience in electrochemistry, preferably in water electrolysis or fuel cell technologies",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Web Engineer (SDE-1)",
        "job_id": "4282820806",
        "company_name": "Pocket FM",
        "location": "India",
        "experience": "1- 3 years",
        "salary": null,
        "key_skills": [
            "Frontend Development",
            "JavaScript",
            "TypeScript",
            "React.js",
            "Redux",
            "Zustand",
            "Recoil",
            "Web Performance",
            "SEO",
            "Accessibility"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4282820806/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Pocket FM\n\n\n\n\nPocket FM is India’s leading audio entertainment platform, powering a new generation of storytelling through audiobooks, audio series, and podcasts across multiple languages. With millions of monthly active users and a vast creator community, we are redefining how content is consumed in the audio-first world.\n\n\n\n\nRole Overview\n\n\n\n\nWe are looking for a talented and product-focused Web Engineer (SDE-1) to join our growing web team. You will play a key role in building and optimizing high-performance, scalable, and intuitive web applications that reach millions of users daily.\n\n\n\n\nKey Responsibilities\n\n\n\n\nDesign, develop, and maintain highly responsive and interactive web applications.\n\nCollaborate closely with product managers, designers, and backend engineers to deliver seamless user experiences.\n\nOwn end-to-end delivery – from technical design to deployment and monitoring.\n\nOptimize for speed, scalability, SEO, and accessibility.\n\nWrite clean, maintainable, and well-tested code using modern web frameworks and tools.\n\nProactively identify performance bottlenecks and bugs and resolve them.\n\nMentor junior engineers and participate in code reviews and technical discussions.\n\nRequirements\n\n\n\n\n1- 3 years of experience in frontend development with strong expertise in JavaScript, TypeScript, React.js, and modern web ecosystems.\n\nExperience with state management tools like Redux, Zustand, or Recoil.\n\nSolid understanding of web performance, browser rendering, and SEO best practices.\n\nStrong problem-solving skills with a good grasp of data structures and algorithms.\n\nFamiliarity with RESTful APIs, GraphQL, and frontend build tools like Webpack, Vite, etc.\n\nExperience in writing unit and integration tests (e.g., Jest, React Testing Library).\n\nA good sense of UX/UI and a keen eye for detail.\n\n\n\n\nNice to Have\n\n\n\n\nExperience with server-side rendering (Next.js).\n\nExposure to internationalization, A/B testing, and analytics integration.\n\nExperience working in fast-paced startup environments.\n\nFamiliarity with CI/CD pipelines and cloud platforms (AWS/GCP).",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Web Scraping Specialist (Python)",
        "job_id": "4284779965",
        "company_name": "Actowiz Solutions",
        "location": "India",
        "experience": "2+ years",
        "salary": null,
        "key_skills": [
            "Python",
            "Web Scraping",
            "Scrapy",
            "BeautifulSoup",
            "Selenium",
            "Playwright",
            "Requests",
            "APIs",
            "Data Extraction"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4284779965/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Title: Web Scraping Specialist (Python) \n\nCompany: Actowiz Solutions\n\nLocation: Ahmedabad\n\nJob Type: Full-time\n\nWorking Days: 5 Days a Week.\n\n\n\n\nAbout Us\n\nActowiz Solutions is a leading provider of data extraction, web scraping, and automation solutions. We empower businesses with actionable insights by delivering clean, structured, and scalable data through cutting-edge technology. Join our fast-growing team and lead projects that shape the future of data intelligence.\n\n\n\n\nRole Overview\n\n\n\n\nWe are looking for a highly skilled Python Developer with expertise in web scraping,\n\nautomation tools, and related frameworks.\n\n\n\n\nKey Responsibilities\n\n\n\n\n• Design, develop, and maintain scalable web scraping scripts and frameworks.\n\n\n\n\n• Work with tools and libraries such as Scrapy, BeautifulSoup, Selenium,\n\nPlaywright, Requests, etc.\n\n\n\n\n• Implement robust error handling, data parsing, and storage mechanisms (JSON,\n\nCSV, databases, etc.).\n\n\n\n\n• Optimize scraping performance and ensure compliance with legal and ethical\n\nscraping practices.\n\n\n\n\n• Collaborate with product managers, QA, and DevOps teams to ensure timely\n\ndelivery.\n\n\n\n\n• Research new tools and techniques to improve scraping efficiency and\n\nscalability.\n\n\n\n\nRequirements\n\n\n\n\n• 2+ years of experience in Python development with strong expertise in web\n\nscraping.\n\n\n\n\n• Proficiency in scraping frameworks like Scrapy, Playwright, or Selenium.\n\n\n\n\n• Experience with REST APIs, asynchronous programming, and multithreading.\n\n\n\n\n• Familiarity with databases (SQL/NoSQL) and cloud-based data pipelines.\n\n\n\n\n• Ability to manage deadlines and deliverables in an Agile environment.\n\n\n\n\nPreferred Qualifications\n\n\n\n\n• Prior experience leading a team or managing technical projects.\n\n\n\n\n• Knowledge of DevOps tools (Docker, CI/CD) is a plus.\n\n\n\n\nBenefits\n\n\n\n\n• Competitive salary.\n\n\n\n\n• 5-day work week (Monday–Friday)\n\n\n\n\n• Flexible work environment\n\n\n\n\n• Opportunities for growth and skill development",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "IT Support Engineer",
        "job_id": "4288026195",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "IT Support",
            "System Administration",
            "Network Configuration",
            "Virtualization",
            "Cybersecurity",
            "Windows Server",
            "Active Directory",
            "DNS",
            "DHCP",
            "VMware",
            "Hyper-V",
            "Firewalls",
            "VPN"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288026195/",
        "posted_at": null,
        "job_description": "About the job\n\nRole Description\n\nWe are seeking a skilled IT Support Engineer to join our team in Noida. This is a full-time, on-site role where you will be responsible for maintaining and managing IT infrastructure, ensuring secure and reliable systems, and providing end-user support across diverse technical environments.\n\n\n\n\nThe ideal candidate will bring hands-on expertise in system administration, network configuration, virtualization, and cybersecurity, combined with strong troubleshooting skills and the ability to support both office and remote environments.\n\n\n\n\nRoles & Responsibilities\n\nProvide technical support to staff, resolving hardware, software, and networking issues efficiently.\nInstall and configure IT hardware (servers, workstations, networking devices, storage, printers, etc.) both in-office and during vessel onboarding.\nAdminister Windows Server (2016–2022), Active Directory, DNS, DHCP, File Servers, and Terminal Services.\nManage virtualization platforms such as VMware and Hyper-V, including VM migration and backup management.\nOversee network and security systems, including switches, VLANs, firewalls, VPNs, and satellite/remote connectivity solutions.\nDeploy and manage endpoint security solutions (antivirus, web filtering, email security).\nSupport IT infrastructure during system installations, upgrades, and hardening.\nImplement and monitor backup, restoration, and disaster recovery plans.\nMaintain asset and service management logs, procurement support, and user onboarding processes.\nTravel overseas to perform IT setup, troubleshooting, and handover for vessels.\nCollaborate with cross-functional teams to ensure IT systems align with business needs.\nDocument IT processes, procedures, and knowledge base for internal reference.",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "CAD Engineer",
        "job_id": "4288023544",
        "company_name": null,
        "location": "India",
        "experience": "1 – 2 years",
        "salary": null,
        "key_skills": [
            "CAD",
            "Digital Simulation",
            "Verification",
            "HDL",
            "Verilog",
            "VHDL",
            "Questa",
            "Xcelium",
            "VCS",
            "Verdi",
            "Visualizer",
            "Linux",
            "Windows"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288023544/",
        "posted_at": null,
        "job_description": "About the job\n\nCAD Engineer\n\nWe are looking for a CAD Engineer to provide support and assistance to digital simulation and verification engineers. A successful candidate in this role will maintain the standards of functional requirement(s) and carry out the following responsibilities/tasks:\n\nInterface with the engineers to define and document issues\nConsult with the senior teammates to provide guidance as necessary\nAssist in documentation of tools and flows with respect to HDL simulation and verification\nPerform tool benchmarking and testing compliance.\n\n \n\nQualified applicants will possess the following experience:\n\nStrong knowledge on digital circuits\nFamiliar with any HDL (Verilog / VHDL)\nExposure to Questa, Xcelium, and/or VCS is a plus\nFamiliarity with Verdi, Visualizer is desirable \nWorking knowledge of both Linux and Windows environments.\nAbility to work effectively within a worldwide organization\nSelf-motivated individual with excellent technical problem solving and debugging skills\nStrong written and verbal communication skills\n\n \n\nExperience: 1 – 2 years\n\n\n\n\nEducational Qualification: B.E / B.Tech / M.E / M.Tech in Electronics or related subjects.\n\n Job location: Bangalore\n\n Looking forward to your prompt response.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "BIM Engineer MEP",
        "job_id": "4285531467",
        "company_name": "Elixir Design Studio",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "BIM",
            "MEP",
            "Revit MEP",
            "Navisworks",
            "AutoCAD MEP",
            "BIM 360",
            "ACC",
            "Clash Detection",
            "HVAC",
            "Piping",
            "Plumbing Design",
            "Fire Protection"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285531467/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nElixir Design Studio is a fast-growing BIM solutions company based in India, offering end-to-end BIM services across architecture, structure, MEP, scan-to-BIM, and coordination services. With a focus on delivering high-quality BIM support to clients in the USA, we are expanding our business development team to accelerate growth and establish long-term client relationships.\n\n\n\n\nRole Description\n\nThis is a full-time role for a BIM Engineer MEP located in Jaipur, to work on the USA, Europe and Middle East based projects. The BIM Engineer MEP will be responsible for developing and managing BIM models, creating and coordinating construction drawings, and integrating Mechanical, Electrical, and Plumbing (MEP) systems. Day-to-day tasks include collaborating with architects, engineers, and other stakeholders to ensure accurate and efficient project delivery. The role requires rigorous attention to detail and an aptitude for innovative problem-solving.\n\n\n\n\nQualifications\n\nBachelor's degree or Diploma in Mechanical Engineering, or a related field\nProficiency in BIM Softwares (Revit MEP, Navisworks, AutoCAD MEP, BIM 360/ACC)\nAbility to interpret MEP Drawings & specs\nCreating LOD 300-500 models\nKnowledge of clash detection & resolution with Navisworks\nRelevant experience in BIM for Mechanical systems (HVAC, Piping &Plumbing Design, Fire Protection System integration)\nStrong collaboration and communication skills\nAttention to detail and problem-solving abilities\nAbility to work both independently and as part of a team\nPrior experience of 2+ years\n\n\n\n\nCandidates with prior USA-based project experience shall be given preference.\n\n\n\n\nTo Apply\n\nSend your CV to hr@thebimelixir.com",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "DevOps Engineer",
        "job_id": "4288004618",
        "company_name": "Azalio",
        "location": "India",
        "experience": "Fresh Graduates",
        "salary": null,
        "key_skills": [
            "DevOps",
            "Cloud",
            "Automation",
            "AI",
            "Linux",
            "Git",
            "Docker",
            "Kubernetes",
            "Networking"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288004618/",
        "posted_at": null,
        "job_description": "About the job\n\nDevOps Engineer – Fresh Graduates\n\n\n\n\n🚀 Launch Your Career in DevOps with Azalio!\n\n We’re hiring fresh graduates as DevOps Engineers at our Mohali, Gurugram and Chennai office. If you’re curious about Cloud, Automation, and AI-driven platforms, this is your opportunity to learn, build, and grow with real-world DevOps projects. 💼✨\n\n🔍 Role: DevOps Engineer (Fresher)\n\nSkills Required:\n\nKnowledge of Linux & Git fundamentals\nBasics of Docker & Kubernetes\nUnderstanding of Networking concepts\nEnthusiasm to learn DevOps automation tools\n\n👩‍💻 Eligibility:\n\n ✅ Fresh graduates (B.Tech / MCA or equivalent)\n\n ✅ Passion for Cloud, Automation, and AI platforms\n\n ✅ Good problem-solving & communication skills\n\n ✅ Willing to work from Mohali, Gurugram and Chennai office\n\n📩 Apply Now: Send your resume to 👉 hr.1@azalio.io\n\n💡 At Azalio, you’ll gain hands-on exposure to modern DevOps practices, collaborate with experts, and be part of building automation-driven intelligent platforms.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Oracle Cloud HCM Fast Formula Developer",
        "job_id": "4288372716",
        "company_name": "MyRemoteTeam, Inc",
        "location": "India",
        "experience": "3 Years to 5 Years",
        "salary": null,
        "key_skills": [
            "Oracle Cloud HCM",
            "Fast Formula",
            "Payroll",
            "Absence Management",
            "Benefits",
            "OTL",
            "Compensation"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288372716/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Us\n\nMyRemoteTeam, Inc is a fast-growing distributed workforce enabler, helping companies scale with top global talent. We empower businesses by providing world-class software engineers, operations support, and infrastructure to help them grow faster and better.\n\n\n\n\nJob Title:  Oracle Cloud HCM Fast Formula Developer\n\nExperience: 3 Years to 5 Years\n\nWork Location: Bangalore\n\n\n\n\n\n\n\nJob Summary:\n\nWe are looking for an experienced Oracle Cloud HCM Fast Formula Developer who can design, develop, and maintain Fast Formulas across various HCM modules like Payroll, Absence, Benefits, OTL, and Compensation.\n\n\n\n\n\n\n\n\n\n\n\n\n\nKey Responsibilities:\n\nDevelop and manage Fast Formulas in Oracle HCM Cloud\nWrite complex logic and calculations for:\nPayroll rules\nLeave/absence plans\nBenefits eligibility\nCompensation policies\nTroubleshoot and fix formula-related issues\nUse tools like Formula Results, Messages, and Logging for testing and debugging\nWork with database items (DBIs), context variables, and input values in formulas\nCollaborate with technical and functional teams during implementations\n\nRequirements:\n\nStrong hands-on experience with Oracle Cloud HCM Fast Formulas\nGood understanding of HCM modules: Payroll, OTL, Absence, Benefits, etc.\nExperience in Oracle HCM Cloud implementation or support projects\nAbility to work with cross-functional teams",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Techno Commercial Engineer",
        "job_id": "4285522871",
        "company_name": "ASRock Industrial Computer",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Techno Commercial",
            "Sales Engineering",
            "Sales",
            "Marketing",
            "Training",
            "Negotiation",
            "Customer Relations"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285522871/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n \nASRock Industrial Computer, established in July 2018, is a global leader in Industrial PC motherboards and focuses on motherboards, edge computers, cameras, and other products for manufacturing, business, and retail industries. Originally a business unit of ASRock Inc., ASRock Industrial now dedicates all its resources to B2B activities, serving industries such as Commerce, Automation, Robotics, Entertainment, and Security. With a core R&D team comprising almost 65% of its total staff, ASRock Industrial develops reliable, leading-edge products that can be bought off-the-shelf or customized. The company aims to be a world leader in AIoT products by collaborating with systems integrators and independent software vendors.\n\n Role Description\n \nThis is a full-time remote role for a Techno Commercial Engineer with Sales and Marketing abilities. The Techno Commercial Engineer will be responsible for providing technical sales support, managing customer accounts, developing and delivering training sessions, negotiating contracts, and communicating with clients to understand their needs and propose suitable solutions. The role involves frequent interactions with both internal teams and external customers to drive sales and ensure high customer satisfaction.\n\n Qualifications\n \n\nSales Engineering and Sales skills\nStrong Communication and Negotiation skills\nExperience in Training and facilitating learning sessions\nAbility to work independently and remotely\nTechnical background in computer hardware or related fields\nBachelor's degree in Engineering, Computer Science, Marketing, or a related field\nExperience in the AIoT or Industrial PC industry is a plus",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "Full-Stack Developer with AI Edge",
        "job_id": "4288005157",
        "company_name": "Zynn",
        "location": "India",
        "experience": "2+ years",
        "salary": null,
        "key_skills": [
            "Full-Stack Development",
            "AI",
            "Node.js",
            "Python",
            "React",
            "Whisper",
            "CLIP",
            "BLIP",
            "OCR",
            "AWS",
            "GCP",
            "Azure",
            "CI/CD",
            "DevOps",
            "Web Scraping",
            "APIs"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4282802335/",
        "posted_at": null,
        "job_description": "About the job\n\nHanna instruments is a manufacturer of Scientific instruments which are used in many industries like Laboratory, water treatment, Education, Research, Food/Beverages, Agriculture and may more.\n\nWe have more than 3000 products like PH meter, Conductivity meter, titrator, turbidity meter, process instruments etc. Our products are manufactured in our own faculty located in USA, Romania, and Mauritius. Our global HO is located in Rhode Island, USA. Indian Head Office is located in Navi Mumbai. We have great Sales/Service network all over India.\n\n\n\n\nJob description Roles and Responsibilities\n\n\n\n\n• Responsible to achieve the Team Sales Target of Region\n\n• Develop strong long-term relationships with customers.\n\n• Prospect for business, schedule appointments, & visit customers to review their product needs and determining opportunities.\n\n• Recommend products based on customer requirements.\n\n• Provide clear, effective quotations & literature to customers.\n\n• Negotiate strongly and clarify company terms and conditions.\n\n• Close orders and collect customer payment promptly thereafter.\n\n• Research the market for new opportunities.\n\n• Attend trade shows & conference.\n\n• Continuously increase product and application knowledge.\n\n• Perform demonstrations, installations, and basic maintenance.\n\n• Attend training and departmental meetings.\n\n• Coordinate with inside sales, technical, accounting and shipping department.\n\n• Coordinate with service engineers for installations / demonstrations.\n\n• Follow up with customers promptly and courteously.\n\n• Resolve customer problems & report issues to Manager.\n\n• Submit weekly report to RSM.\n\n• Ad-hoc responsibilities as assigned by the Manager or General Manager.\n\n\n\n\nLocation: Hyderabad (Andhra Pradesh)\n\n100% Target oriented Field Sales\n\n2+yrs exp in Sales",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Digital Marketing Specialist",
        "job_id": "4288014810",
        "company_name": "Ista Spaces",
        "location": "India",
        "experience": "1 – 5 Years",
        "salary": "Open Budget",
        "key_skills": [
            "Digital Marketing",
            "Meta Ads",
            "Google Ads",
            "Lead Generation",
            "ROI",
            "Campaign Management",
            "Real Estate Marketing"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288005157/",
        "posted_at": null,
        "job_description": "About the job\n\nWe’re hiring a hacker. If you're passionate about crafting something epic, this is for you.\n\n\n\n\nZynn is building something bold: a platform that lets you shop straight from Instagram reels. No tab-hopping. No broken links. Just seamlessness between social and commerce. And we’re looking for someone who can build what is needed.\n\n\n\n\nWe're hiring a full-stack builder with an AI edge.\n\n If you’ve shipped a product solo and love working across the stack, we want to talk.\n\n\n\n\nYou’re a fit if you:\n\nHave 2+ years in a core technical role (startups a plus)\n\n\n\n\nKnow Node.js, Python, and React inside out\n\n\n\n\nHave worked with pretrained models like Whisper, CLIP, BLIP, OCR\n\n\n\n\nAre fluent in AWS/GCP/Azure, CI/CD, DevOps, and security best practices\n\n\n\n\nHave scraped the web, handled real-time data, and integrated with APIs (Instagram, Amazon, Shopify)\n\n\n\n\nAvailability:\n\nImmediate joiners only. We move fast, and we want someone who can hit the ground running.\n\n\n\n\nThis is a founding team role. You’ll work closely with me (founder), shape the entire tech roadmap, and have skin in the game.\n\n\n\n\nLooking for the reason you became an engineer? This is it.",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "Software Development Engineer (SDE)",
        "job_id": "4288005565",
        "company_name": "Azalio",
        "location": "India",
        "experience": "Fresh Graduates",
        "salary": null,
        "key_skills": [
            "Software Development",
            "Java",
            "OOPs",
            "Data Structures",
            "Algorithms",
            "Spring Boot",
            "Microservices",
            "Automation",
            "AI"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288014810/",
        "posted_at": null,
        "job_description": "About the job\n\nDesignation: Digital Marketing Specialist\n\nLocation: HSR Layout, Sector 3 (Work from Office)\n\nExperience: 1 – 5 Years\n\nSalary: Open Budget (We value skill over numbers!)\n\n🔥 What you’ll own:\n\nRun and optimize Meta Ads (Facebook & Instagram) and Google Ads (Search, Display, YouTube) campaigns.\nDrive lead generation with smart targeting and creative campaigns.\nTrack ROI, optimize budgets, and make every rupee count.\nCollaborate with sales & marketing teams to align ads with business goals.\nStay ahead with the latest digital marketing trends.\n\n\n\n\n⚡ What we’re looking for:\n\nProven hands-on experience with Meta Ads & Google Ads (must-have).\nStrong analytical mindset – you love numbers and insights.\nCreative flair – you can design campaigns that don’t just look good, but also convert.\nBonus: Real estate marketing experience.\n\n\n\n\n🌟 Why Ista Spaces?\n\n At Ista Spaces, we don’t just build luxury projects—we create experiences. Joining us means working on high-impact campaigns for luxury villas, high-rise apartments, and premium developments across Bangalore. Grow with us as we expand citywide!\n\n\n\n\n Apply directly here on LinkedIn OR share your CV with us:\n\n Email: deori.lakshmi@istaspaces.com\n\n Contact: 6009227602",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "EEG R&D Associate",
        "job_id": "4287899038",
        "company_name": "Brainwave Science",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "EEG",
            "R&D",
            "Cognitive Technologies",
            "Artificial Intelligence",
            "Machine Learning",
            "Data Collection"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288005565/",
        "posted_at": null,
        "job_description": "About the job\n\nSoftware Development Engineer (SDE) – Fresh Graduates\n\n🚀 Start Your Tech Journey with Azalio!\n\n We’re looking for fresh university graduates to join our team as Software Development Engineers (SDEs) at our Mohali, Gurugram and Chennai office. If you’re excited about coding, automation, and AI-driven platforms, this is your chance to work on real-world projects with mentorship from experts. 💼✨\n\n🔍 Role: Software Development Engineer (SDE)\n\nSkills Required:\n\nStrong foundation in Core Java / OOPs concepts\nKnowledge of Data Structures & Algorithms\nBasics of Spring Boot & Microservices (preferred)\nProblem-solving mindset and eagerness to learn\n\n👩‍💻 Eligibility:\n\n ✅ Fresh graduates (B.Tech / MCA or equivalent)\n\n ✅ Strong communication & collaboration skills\n\n ✅ Passionate about Automation & AI platforms\n\n ✅ Willing to work from Mohali, Gurugram and Chennai office\n\n📩 Apply Now: Send your resume to 👉 hr.1@azalio.io\n\n💡 At Azalio, you’ll collaborate with passionate engineers, contribute to next-gen automation solutions, and kickstart your career in software engineering.",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "Design Engineer",
        "job_id": "4287838702",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Design Engineering",
            "Product Design",
            "Mechanical Engineering",
            "Electrical Engineering",
            "CAD",
            "Mechanical Design",
            "Electrical Design"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287899038/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Brainwave Science: \n\n\n\n\nBrainwave Science is a leader in cognitive technologies, specializing in solutions for the security and intelligence sectors. Our flagship product, iCognative™, leverages real-time cognitive response analysis using Artificial Intelligence and Machine Learning techniques to redefine the future of investigations, defense, counterterrorism, and counterintelligence operations. Beyond security, Brainwave Science is at the forefront of healthcare innovation, applying our cutting-edge technology to identifying diseases, various neurological conditions, and mental health challenges in advance and identification of stress and anxiety in real time and providing non-medical, science-backed interventions. Together, we are shaping a future where advanced technology strengthens security, promotes wellness, and creates a healthier, safer world for individuals and communities worldwide. \n\n\n\n\nPosition Summary \n\n\n\n\nWe are looking for enthusiastic and detail-oriented EEG R&D Associates to conduct live tests on subjects and collect high-quality EEG data. This role plays a key part in supporting our data needs for system development, training, R&D, validation, and real-world performance testing. \n\n\n\n\nKey Responsibilities \n\nConduct EEG-based iCognative™ and CalmSinc™ tests on subjects across various environments. \nCollect EEG data systematically for R&D, product validation, algorithm training, and deployment evaluation. \nMaintain clean, organized, and well-documented test records and datasets. \nPerform data recording, signal monitoring, and artifact rejection during live sessions. \nAssist in pre-test preparations, including subject setup, consent, and briefing. \nCollaborate with the technical teams to analyze collected data and annotate for use in system improvements and research. \nEnsure ethical compliance and subject comfort during testing procedures. \n\n \n\n\n\n\nQualifications \n\n\n\n\nBachelor’s degree in Electronics & Communication (ECE), Electrical & Electronics (EEE), Computer Science (CSE), Biomedical Engineering, Neuroscience or related field. \nMinimum 1 year of experience working with EEG systems or biomedical data collection (preferred). \nFamiliarity with basic signal processing and data acquisition tools. \nStrong interpersonal skills and ability to interact professionally with test subjects. \nGood understanding of biosignals and sensitivity to ethical testing standards. \nAbility to travel as needed for field tests. \n\nNice to Have \n\nExposure to neurotechnology, brain-computer interfaces, or biometric systems. \nPrior experience with Python/MATLAB for EEG signal analysis. \nKnowledge of cognitive neuroscience or psychology principles. \n\nWhy Join Us? \n\nBe part of a fast-growing and innovative team driven by purpose and impact. \nTravel and engage in real-time testing scenarios with global stakeholders. \nA collaborative, mission-driven team and a fast-growing international environment. \nCompetitive compensation and opportunity for career growth. \nFlexible work arrangements and remote opportunities. \n\n\n\n\nHow to Apply \n\n\n\n\nPlease send your CV, a short note about your experience with EEG systems, and any relevant project examples to: areddy@brainwavescience.com \n\nSubject: Application – EEG Test Engineer – iCognative™",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Data Engineer",
        "job_id": "4287893663",
        "company_name": "Aviso AI",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Data Engineering",
            "ETL",
            "ELT",
            "Python",
            "Spark",
            "MongoDB",
            "SQL",
            "Data Lake",
            "Data Warehouse"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287838702/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n \nWe suggest you enter details here\n\n Role Description\n \nThis is a full-time on-site role for a Design Engineer located in Dehradun. The Design Engineer will be responsible for the development of new products and the improvement of existing products. Day-to-day tasks include creating and analyzing mechanical and electrical designs, utilizing Computer-Aided Design (CAD) software, collaborating with other engineers and departments, and ensuring all designs meet industry standards and regulations.\n\n Qualifications\n \n\nDesign Engineering, Product Design skills\nMechanical Engineering, Electrical Engineering expertise\nProficiency in Computer-Aided Design (CAD)\nExcellent problem-solving and analytical skills\nStrong communication and teamwork abilities\nAbility to manage multiple projects and meet deadlines\nBachelor’s degree in Mechanical Engineering, Electrical Engineering, or related field\nExperience in the manufacturing or product development industry is a plus",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Title not extracted",
        "job_id": "ID not extracted",
        "company_name": "Company not extracted",
        "location": "India",
        "experience": "Not specified",
        "salary": "Not specified",
        "key_skills": [],
        "job_url": "https://in.linkedin.com/jobs/view/4287893663/",
        "posted_at": "Not specified",
        "job_description": "About the job\n\n🚀 Join Our Data Engineering Team at Aviso AI 🚀\n\n\n\n\nAbout the Role\n\nWe’re on the lookout for passionate and driven Data Engineers to be part of our fast-growing data team. This is a unique opportunity to work with cutting-edge technologies and design scalable, high-impact data solutions that power analytics, reporting, and intelligent products across the organization.\n\n\n\n\nIf you enjoy solving complex problems, building resilient pipelines, and unlocking the true value of data, this role is for you.\n\n\n\n\nWhat You’ll Do\n\nDesign, build, and maintain scalable ETL/ELT pipelines using Python and Spark.\nIntegrate diverse data sources—structured and unstructured—including MongoDB and SQL databases.\nCollaborate with product, analytics, and engineering teams to deliver clean, reliable datasets.\nWrite and optimize SQL queries to transform and analyze data across multiple platforms.\nEnsure data quality, consistency, and lineage with robust testing and validation.\nOptimize Spark jobs and workflows for performance and scale.\nMonitor, troubleshoot, and enhance existing data processes and infrastructure.\nContribute to building and maintaining our enterprise data lake and warehouse environments.\n\n\n\n\nWhat We’re Looking For\n\nStrong Python skills for data processing and automation.\nHands-on experience with Apache Spark for distributed data processing.\nProven expertise with MongoDB (queries, aggregation pipelines, performance tuning).\nSolid command of SQL and relational database experience.\nFamiliarity with data modeling, schema design, and large-scale data systems.\nUnderstanding of data governance, lineage, and best practices in data engineering.\nExperience with cloud platforms (AWS, Azure, or GCP).\nExposure to data lake/warehouse tools like Snowflake.\nBonus: Experience with streaming frameworks (Kafka, Spark Streaming).",
        "source": "linkedin",
        "relevance_score": "unknown"
    },
    {
        "title": "Django Developer",
        "job_id": "4285096602",
        "company_name": "Pyrack",
        "location": "India",
        "experience": "full-time",
        "salary": null,
        "key_skills": [
            "Django",
            "Django REST Framework",
            "APIs"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285096602/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\n Pyrack is a leading AI solutions provider dedicated to helping industries harness the power of artificial intelligence. Our passionate and experienced team delivers cutting-edge solutions tailored to the unique needs of our clients. We specialize in AI consultancy, PoC development, MVP development, and complete product engineering. Headquartered in Pune, we are committed to building effective and ethical AI solutions that solve real-world problems and drive business success.\n\n\n\n\nRole Description\n\n We are looking for a skilled Django Developer to join our team full-time at our Pune office. In this role, you will be responsible for designing and developing robust back-end solutions, integrating user-facing elements with server-side logic, managing databases, and ensuring high performance and responsiveness of applications. You will collaborate closely with cross-functional teams to define, build, and deliver innovative solutions that align with business needs.\n\n\n\n\nKey Responsibilities\n\nDevelop and maintain scalable web applications using Django and Django REST Framework\nCollaborate with front-end developers and other stakeholders to integrate APIs and deliver seamless solutions\nDesign and optimize database schemas and queries for performance and reliability\nWrite clean, efficient, and reusable code while following best practices\nEnsure application security, scalability, and performance tuning\nCreate and maintain API documentation\nConduct unit testing and participate in code reviews\nFamiliar with code versioning system\n\n\n\n\nRequired Skills & Qualifications\n\nCore Programming\n\nStrong understanding of Python 3.x and OOP principles\nFamiliarity with Python data structures and algorithms (basic to intermediate)\n\n\n\n\nWeb Development (Django)\n\nHands-on experience with Django and Django REST Framework (DRF)\nUnderstanding of MVC/MVT architecture\nKnowledge of models, views, serializers, URL routing, and querysets\n\n\n\n\n\n\n\nAPIs & Backend Concepts\n\nBuilding and consuming RESTful APIs\nWorking with JSON and API documentation tools (Swagger/OpenAPI)\n\n\n\n\nDatabase & ORM\n\nExperience with relational databases (PostgreSQL, MySQL, SQLite)\nAbility to write efficient ORM queries, joins, and aggregations\n\n\n\n\nVersion Control\n\nProficient with Git and platforms like GitHub/GitLab/Bitbucket\nBasic understanding of branching, merging, and pull requests\n\n\n\n\nTesting\n\nExperience with unit testing using pytest, unittest, or Django’s testing framework\n\n\n\n\nGood to Have / Bonus Skills\n\nFamiliarity with Docker, Postman, or CI/CD pipelines\nBasic knowledge of HTML, CSS, JavaScript (for API integration understanding)\nExposure to AWS / cloud services\nBasic understanding of integrating AI/ML features into backend systems (e.g., creating APIs to serve AI models or consuming external AI services/APIs)\n\n\n\n\nQualifications\n\nBachelor’s degree in Computer Science, Information Technology, or related field (or equivalent practical experience)\nMinimum 1 year of professional experience as a Django Developer or in backend web development.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "UI Developer",
        "job_id": "4287887277",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "React.js",
            "Angular",
            "Node.js",
            "JavaScript",
            "HTML",
            "CSS",
            "Express",
            "Redux",
            "Context API",
            "Git",
            "CI/CD",
            "Agile"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287887277/",
        "posted_at": null,
        "job_description": "About the job\n\nWe’re looking for a skilled UI Developer with strong experience in React.js , Angular and Node.js to build dynamic, scalable, and user-friendly web applications. The ideal candidate should have a passion for clean UI, responsive design, and full-stack development.\n\n\n\n\nKey Responsibilities:\nDevelop interactive UIs using React.js, HTML, CSS, and JavaScript\nBuild and maintain backend services using Node.js and Express\nCollaborate with design and backend teams for seamless integration\nOptimize performance across browsers and devices\nEnsure code quality through testing and reviews\n\n\n\n\nRequired Skills:\nProficient in React.js, Node.js, and Angular.\nStrong in JavaScript (ES6+), HTML5, and CSS3\nExperience with state management (Redux/Context API)\nFamiliarity with Git, CI/CD, and Agile workflows",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Operations Software Engineer",
        "job_id": "4277225885",
        "company_name": null,
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "SDLC",
            "GCP"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4277225885/",
        "posted_at": null,
        "job_description": "About the job\n\nRole Overview\nThe Operations Software Engineer creates, enhances, and maintains business applications, configures custom code to support the company’s business needs, and marshals those configurations through a standard SDLC progression. Additionally, the Engineer is accountable for project deliverables in line with quality targets and SLAs while adhering to best practices, Good Clinical Practice (GCP), the company’s processes, and global industry regulations. The ideal candidate possesses basic product knowledge and basic knowledge of user applications\nKey Accountabilities/Decision Making & Influence\nApplication Development / Study Configuration\n\n Operations Software Engineer (UP - GTD) – Works with Global Project Management and the Solution team to understand business requirements for assigned tasks\n Develops and maintains application components (under supervision). \n Support Global Technical Delivery in meeting business objectives outlined in Goals and Objectives. \n Operations Software Engineer (GTD) Works with the Solution team to understand the business requirements for assigned tasks. \n Supports all phases of verification/testing by efficiently diagnosing and resolving defects. \n Collaborates with the Delivery Manager/Lead to keep the project on time. \n Coordinates with the Software Engineer team to understand design patterns, standards, customizations, and resource capacity planning. \n Understands and follows all coding standards. \n Creates robust, well-documented code. \n Designs, creates, and modifies database objects as required. \n Completes unit testing, creates documentation, and executes peer reviews as required. \n Adheres to source control, versioning best practices, and operational process requirements when executing study configuration tasks. \n Regularly communicate status updates of assigned tasks to internal and external stakeholders. \n Requests requirements and design clarifications when necessary. \n Willingly and openly adopts and supports iterative process improvements. \n Job performance measured individually, as it pertains to team goals aligned with corporate objectives for Global Technical Delivery, and the values of Signant Health. \n\n(Site Support Responsibilities (Rater Station Only)\n\n Adheres to source control, versioning best practices, and operational process requirements. \n Perform general Site Support in support of the study configurations in the field, as required. \n They are diagnosing and resolving defects as part of general site support. \n Prepare/confirm all required change control documentation, including updates to design and other technical documents. \n Deploys resolution to testing and production environment as required. \n Quality System Responsibilities\n Performs all work following documented Standard Operating Procedures (SOPs), Working Instructions, Adheres to Good Clinical Practices (GCP), 21 CFR Part 11, and other regulatory requirements as required. \n\nKnowledge, Skills, Attributes: Essential:\n\n 2 – 3 years of experience professionally developing software. \n Detailed knowledge of software development process and practices. \n Programming experience in any language. \n Knowledgeable about application development, configuration, and support areas. \n Ability to work independently and resourcefully toward quality and high-performance solutions. \n Problem-solving skills and good decision making to escalate when necessary. \n Ability to provide concise and accurate feedback to the client and the teams about progress and outcomes. \n Ability to work in a team environment providing backup support to team members. \n Ability to establish and maintain effective work relationships with co-workers within and across functional areas. \n Strong analytical skills with an ability to comprehend business requirements. \n\nSpecific to Products of IRT and Rater Station\n\n Microsoft SQL Server Management Studio and Server Reporting Services and T-SQL\n Microsoft Visual Studio IDE ASP.NET MVC, C# w/LINQ\n Web code and data standards for HTML, JavaScript, XML, JSON, REST\n\nDesirable:\n\n Agile Scrum methodologies. \n Atlassian Suite tools, such as Bit Bucket/Confluence/JIRA/X-ray/Jira Service Manager. \n Source Control Software, such as Team Foundation Server, Bit Bucket, or other Git-based source control. \n Microsoft SQL Server Integration Services. \n Microsoft SQL Server Reporting Services. \n Microsoft Azure, Cosmos DB, Kubernetes. \n REST APIs. \n Leading software design and development efforts on assigned projects. \n Experience estimating project time needed for quoting development and support tasks. \n Experience, capability, and willingness to share knowledge openly with others, including lessons learned. \n Willingness to work flexible hours. \n Familiarity with GCP and 21 CFR Part 11. \n Familiarity with defect tracking software. \n\nWe know that everyone has different wants and needs, which is why along with a highly competitive base salary we support our people and their loved ones with a variety of perks and benefits. As part of our team some of the benefits you can expect to receive are:\n\n Medical Insurance, Group Accidental Coverage/Insurance, Group Term Life Insurance\n Company Paid Subscription to Calm – The #1 app for mental fitness. \n Employee Referral Program – Bring the Best to Signant Health and earn a reward. \n Wellness Program – Participate in challenges and earn points for rewards. \n Proof! – Signant’s Employee Recognition Program where you can accumulate points to redeem\n\nexciting merchandise, gift cards, tickets, and more.\n\n Burn Along – Digital fitness and wellness platform\n\nDoes this sound like something you’d like to explore? Then we’d love to hear from you!\nTo apply, please submit your CV and a cover letter letting us know why you think you’d be perfect for this role. We will begin reviewing submissions during the application period and will fill the vacancy as soon as a suitable candidate is identified.\nAt Signant Health, accepting difference isn’t enough—we celebrate it, we support it, and we nurture it for the benefit of our team members, our clients and our community. Signant Health is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status.",
        "source": "linkedin",
        "relevance_score": "medium"
    },
    {
        "title": "Electronics Engineer - Hardware",
        "job_id": "4285543559",
        "company_name": null,
        "location": "Ahmedabad",
        "experience": "1-3 Years",
        "salary": null,
        "key_skills": [
            "Embedded Hardware",
            "MCU",
            "ARM-Cortex",
            "STM32",
            "ESP32",
            "Nordic",
            "SPI",
            "I2C",
            "RS-485",
            "UART",
            "USB",
            "PCB layout",
            "SMPS",
            "KiCad",
            "Oscilloscope",
            "IOT",
            "UL",
            "CE",
            "FCC"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285543559/",
        "posted_at": null,
        "job_description": "About the job\n\nJob Description: Electronics Engineer - Hardware\n\nExperience: 1-3 Years\n\nLocation: Ahmedabad\n\nEmployment Type: Full-time | Industry: Design Services\n\n \n\nJob Summary:\n\n\n\n\nThe Electronics Engineer - Hardware will be responsible for leading the design, development, and testing of electronic hardware products. They will work closely with cross-functional teams, including firmware engineers, mechanical engineers, and product managers to ensure the timely delivery of high-quality electronic products that meet customer requirements.\n\n\n\n\nSkills:\n\n\n\n\nExperience in Embedded Hardware designs consists of MCU (8/32-bit) ARM-Cortex Series STM32, ESP32, Nordic and other manufacturers.\nExperience in Serial Protocol Interfaces SPI, I2C, RS-485, UART, USB etc.\nKnowledge in High-speed design and routing.\nExperience in schematic design, BOM Management, PCB layout & signal integrity.\nMust be able to select cost and feature optimised components based on project requirements and design hardware architecture.\nExperience in Analog, digital (/mixed) circuits designs, SMPS design, communication circuits, Discrete circuits.\nExperience in design and development of Design documents and calculations.\nGood exposure on using CAD tools Preferably KiCad.\nWorking knowledge of Oscilloscope, Multimeter, logic analyzer, Function generator, Electronic load etc.\nExperience in IOT applications.\nGood troubleshooting Knowledge of Safety and compliance certification tests like UL, CE, MID, FCC, etc.\nKnowledge to work with the Power electronics, motors and drive systems and technologies\nShould be able to handle work with minimal support.\n\n \n\nKey Responsibilities:\n\n\n\n\nDesign and development of electronic hardware products, including schematic design, PCB layout, and component selection.\nSchematic component selection\nMust do the PCB Bring up & Hardware debugging\nCollaborate with cross-functional teams to ensure seamless integration of electronic hardware with firmware and mechanical components.\nDevelop and maintain design standards, procedures, and specifications for electronic hardware products.\nConduct research and analysis to identify new technologies and trends in electronics hardware design and recommend improvements to existing products.\nDevelop and manage project timelines, and resources to ensure successful delivery of projects.\nProvide technical support to internal and external stakeholders, including customers and suppliers.\nGive project updates on client calls actively. \n\n\n\n\nQualification:\n\n\n\n\nBachelor/master’s degree in ECE/EEE\nExperience in wireless communication technologies such as GSM, Wi-Fi (Dual Band), Zigbee and Bluetooth.\nGood troubleshooting Knowledge of Safety and compliance certification tests like UL, CE, MID, FCC, etc.\nKnowledge to work with the Power system domain and technologies\n\n\n\n\n\n\n\n 🌏 About Us – INVENTINDIA\n\n\n\n\n🏆 InventIndia is an award-winning global Product Innovation Company specializing in game-changing, patentable products across multiple sectors: Medical Devices, FMCG, Telecom, Consumer Electronics, and more.\n\n💡 We manage the full spectrum of product development, from concept to production, with 100+ successful products to date.\n\n🏗️ 30,000 Sq. ft. Design Studio in Ahmedabad, Gujarat, with in-house 3D printing and prototyping.\n\n🌍 Offices in India, Canada, and Hong Kong to ensure 24/7 connectivity with global clients.\n\n🌟 Our highly skilled 38+ workforce has a proven track record of delivering top-quality products with reduced lead times and optimized production cycles.\n\n \n\nSome of the Awards & Recognitions:\n\nSilver Winner at iF Award for On2Cook: The World’s Fastest Cooking Device, 2021\nDiamond Winner at British Invention Show for On2Cook: The World’s Fastest Cooking Device, 2021\nSilver Award for On2Cook: World’s Fastest Cooking Device at The 14th International Design Awards (IDA), 2020\niF Design Award For TapeClip: World's smallest Tape Dispenser, 2020\nIndia’s Best Design Studio Award - 2019, 2020 & 2021\nHonorary Mention, Design Intelligence Award (DIA) 2019\nA'design Award, 2019\nBronze Award BTL Flexi at International Design Award (IDA) in Medical Design Category, 2018\nGold Medal for BTL Cardiopoint CPET system at Medical Expo Salmed, Poland, 2018\nHonorable Mention, Advino Curalaser International Design Award (IDA), USA in Medical Design Category, 2018\nGold Medal, INPEX Invention show USA, Office Supplies and Stationery, 2017\nSilver Award Winner at India International Innovation Fair (IIIF), 2017\n\n \n\n📌 Website: www.inventindia.com\n\n📌 Portfolio - http://portfolio.inventindia.com/\n\n📌 LinkedIn - https://www.linkedin.com/company/inventindia/mycompany/\n\n \n\n💡 Founder Profiles\n\n🔗 Jyoti Sudhir - https://www.linkedin.com/in/jyotisudhir/\n\n🔗 Sanandan Sandy Sudhir - https://www.linkedin.com/in/sanandan-sandy-sudhir/\n\n \n\nWHY JOIN US? 🎉\n\n🚀 If you strive for Excellence.\n\n💼 If you are the best at what you do.\n\n🎨 If you are creative mind.\n\n😄 If you want to have fun while you work.\n\n🌍 If you want to make a difference.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Project Engineer (Fire Alarm Systems)",
        "job_id": "3789599932",
        "company_name": null,
        "location": "Bengaluru",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Project Engineering",
            "Project Planning",
            "Project Management",
            "Electrical Engineering",
            "fire alarm systems"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/3789599932/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n \n\nWe suggest you enter details here.\n\n\n Role Description\n \n\nThis is a full-time, on-site role for a Project Engineer specializing in fire alarm systems, located in Bengaluru. The Project Engineer will be responsible for overseeing all aspects of fire alarm system projects, including project planning, project management, and project engineering. Daily tasks involve coordinating with clients and team members, ensuring projects meet technical specifications and safety standards, conducting site inspections, and troubleshooting issues as they arise.\n\n\n Qualifications\n \nProject Engineering, Project Planning, and Project Management skills\nElectrical Engineering skills\nStrong Communication skills\nAbility to work independently and as part of a team\nFamiliarity with fire alarm systems and relevant regulations\nBachelor's degree in Electrical Engineering or related field",
        "source": "linkedin",
        "relevance_score": "medium"
    },
    {
        "title": "VLSI Placement Drive",
        "job_id": "4288015359",
        "company_name": "MinanoSpace Technologies",
        "location": "Ghaziabad",
        "experience": null,
        "salary": null,
        "key_skills": [
            "VLSI"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288015359/",
        "posted_at": null,
        "job_description": "About the job\n\nMinanoSpace Technologies Placement Drive\n🚀 Launch Your VLSI Career with Us! \n\n\n\n\nHighlights\n\n✅ Free 6-Month Applied VLSI Training Program\n\n • Company-Sponsored | Full-Time | Industry-Oriented | Knowledge-Intensive\n\n ✅ Hands-on, Application-Driven Learning\n\n ✅ Exposure to Real-World VLSI Industry Practices\n\n ✅ Expert Mentorship from Industry Professionals\n\n ✅ Guaranteed Placement in MinanoSpace Technologies upon successful completion\n\n \n\nEligibility: \n\n🎓 Diploma or B.Sc. in Electronics or Computer Science.\n\n \n\nApplication Process:  \n\n 📘 Preliminary Exam \n\n🗓️ 21st August 2025 (Thursday) \n\n🕥 10:30 AM – 12:30 PM \n\n 📘 Main Exam \n\n🗓️ 22nd August 2025 (Friday) \n\n🕥 10:30 AM – 12:30 PM \n\n 💼 Interview \n\n🗓️ 25 August 2025 (Monday) \n\n🕘 from 9:00 AM onwards \n\n \n\n📍 Location: Minanospace Technologies Pvt. Ltd. Office no. 15, 2nd floor, Mahalaxmi Tower, Vaishali, Ghaziabad, 201010 \n\n📧 Contact: minakshi@minanospace.com 🌐 Website: minanospace.com\n\n\n\n\n\n\n\nRegistration link: https://docs.google.com/forms/d/e/1FAIpQLSek9mETPAlwy4jLhGWZW4ZfGW5ybNBtwkYlAdbNcPmgExgngw/viewform?usp=sharing&ouid=110094832106382477663",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Android Developer",
        "job_id": "4288374711",
        "company_name": "MyRemoteTeam, Inc",
        "location": "Pune",
        "experience": "6+ Years",
        "salary": null,
        "key_skills": [
            "Android Development",
            "Kotlin",
            "UI Testing",
            "RESTful APIs",
            "Jetpack Components",
            "MVVM",
            "Git",
            "CI/CD"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288374711/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Us\n\nMyRemoteTeam, Inc is a fast-growing distributed workforce enabler, helping companies scale with top global talent. We empower businesses by providing world-class software engineers, operations support, and infrastructure to help them grow faster and better.\n\n\n\n\nJob Title: Android Developer\n\nExperience: 6+ Years\n\nLocation: Pune\n\n\n\n\n\n\n\nMandatory Skills\n\nAndroid Development – Strong expertise in native Android app development.\nKotlin – Proficient in building mobile applications using Kotlin.\nUI Testing\n\n\n\n\n\n\n\n\n\n\nResponsibilities\n\nDesign, develop, and maintain high-quality Android applications.\nWrite clean, efficient, and maintainable code using Kotlin.\nCollaborate with cross-functional teams including designers, backend developers, and QA engineers.\nIntegrate mobile applications with RESTful APIs and third-party services.\nEnsure application performance, quality, and responsiveness.\nConduct code reviews, unit testing, and debugging to maintain code quality.\nStay updated with the latest Android development trends, tools, and best practices.\n\n\n\n\n\n\n\n\n\n\nPreferred Skills\n\nExperience with Jetpack Components (ViewModel, LiveData, Navigation, etc.).\nKnowledge of MVVM architecture and design patterns.\nFamiliarity with Git and CI/CD processes.\nExperience in publishing apps on Google Play Store.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Production Engineer",
        "job_id": "4287846735",
        "company_name": "KD Ink Manufacturing Co.",
        "location": "Gondia, Maharashtra",
        "experience": "2+ years",
        "salary": null,
        "key_skills": [
            "Chemical Manufacturing",
            "Ink Manufacturing",
            "Process Handling",
            "Preventive Maintenance",
            "Troubleshooting",
            "ERP systems",
            "Mechanical Engineering",
            "Industrial Engineering"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287846735/",
        "posted_at": null,
        "job_description": "About the job\n\n🛠️ Job Title: Production Engineer\n\n📍 Location: KD Ink Manufacturing Co., Gondia, Maharashtra\n\n 🏭 Industry: Chemical / Ink Manufacturing\n\n 🕐 Work Type: Full-time | On-site (Factory-based)\n\n\n\n\n🔎 Job Summary:\n\nWe are looking for a Production Engineer to manage daily production operations and ensure smooth maintenance of machines at our chemical manufacturing unit. The ideal candidate should have hands-on experience in process handling, preventive maintenance, troubleshooting, and team supervision.\n\n\n\n\n✅ Key Responsibilities:\n\n🔧 Production Operations\n\nOversee day-to-day ink/chemical production processes\nEnsure production targets, quality parameters, and timelines are met\nCoordinate raw material, batch planning, and process optimization\n\n\n\n\n🛠️ Maintenance & Upkeep\n\nMaintain plant machinery and production line equipment\nHandle breakdowns with quick diagnosis and minimal downtime\nImplement preventive maintenance schedules\n\n\n\n\n📊 Documentation & Systems\n\nMaintain daily production logs and maintenance records\nWork with ERP systems for batch tracking and inventory updates\nEnsure compliance with safety, health, and environmental regulations\n\n\n\n\n👨‍🏭 Team Coordination\n\nSupervise production staff and operators\nTrain team members for SOPs, safety, and process efficiency\n\n\n\n\n🎓 Qualifications:\nDiploma / B.E. / B-Tech in Mechanical / Chemical / Industrial Engineering\n2+ years of experience in manufacturing or plant operations (chemical/ink preferred)\nHands-on knowledge of pumps, motors, mixers, heating systems\nBasic knowledge of safety norms & compliance\n\n\n\n\n💡 Skills Required:\nProblem-solving & quick decision-making\nPreventive Maintenance planning\nGood communication & leadership\nBasic computer/ERP usage (Excel, Email)\n\n\n\n\n📞 How to Apply:\n\n Interested candidates can contact:\n\n 📱 09022853694\n\n 📧 Email: hr@ceedee.in",
        "source": "linkedin",
        "relevance_score": "low"
    },
    {
        "title": "UI QA Automation Engineer",
        "job_id": "4203551860",
        "company_name": "Armada",
        "location": "Trivandrum, Kerala",
        "experience": null,
        "salary": null,
        "key_skills": [
            "UI QA Automation",
            "Selenium",
            "Cypress",
            "Playwright",
            "CI/CD",
            "Agile"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4203551860/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout the Company\n\nArmada is an edge computing startup that provides computing infrastructure to remote areas where connectivity and cloud infrastructure is limited, as well as areas where data needs to be processed locally for real-time analytics and AI at the edge. We’re looking to bring on the most brilliant minds to help further our mission of bridging the digital divide with advanced technology infrastructure that can be rapidly deployed anywhere.\n\n \n\nAbout the Role\n\nWe are seeking a detail-oriented and proactive UI QA Automation Engineer to join our Quality Assurance team. In this role, you will be responsible for developing and maintaining automated UI tests to ensure the delivery of high-quality web and mobile applications. You will work closely with developers, designers, and product managers to ensure all user interfaces are thoroughly tested and meet usability and functionality standards.\n\nLocation. This role is office-based at our Trivandrum, Kerala office. \n\nWhat You'll Do (Key Responsibilities)\n\nDesign, develop, and execute automated UI test scripts using tools such as Selenium, Cypress, or Playwright.\nMaintain and enhance the automation test framework for web and mobile applications.\nIntegrate automated tests into CI/CD pipelines for continuous validation.\nPerform functional, regression, and cross-browser/device testing.\nWork collaboratively with cross-functional teams to understand requirements and translate them into test cases.\nDocument and track defects using bug tracking tools (e.g., JIRA).\nContinuously identify opportunities to improve the testing process and automation coverage.\n\nRequired Qualifications\n\nBachelor’s degree in Computer Science, Engineering, or a related field.\n2+ years of experience in UI test automation.\nProficiency in JavaScript, TypeScript, Java, or Python for test development.\nExperience with testing frameworks such as Selenium, Cypress, Playwright, or similar.\nUnderstanding of web technologies (HTML, CSS, JavaScript) and responsive design testing.\nFamiliarity with CI/CD tools like Jenkins, GitHub Actions, or CircleCI.\nStrong analytical and problem-solving skills with excellent attention to detail.\n\nPreferred Qualifications\n\nExperience with mobile automation tools like Appium.\nKnowledge of BDD frameworks (e.g., Cucumber, Gherkin).\nExposure to performance and accessibility testing tools.\nFamiliarity with cloud-based testing platforms like BrowserStack or Sauce Labs.\n\nCompensation & Benefits\n\nFor India-based candidates: We offer a competitive base salary along with equity options, providing an opportunity to share in the success and growth of Armada.\n\n \n\nYou're a Great Fit if You're\n\nA go-getter with a growth mindset. You're intellectually curious, have strong business acumen, and actively seek opportunities to build relevant skills and knowledge \nA detail-oriented problem-solver. You can independently gather information, solve problems efficiently, and deliver results with a \"get-it-done\" attitude \nThrive in a fast-paced environment. You're energized by an entrepreneurial spirit, capable of working quickly, and excited to contribute to a growing company\nA collaborative team player. You focus on business success and are motivated by team accomplishment vs personal agenda \nHighly organized and results-driven. Strong prioritization skills and a dedicated work ethic are essential for you \n\nEqual Opportunity Statement\n\nAt Armada, we are committed to fostering a work environment where everyone is given equal opportunities to thrive. As an equal opportunity employer, we strictly prohibit discrimination or harassment based on race, color, gender, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other characteristic protected by law. This policy applies to all employment decisions, including hiring, promotions, and compensation. Our hiring is guided by qualifications, merit, and the business needs at the time.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Mid-Weight Drupal Developer",
        "job_id": "4287897623",
        "company_name": "DCX",
        "location": "India",
        "experience": null,
        "salary": null,
        "key_skills": [
            "Drupal 9",
            "Drupal 10",
            "front-end development",
            "back-end development"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287897623/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Overview\n\nDCX is an award-winning digital consultancy that helps clients maximise the value of their investment in digital by combining the power of data with compelling design and digital technology - enabling them to connect better with their customers and deliver better outcomes.\n\nWith a laser focus on driving better customer engagement, capturing insights for better decisions, streamlining business operations and driving commercial growth, we help organisations all around the world drive more memorable customer experiences and deliver even greater business impact.\n\nDue to the growing breadth and scope of our work we are looking to evolve our Technology Team, and are on the lookout for a talented, enthusiastic individual to join our team.\n\n\n\n\nTo find out more about what we do, visit https://paragon-dcx.com/\n\n\n\n\nAbout the Role\n\nAs a Mid-Weight Drupal Developer, you’ll support the development and maintenance of Drupal websites across both client projects and our managed service workstream. You’ll work on a range of tasks, from implementing new features to maintaining and improving existing codebases, within a collaborative, cross-functional team. Reporting to the Lead Developer, you’ll take ownership of smaller deliverables and contribute to larger builds with guidance, gaining exposure to both front-end and back-end development.\n\n\n\n\nKey Responsibilities\n\n• Develop and maintain Drupal 9/10 websites, including new features, configuration, and content modelling.\n\n• Work across client sprints and managed service tickets, handling bug fixes, enhancements, and small builds.\n\n• Assist in the development of custom modules and theming using SCSS, Twig, and Drupal best practices.\n\n• Support the integration of third-party APIs (e.g., REST, JSON:API) with guidance.\n\n• Use Composer, Git, and other tools to manage codebases and collaborate effectively with the wider dev team.\n\n• Participate in Agile ceremonies such as sprint planning, reviews, and retrospectives.\n\n• Write clean, well-documented code and contribute to internal knowledge sharing.\n\n• Raise technical risks or issues early and seek support when needed.\n\n• Stay up-to-date with developments in Drupal and related technologies.\n\n\n\n\nYou will need…\n\n2+ years of experience developing with Drupal 9/10.\nSolid PHP and object-oriented programming fundamentals.\nProficiency in Twig, HTML5, CSS3, SCSS, JavaScript and frontend libraries.\nStrong grasp of responsive design and modern theming practices\nExperience working with design systems and optimizing frontend performance\nEnsure designs are pixel-perfect, responsive, and cross-browser compatible.\nApply best practices in Accessibility (WCAG, ARAI) to ensure inclusivity for all users.\nFamiliarity with Git and Composer.\nBasic understanding of Drupal APIs and configuration management.\nSome experience integrating REST APIs or similar services.\nGood communication skills, with the ability to collaborate across technical and non-technical teams.\nEnthusiasm to learn, ask questions, and grow in a fast-paced environment\n\n\n\n\nBonus Points\n\n• Exposure to Acquia Site Studio or other low-code tools.\n\n• Familiarity with Jira, Confluence, and Agile workflows.\n\n• Knowledge of CI/CD processes.\n\n\n\n\nWe're invested in your growth! Expect support for Drupal and Acquia certification and the chance to play with a wide array of tools across the tech landscape.\n\n\n\n\nCultural competencies (In line with DCX’s EPIC Values)\n\n• Excellence: Ensures high-quality Scrum practices, actively pursues continuous improvement, and maintains standards exceeding stakeholder expectations.\n\n• Passion: Shows enthusiasm for agile methodologies, continuously expands agile knowledge, and promotes innovation in agile practices.\n\n• Integrity: Upholds ethical standards, ensures transparency, provides honest feedback, and takes accountability for agile project delivery\n\n• Collaboration: Effectively coordinates with teams, builds strong stakeholder relationships, and shares agile expertise to support a collaborative work environment.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "iOS Developer",
        "job_id": "4287839841",
        "company_name": "OneBanc",
        "location": "India",
        "experience": "2+ years",
        "salary": null,
        "key_skills": [
            "iOS",
            "Xcode",
            "Swift",
            "UI elements"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287839841/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Us:\n\nOneBanc is a neo-bank, building the economic infrastructure for the workforce of India. The idea of OneBanc started when a young girl asked Vibhore, a serial entrepreneur, why the money in her piggybank never grew. Adopting this philosophy of #DemandMore, OneBanc connects enterprises, banks, and HR Tech platforms to enhance value for all stakeholders. The core team has proven their vision and executive prowess in CoCubes – a complete assessment solution for students and institutes, which was acquired by Aon. They are now building the squad to enable FinTech revolution of the future. \n\n \n\nMust Have's\n\n2+ years of experience in iOS application development.\nAwareness of general mobile landscape, architectures, trends, and emerging technologies.\nFamiliarity with scalable architecture, strong knowledge of UI elements and understanding of the full mobile development life cycle.\nGood knowledge of Swift.\n\n \n\nYour Day\n\nDesign and build advanced applications for iOS platform using Xcode and Swift.\nUnit-test code for robustness, including edge cases, usability, and general reliability.",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Software Engineer",
        "job_id": "4285024536",
        "company_name": "Digital Shahi Pvt. Ltd.",
        "location": "Faridabad",
        "experience": null,
        "salary": null,
        "key_skills": [
            "HTML",
            "CSS",
            "JavaScript",
            "React",
            "SQL",
            "NoSQL",
            "Agile",
            "Git",
            "Jenkins"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4285024536/",
        "posted_at": null,
        "job_description": "About the job\n\nCompany Description\n\nDigital Shahi Pvt. Ltd. is a startup software development company focused on empowering individuals and businesses with innovative, cutting-edge solutions. Our mission is to transform organizations into thriving digital empires and enrich the lives of individuals through technology. We are a product based company and specialize in building software solutions that provide digital transformation and delivers innovative technology experiences. Based in Faridabad, we are on a journey to evolve and shape a world where technology enhances lives.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Software Engineer located in Faridabad. The Software Engineer will be responsible for designing, developing, and maintaining software applications. Day-to-day tasks include writing clean, scalable code, troubleshooting and debugging applications, collaborating with cross-functional teams to define and implement software solutions, and staying updated with emerging technologies and industry trends.\n\n\n\n\nQualifications\n\nProficiency in HTML, CSS & JavaScript\nExperience with web development framework React\nUnderstanding of database management systems such as SQL and NoSQL\nKnowledge of software development methodologies and tools such as Agile, Git, or Jenkins\nExcellent problem-solving skills and attention to detail\nGood communication and teamwork abilities\nBachelor's degree in Computer Science, Information Technology, or a related field\nPrevious experience in a similar role is a plus",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Junior Full Stack Web Developer",
        "job_id": "4288067726",
        "company_name": null,
        "location": "Coimbatore",
        "experience": "9 months – 1 year",
        "salary": null,
        "key_skills": [
            "Tailwind CSS",
            "Bootstrap",
            "jQuery",
            "React.js",
            "PHP",
            "Laravel",
            "MySQL",
            "Node.js",
            "WordPress",
            "REST API",
            "AngularJS",
            "AWS"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288067726/",
        "posted_at": null,
        "job_description": "About the job\n\n🚀 We’re Hiring: Junior Full Stack Web Developer\n\n\n\n\n📍 Location: Coimbatore | 💼 Experience: 9 months – 1 year\n\n\n\n\nWe’re looking for passionate junior developers who can confidently work on real projects and grow with our team.\n\n\n\n\nWhat You’ll Do\n\n ✅ Contribute to real client projects\n\n ✅ Complete daily tasks & share EOD reports\n\n ✅ Participate in discussions & KT sessions\n\n ✅ Adapt to new tools and frameworks\n\n\nMust-Have Technical Skills\n\n✅ Tailwind CSS, Bootstrap, jQuery\n\n✅ React.js (or similar frontend framework)\n\n✅ Backend development using:\n\nPHP (Core + Laravel)\nMySQL (queries, joins, indexing basics)\nNode.js\n\n✅ Content Management with WordPress\n\n✅ Proficiency in REST API creation and integration\n\n✅ Strong debugging and problem-solving skills\n\n✅ Understanding of full-stack workflows (frontend ↔ backend ↔ database)\n\n\nNice to Have Skills\n\n👉 AngularJS, MongoDB\n\n👉 Google Analytics, SEO basics\n\n👉 UI/UX familiarity with Figma\n\n👉 Exposure to Hadoop, AWS, and Serverless architecture\n\n\n\n\nWe Value\n\n ✨ Positive attitude, discipline & teamwork\n\n ✨ Eagerness to learn and grow in new stacks\n\n ✨ Clear communication of technical ideas\n\n\n\n\nEligibility\n\n 🎓 9 months – 1 year | 💻 Portfolio/GitHub with hands-on coding projects\n\n👉 If you’re ready to apply your skills and learn by building, we’d love to hear from you!",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Full Stack Engineer",
        "job_id": "4287895960",
        "company_name": null,
        "location": "India",
        "experience": "2–5 years",
        "salary": null,
        "key_skills": [
            "Full Stack",
            "React",
            "Angular",
            "Vue.js",
            "Node.js",
            "Python",
            "Go",
            "APIs",
            "AWS",
            "GCP",
            "Azure",
            "CI/CD"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4287895960/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout the Company\n\nJoin a global non-profit that drives large-scale impact through wellness programs, mindfulness practices, and community development initiatives.\n\nWith a presence in over 180 countries, we empower individuals and transform communities through innovation, compassion, and service.\n\n\n\n\n\n\n\nAbout the Role\n\n\n\n\nWe are seeking a Full Stack Engineer who can architect and develop end-to-end features across modern web stacks. You will work closely with product, design, and backend teams to deliver scalable applications that offer seamless user experiences. Ideal candidates are strong in both frontend and backend technologies, and comfortable taking ownership from concept to deployment.\n\n\n\n\n\n\n\nKey Responsibilities\n\n • Design, develop, and maintain full stack web applications\n\n • Build intuitive and responsive user interfaces using React, Angular, or Vue.js\n\n • Develop scalable APIs and backend services using Node.js, Python, or Go\n\n • Collaborate with designers and product managers to define and refine product features\n\n • Ensure code quality through unit testing, integration testing, and code reviews\n\n • Optimize applications for speed, performance, and scalability\n\n • Integrate with third-party APIs, authentication systems, and payment gateways\n\n • Deploy applications to cloud platforms (AWS/GCP/Azure) using CI/CD pipelines\n\n • Monitor performance and troubleshoot issues in production environments\n\n\n\n\n\n\n\nRequired Qualifications\n\n • 2–5 years of hands-on experience in full stack web development\n\n • Proficiency in JavaScript/TypeScript, with experience in at least one frontend framework (React preferred)\n\n • Strong understanding of backend development using Node.js, Express, Django, or similar frameworks\n\n • Good grasp of HTML5, CSS3, responsive design, and cross-browser compatibility\n\n • Experience with RESTful APIs, GraphQL, and WebSockets\n\n • Familiarity with databases – both relational (PostgreSQL/MySQL) and NoSQL (MongoDB/Redis)\n\n • Knowledge of Git, version control workflows, and modern DevOps practices\n\n • Ability to write clean, maintainable, and well-documented code\n\n\n\n\nPreferred Skills\n\n • Experience with Docker, Kubernetes, and cloud deployments\n\n • Familiarity with authentication (OAuth2, JWT), and security best practices\n\n • Understanding of CI/CD pipelines, testing tools, and build systems\n\n • Exposure to microservices or event-driven architecture\n\n • Experience with tools like Webpack, Babel, or Vite for frontend build optimization\n\n\n\n\n\n\n\nNice to Have\n\n • Prior experience in a startup or product-based company\n\n • Contributions to open-source projects or personal portfolio\n\n • Familiarity with analytics, performance monitoring tools (Sentry, Datadog, etc.)\n\n • Interest in UI/UX or end-user psychology\n\n\n\n\n\n\n\n\n\n\nWhy Join Us\n\n • Work on mission-driven technology with real-world impact\n\n • Ownership across full product lifecycle — from idea to deployment\n\n • Flexible work setup (remote/hybrid) and supportive team culture\n\n • Access to modern dev tools, growth budget, and learning support\n\n • Build for scale, impact, and innovation in a fast-moving environment\n\n\n\n\n\n\n\nIndustry\nSoftware Development\nEmployment Type\n\nFull-time",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "AI Engineer",
        "job_id": "4288027549",
        "company_name": null,
        "location": "India",
        "experience": "2+ Years",
        "salary": null,
        "key_skills": [
            "AI",
            "anomaly detection",
            "TensorFlow Lite",
            "machine learning",
            "deep learning",
            "CNN",
            "RNN",
            "GAN",
            "Python",
            "TensorFlow",
            "PyTorch",
            "scikit-learn",
            "LSTM",
            "GRU",
            "Pandas",
            "Matplotlib",
            "Seaborn"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288027549/",
        "posted_at": null,
        "job_description": "About the job\n\nExperience : 2+ Years\n\n\n\n\nOpportunity to work build advanced engineering AI products\n\n\n\n\nRequired Skills:\n\n• Knowledge of anomaly detection techniques (statistical models, unsupervised learning)\n\n• Experience in integrating AI models (optimization for edge devices, TensorFlow Lite, etc.)\n\n• Fundamental understanding of machine learning and deep learning (CNN, RNN, GAN)\n\n• Experience with Python libraries (TensorFlow, PyTorch, scikit-learn, etc.)\n\n• Understanding of time-series data processing (experience with LSTM, GRU, etc.)\n\n• Sensor data processing (noise reduction, feature extraction, preprocessing techniques)\n\n• Data visualization and analysis skills (Pandas, Matplotlib, Seaborn)\n\n• AI model optimization and evaluation methods (cross-validation, hyperparameter tuning)",
        "source": "linkedin",
        "relevance_score": "high"
    },
    {
        "title": "Adobe Analytics Engineer",
        "job_id": "4288379110",
        "company_name": "MyRemoteTeam, Inc",
        "location": "Pune",
        "experience": "6+",
        "salary": null,
        "key_skills": [
            "Adobe Analytics",
            "Adobe Launch",
            "JavaScript",
            "jQuery",
            "Web SDK",
            "JavaScript",
            "tag management",
            "eVars",
            "props",
            "events"
        ],
        "job_url": "https://in.linkedin.com/jobs/view/4288379110/",
        "posted_at": null,
        "job_description": "About the job\n\nAbout Us\n\nMyRemoteTeam, Inc is a fast-growing distributed workforce enabler, helping companies scale with top global talent. We empower businesses by providing world-class software engineers, operations support, and infrastructure to help them grow faster and better.\n\n\n\n\nJob Title: Adobe Analytics Engineer\n\nExperience: 6+\n\nLocation: Pune (Hybrid)\n\n\n\n\nKey Responsibilities:\n\n6+ Years of hands-on experience delivering Adobe Analytics solutions.\nStrong knowledge of Adobe Launch(Tags), Event-Driven Data Layer, and Web SDK.\nProficiency in JavaScript/jQuery within web analytics and tag management contexts.\nExpertise in Adobe Analytics tagging strategy, reporting, and dashboard creation.\nExperience with designing, implementing, and optimizing advanced analytics solutions\nStrong problem-solving skills with a keen eye for process optimization. Excellent communication and presentation skills.\nShould have a proven track record of delivering data-driven insights and supporting business decision-making.\nDeliver end-to-end Adobe Analytics implementations, from requirements gathering to deployment.\nDesign and implement Event-Driven Data Layer (EDDL) and Adobe Launch configurations.\nDevelop advanced tracking and tagging strategies for user behavior and journey measurement.\nEvaluate website structures to determine tagging requirements and technical specifications.\nCreate and manage data layers, metadata, and variable/event classification (eVars, props, events), including custom variable tracking and processing rules.\nImplement and maintain Web SDK configurations, metadata creation, rules, data elements, variables, and plugins.\nWrite clear and comprehensive tagging documentation for technical and non-technical stakeholders.\nDesign and execute test scenarios to validate tracking accuracy.\nProvide technical solution designs for tagging and analytics implementation, including Technical Specification Documentation (TSD).\nBuild and maintain Adobe Workspace dashboards, delivering actionable insights.\nIdentify and recommend process improvements during day-to-day validation and testing.\nCollaborate with cross-functional teams to implement Adobe Analytics solutions.\nPresent findings and recommendations effectively to stakeholders at all levels.\nUtilize front-end technologies such as JavaScript, jQuery, HTML5, CSS3, and basic Angular for tagging and integration needs.\n\n \n\nAdditional Skills (good to have)\n\nExperience in the banking/payments domain.\nKnowledge of BI tools such as Tableau or Power BI (strong Excel skills required).\nBackground in digital marketing and insights generation.",
        "source": "linkedin",
        "relevance_score": "high"
    }
]