[
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281541191/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nScope of work includes designing visually appealing and intuitive user interfaces for our web and mobile applications. Resource will be responsible for creating high-fidelity designs, designing icons and graphics, and developing a consistent design language. He/ She will collaborate with cross-functional teams to ensure design solutions meet business goals and user needs.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281537630/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nJob Title: Hiring Dot Net Developer\n\nLocation: Visakhapatnam, Andhra Pradesh(Work From Office)\n\nExperience: 2-3 Years \n\n \n\nResponsibilities: \n\n- Design, develop, and maintain .NET Core applications using C#. \n\n- Collaborate with cross-functional teams to gather and implement software requirements. \n\n- Write efficient, reusable, and reliable code. \n\n- Perform unit testing and debugging to ensure software quality. \n\n- Keep up-to-date with .NET Core advancements and best practices.\n\n- API integration.\n\n\n\n\nShare your resume here- talent.acquisition@traversia.net",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281536826/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\nStarHealth Insurance offers comprehensive insurance policies that prioritize the health and safety of your family. The plan provides protection from unforeseen situations, ensuring peace of mind for you and your loved ones.\n\n\n\n\nRole Description\n\nThis is a full-time, on-site role based in Bengaluru for a MERN/MEAN Full Stack Developer. The developer will be responsible for both front-end and back-end web development, engaging in software development, and integrating with the team to deliver high-quality solutions. Daily tasks include developing user-facing elements, building reusable code, optimizing applications for speed and scalability, and collaborating with other team members to design and launch new features.\n\n\n\n\nQualifications\n\nExperience in Back-End Web Development and understanding of Full-Stack Development\nProficiency in Front-End Development and familiarity with Cascading Style Sheets (CSS)\nStrong Software Development skills and experience with MERN/MEAN stack\nExcellent problem-solving skills and attention to detail\nAbility to work in a team-oriented, collaborative environment\nBachelor's degree in Computer Science, Engineering, or a related field",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281532953/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\n \n\nApp Ringer is a technology company specializing in professional mobile app development, website development, UI/UX design, and custom software solutions. Our team of highly skilled developers and quality engineers create high-quality projects using modern industry standard tech stacks and technologies. We focus on building long-term relationships with clients by understanding their needs and providing specific solutions in technologies like PHP, Laravel, Python, and more.\n\n\n\n\n Role Description\n\n \n\nThis is a full-time remote role for a PHP Laravel Developer at App Ringer. The Developer will be responsible for back-end web development, object-oriented programming (OOP), front-end development, software development, and programming tasks on a day-to-day basis.\n\n\n\n\n Qualifications\n\n \n\nBack-End Web Development and Software Development skills\nObject-Oriented Programming (OOP) skills\nFront-End Development and Programming skills\nExperience with PHP and Laravel frameworks\nKnowledge of modern web technologies like Angular JS, VueJS, ReactJS, NodeJS\nAbility to work independently and as part of a team\nStrong problem-solving skills and attention to detail\nBachelor's degree in Computer Science, Engineering, or related field",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281528876/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n \nA successful website doesn't start and stop with a good design. To attract users, it's important to promote your website effectively. While SEO is a key component, other tactics such as paid advertising, social media marketing, and content marketing are also essential. At VND Web Company, we specialize in creating and promoting websites to ensure they reach their target audience and achieve their goals.\n\n Role Description\n \nThis is a full-time on-site role for a Web Developer, located in Bangalore Urban. The Web Developer will be responsible for both front-end and back-end web development tasks. This includes creating and maintaining websites, designing web interfaces, writing and testing code, and ensuring the functionality and performance of web applications.\n\n Qualifications\n \n\nFront-End Development and Web Design skills\nBack-End Web Development and Programming skills\nProficiency in Web Development tools and technologies\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a team environment\nBachelor's degree in Computer Science, Information Technology, or a related field\nExperience with SEO practices and techniques is a plus",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281999094/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281529883/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281534269/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279859138/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281653839/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281335662/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nStipend: Up to ₹18,000/month\n\n\n\n\nWork Arrangement: This is a Work From Office role, requiring 6 working days per week during the probation period. After successful completion of the probation, the schedule will shift to 5 working days per week, and the position will convert to a permanent role\n\n\n\n\nCompany Address: First floor, 13th main, 530, MS Ramaiah Enclave Main Rd, Havanur Layout, Nagasandra, Bengaluru, Karnataka 560073(Near IKEA)\n\n\n\n\nHey Future Innovator! Ready to code beyond your wildest dreams?\n\nTired of endless tutorials? Craving a place where your code builds something revolutionary? At Configtap, we're not just making apps; we're crafting the future with elegant Flutter animations and intelligent AI. Forget the stiff corporate vibe – we're a hub of brilliant minds, fueled by coffee and the thrill of solving complex problems. Think fun hackathons and team lunches that feel like mini-festivals! If you're ready to ditch the ordinary and dive into a world where your creativity is celebrated, your learning is limitless, and your code shapes cutting-edge AI (we're even exploring things like cursor-based coding!) ConfigTap is where your adventure begins!\n\n\n\n\nAbout Us:\n\nJoin our innovative team at ConfigTap, a dynamic tech company at the forefront of AI-powered solutions,Game Development and cutting-edge mobile applications. We're passionate about pushing tech boundaries and empowering our developers with the best tools. Our Nagasandra, Bangalore office boasts best-in-class infrastructure designed for creativity and collaboration. Here, you'll get unparalleled learning and work on advanced AI-based systems, even exploring revolutionary coding methods like AI cursor-based development.\n\n\n\n\nThe Opportunity:\n\n\n\n\nWe're looking for enthusiastic Fresher Flutter Developers to join our growing mobile development team. This is an incredible chance to get hands-on experience building high-performance, cross-platform mobile apps that will impact thousands. If you have a strong understanding of Flutter and Dart, a passion for mobile GAME development, and a desire to learn from experts in a fast-paced, innovative environment, we want to hear from you!\n\n\n\n\nKey Responsibilities:\n\n\n\n\nCollaborate with senior developers and designers to build robust mobile applications.\nAssist in the design, development, and maintenance of high-quality Flutter applications.\nWrite clean, efficient code following best practices.\nParticipate in code reviews, giving and receiving feedback.\nDebug and troubleshoot issues for optimal app performance.\nContribute to the entire application lifecycle.\nStay updated with the latest Flutter advancements and AI integration.\nActively participate in team discussions.\n\n\n\n\nWhat We're Looking For:\n\n\n\n\nEducational Background: Currently pursuing or recently completed a Bachelor's degree in Computer Science or a related field.\n\nTechnical Skills:\n\nMinimum 1 year of experience working on Flutter or Dart.\nFamiliarity with mobile app development concepts (UI/UX, state management).\nMinimum 1 year understanding of JavaScript is a plus.\nBasic understanding of RESTful APIs.\nMandatory knowledge of GitHub for version control.\nA portfolio demonstrating Flutter projects is a significant plus.\n\nSoft Skills:\n\nStrong problem-solving skills.\nExcellent communication and collaboration.\nEagerness to learn and adapt.\nSelf-motivated and proactive.\nAbility to work effectively in a team.\n\n\n\n\nWhy Join Us?\n\n\n\n\nUnparalleled Learning & Growth: Work alongside experienced developers, tackle complex challenges, and receive mentorship. Dive deep into Flutter and its integration with cutting-edge AI.\nAdvanced AI-Based Systems & Tools: Get hands-on with real-world AI applications. Explore innovative coding paradigms like Replit,cursor-based coding and other intelligent AI development tools.\nBest-in-Class Infrastructure: Our Nagasandra(near IKEA) office is designed for peak productivity – modern workspace, high-speed internet, and collaborative zones.\nWork From Office 5 Days: We believe in the power of in-person collaboration, fostering a strong team culture, and faster knowledge transfer. This role requires full-time presence at our Nagasandra office, 5 days a week.\nImpactful Work: Build apps that make a real difference and create exceptional user experiences.\nVibrant Company Culture: Be part of a supportive, inclusive, and fun environment where your ideas are valued.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281339878/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nLocation: India,Remote\n\n Employment Type: Full-time\n\n Experience: 0–2 years\n\n Department: Software Development / IT\n\n\n\n\nWe are looking for an enthusiastic and detail-oriented Junior Java Developer - Entry Level to join our development team. As an entry-level developer, you will assist in building high-quality, scalable software solutions using Java. You will work under the guidance of senior developers to gain hands-on experience in the software development lifecycle and modern development tools.\n\n\n\n\nKey Responsibilities:\n\nWrite, test, and maintain Java-based applications.\nSupport the development of backend components using Java, Spring, or related frameworks.\nAssist in troubleshooting, debugging, and optimizing application performance.\nCollaborate with team members to understand project requirements and implement features.\nParticipate in code reviews and apply feedback for continuous improvement.\nDocument code, processes, and system configurations as needed.\nStay up to date with Java technologies and industry best practices.\n\n\n\n\nRequired Skills & Qualifications:\n\nBachelor’s degree in Computer Science, Information Technology, or a related field.\nGood understanding of Core Java, object-oriented programming (OOP), and data structures.\nFamiliarity with Java frameworks such as Spring Boot, Hibernate, or similar.\nBasic knowledge of HTML, CSS, JavaScript is a plus.\nUnderstanding of SQL and relational databases (e.g., MySQL, PostgreSQL).\nStrong problem-solving and analytical skills.\nWillingness to learn and adapt in a collaborative environment.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279473353/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nAbout Axy\n\nAxy is building AI-enabled collaboration and exploration tools for scientists and scientific conferences. We're a rapidly growing startup based in Geneva, Switzerland, with a passionate team of 9 people working to transform how scientists collaborate and explore research.\n\n\n\n\nThe Role\n\nWe're looking for a Full Stack Engineer to join our core development team as we build our flagship product. You'll work directly with our product team to develop new features that meet business requirements, contributing equally to both frontend and backend development.\n\n\n\n\nKey Responsibilities:\n\nDevelop new product features working closely with the product team\nBuild and maintain both frontend and backend components\nParticipate in daily stand-ups and 10-day sprint cycles\nContribute to our core product development alongside a cross-functional team\n\n\n\n\nTechnical Stack\n\nYou'll be working with:\n\nFrontend: React, Next.js\nBackend: Node.js, Fastify\nCloud: AWS Lambda functions\nDatabases: PostgreSQL, Redis, QDrant DB\n\n\n\n\nWhat We're Looking For\n\nRequired:\n\n1-2 years of experience working in a fast-paced startup environment\nStrong proficiency in Node.js and React\nExperience with full-stack development\nExcellent communication skills and collaborative mindset\n\nNice to Have:\n\nGeneral understanding of major AWS services\nExperience with our specific tech stack (Fastify, Next.js, PostgreSQL, Redis)\nPrevious exposure to AI/ML applications\n\n\n\n\nWork Environment\nLocation: Fully remote\nHours: Fixed schedule, 9 AM - 6 PM IST (India timezone)\nTeam: Flat hierarchy with direct reporting to Head of Engineering\nCulture: Cross-functional team with diverse skill sets focused on collaboration and contribution\n\n\n\n\nApplication Process\n\nPlease submit:\n\nYour resume\nPortfolio website (if available)\nGitHub profile showcasing your contributions\n\n\n\n\nWe evaluate candidates through technical test rounds to assess skills and fit.\n\n-------------------------------------------------------------------------------------\n\nReady to help build the future of scientific collaboration? We'd love to hear from you!",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4241674938/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nWho we are\n\n\n\n\nWe're a leading, global security authority that's disrupting our own category. Our encryption is trusted by the major ecommerce brands, the world's largest companies, the major cloud providers, entire country financial systems, entire internets of things and even down to the little things like surgically embedded pacemakers. We help companies put trust - an abstract idea - to work. That's digital trust for the real world.\n\n \n\nJob summary\n\n\n\n\nThe DigiCert ONE CA team is looking for a knowledgeable Software Engineer to join our agile cross functional team to build the future of PKI and security management.\n\n\n\n\nWhat you will do\n\n\n\n\n\nBuild RESTful, highly scalable cloud native webservices using Go\n\n\nCollaborate with the team in the design, development, testing, and deployment of high-quality code\n\n\nEngage with other engineering leaders to implement industry best practices\n\n\nAnalyze, troubleshoot, and debug product defects and provide timely solutions to customer needs\n\n\nDevelop a deep understanding of PKI products, architecture, and systems\n\n\n\n\n\nWhat you will have\n\n\n\n\n\n2+ years of professional experience in the engineering industry\n\n\nExperience designing and developing RESTful web service APIs\n\n\n\n\n\nStrong knowledge of the following:\n\n\n\n\n\nSoftware engineering best-practices in design, testing, and architecture\n\n\nService-based architectures and distributed systems\n\n\nRelational databases, including indexes, and SQL best practices\n\n\nDesign patterns, data structures, and algorithms\n\n\nContinuous Integration and Continuous Delivery/DevOps\n\n\nStrong interpersonal communication skills\n\n\nProficiency in Go Language\n\n\n\n\n\nNice to have\n\n\n\n\n\nUnderstanding of SSL/TLS, PKI, and other security related technologies\n\n\nBachelor’s degree in Computer Science, Information Systems, etc., or equivalent years of experience in the industry\n\n\nTechnologies we use, any experience is a bonus: MySQL; React / Redux; C++ ; Docker and Kubernetes; Git and GitHub\n\n\n\n\n\nBenefits\n\n\n\n\n\nGenerous time off policies\n\n\nTop shelf benefits\n\n\nEducation, wellness and lifestyle support",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279471105/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nAt Quanfluence, we're building India's first photonic quantum computer—and we need your help to make it usable, powerful, and intelligent.\n\nWe're looking for a software engineer to develop the classical layers of our Coherent Ising Machine—the APIs, orchestration systems, and hybrid solvers that make quantum acceleration seamless for end users. But we’re going one step further.\n\nYou'll also design AI-driven agentic layers that interpret, optimize, and adapt workloads—making hybrid quantum-classical optimization as easy as calling an API.\n\n \n\nWhat You Will Do:\n\nBuild classical runtimes and hybrid solvers for QUBO and other optimization problems\nDevelop clean, user-facing Python SDKs\nIntegrate AI/agentic logic for autonomous job orchestration\nCollaborate with physicists & hardware teams to drive real-world performance\n\n\n\n\nQualifications\n\nBachelor's degree or equivalent experience in Computer Science or related field\nStrong coding skills in Python + C++/Rust\nExperience in optimization, algorithms, or orchestration systems\nExposure to AI/ML or agent-based systems (LLMs, RL, etc.)\nBonus: Familiarity with D-Wave, Braket, or quantum computing concepts\n\n\n\n\nThis is not just another job—it's a chance to define how AI and quantum work together.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281990977/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany\n\nZeminent\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a MERN Stack Developer located in Bengaluru. The MERN Stack Developer will be responsible for designing, developing, and maintaining web applications using MongoDB, Express.js, React.js, and Node.js. Day-to-day tasks will include writing clean code, collaborating with cross-functional teams, integrating with third-party services, and ensuring high performance and responsiveness of applications. The developer will also be involved in troubleshooting and resolving technical issues as they arise.\n\n\n\n\nQualifications\n\nProficiency in MongoDB, Express.js, React.js, and Node.js\nExperience with front-end technologies such as HTML, CSS, and JavaScript\nKnowledge of RESTful APIs and web services\nStrong understanding of version control tools such as Git\nAbility to write clean, reusable, and efficient code\nExcellent problem-solving skills and attention to detail\nExperience in full-stack development\nBachelor's degree in Computer Science, Engineering, or related field\nStrong communication skills and ability to work collaboratively",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279859495/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nPosition: Java Developer Intern \n\nLocation: Ahmedabad \n\nDuration: 3 Months-6 Months \n\n\n\n\nAbout Liquify: \n\nLiquify, developed by Sumanju Technologies, is a cutting-edge fintech platform that is revolutionizing investor access to liquidity through instant, paperless loans secured against mutual funds and securities. Our mission is to deliver innovative financial solutions that cater to evolving customer needs. We are seeking passionate and talented Java Developer Interns to join our tech team in Ahmedabad. \n\n\n\n\nJob Overview: As a Java Developer Intern at Liquify, you will be part of a dynamic development team working on backend systems that power our fintech platform. You will be involved in coding, debugging, and developing core features, gaining hands-on experience in Java development and exposure to fintech industry applications. Key \n\n\n\n\nResponsibilities: \n\nAssist in the design, development, and maintenance of Java-based applications and systems. \nWrite clean, efficient, and reusable code to support the backend architecture of our fintech platform. \nCollaborate with cross-functional teams, including product managers and frontend developers, to integrate user-facing elements with server-side logic. \nDebug and troubleshoot issues in existing codebases to ensure application performance and functionality. \nParticipate in code reviews and contribute to improving development processes and standards. • Assist in testing and deployment activities. \n\n\n\n\nQualifications: \n\nCurrently pursuing or recently completed B.Tech, BCA, or MCA with a specialization in Computer Science or related fields. \nStrong knowledge of Java programming and object-oriented principles. \nFamiliarity with Java frameworks such as Spring or Hibernate is a plus. \nBasic understanding of databases, SQL, and web technologies. \nAbility to work with version control systems like Git. \nStrong problem-solving skills and attention to detail. \nGood communication and teamwork skills. \n\n\n\n\nPreferred Skills: \n\nExperience with RESTful APIs and web services. \nFamiliarity with Agile development practices. \nKnowledge of front-end technologies like HTML, CSS, or JavaScript is a bonus. \n\n\n\n\nWhy Intern with Liquify? \n\nGain hands-on experience in Java development within a fast-growing fintech company. \nWork on real-world projects that directly impact product development. \nMentorship from experienced developers and exposure to cutting-edge technology. \nA collaborative and supportive working environment.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279855409/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n \n\nInfosys BPM Ltd., a subsidiary of Infosys Ltd., specializes in integrated end-to-end business process management and outsourcing. Established in April 2002, Infosys BPM delivers significant transformational benefits to clients through cost reduction, productivity improvements, and process re-engineering. With a global presence in countries including India, Poland, the United States, and China, Infosys BPM has garnered over 60 industry awards in the past five years, recognized for its exceptional people practices and industry leadership.\n\n\n Role Description\n \n\nThis is a full-time on-site role for an SQL Developer located in Bengaluru. The SQL Developer will be responsible for designing and developing databases, performing Extract, Transform, Load (ETL) operations, and data modeling. Day-to-day tasks will involve writing and optimizing SQL queries, ensuring data integrity, and collaborating with cross-functional teams to meet project requirements. The role demands keen analytical skills to support data-driven decision-making processes.\n\n\n Qualifications\n \nDatabase Development and Database Design skills\nExtract Transform Load (ETL) experience and Data Modeling skills\nAnalytical skills for data analysis and problem-solving\nProficiency in writing and optimizing SQL queries\nExcellent communication and teamwork skills\nBachelor's degree in Computer Science, Information Technology, or related field\nExperience in the BPM industry is a plus",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281343903/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nLocation: Mangalore (Work From Office) \n\nExperience: 1 Year in Product Company or 1.5-2 Years in Service + Projects \n\nPosition: Full Time Permanent\n\n\n\n\nWe are looking for a talented Frontend Developer with expertise in React to join our Mangalore-based team. You will create engaging, responsive user interfaces for our product, ensuring a seamless and intuitive user experience.\n\n\n\n\nResponsibilities: \n\n- Develop and maintain user interfaces using React for high-quality, responsive designs. \n\n- Collaborate with backend developers to integrate APIs for smooth data flow.\n\n- Migrate the existing codebase from Angular to React (Next.js) \n\n- Optimize frontend performance and ensure cross-browser compatibility. \n\n- Write clean, modular, and testable code adhering to best practices. \n\n- Work with designers to translate UI/UX wireframes into functional components. \n\n- Participate in agile ceremonies, including sprint planning and code reviews. \n\n- Debug and resolve frontend issues to enhance user experience. \n\n- Stay updated on React ecosystem trends and best practices. \n\n\n\n\nRequirements: \n\n- 1 year of experience in a product company or 1.5-2 years in service-based companies with product projects, using Next.js/React. \n\n- Strong proficiency in JavaScript, HTML, Tailwind CSS, and Next.js (React ecosystem) (e.g., Redux, Hooks). \n\n- Experience with RESTful APIs and integrating backend services. \n\n- Familiarity with version control (e.g., Git) and modern build tools (e.g., Webpack, Vite). \n\n- Understanding of UI/UX principles and responsive design.\n\n- Ability to understand and work effectively with large existing codebases. \n\n- Strong communication and teamwork skills. \n\n- Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent experience). \n\n\n\n\nSecondary Skills: Basic backend development (e.g., Node.js). \n\nWhy Join Us?: Contribute to innovative products in a vibrant tech hub with opportunities for skill development and career growth.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281602326/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nJob Description: Mobile Application Developer\n\n\n\n\nWe are seeking a talented React Native Developer to join our tech-driven team. You will be responsible for developing high-quality mobile applications using React Native, JavaScript, and TypeScript. Your role will involve working closely with cross-functional teams to deliver seamless and efficient user experiences.\n\n\n\n\nKey Responsibilities:\n\nDevelop and maintain mobile applications using React Native.\nWrite clean and maintainable code in JavaScript and TypeScript.\nCollaborate with UI/UX designers to implement intuitive interfaces.\nOptimize application performance for maximum speed and scalability.\nIntegrate RESTful APIs and third-party libraries.\nUtilize state management libraries like Redux or MobX.\nManage code versioning with Git.\nParticipate in code reviews and team collaborations.\nStay updated with emerging technologies and best practices.\n\n\n\n\nRequired Skills and Qualifications:\n\nBachelor's degree in Computer Science, Engineering, or related field.\nProficient in JavaScript and TypeScript.\nStrong experience with React Native for mobile app development.\nFamiliarity with CSS pre-processors like SASS or LESS.\nExperience with front-end tools such as Babel, Webpack, and NPM.\nKnowledge of RESTful APIs and asynchronous programming.\nProficient with code versioning tools like Git.\nUnderstanding of mobile app deployment on iOS and Android platforms.\n\n\n\n\nPreferred Skills:\n\nExperience with state management libraries (Redux, MobX).\nKnowledge of modern authentication and authorization mechanisms.\nExperience deploying applications on cloud platforms (AWS, Azure, Google Cloud).\nFamiliarity with containerization (Docker) and orchestration (Kubernetes).\nUnderstanding of GraphQL and Apollo Client.\nExperience with CI/CD pipelines and automation tools.\nKnowledge of testing frameworks like Jest or Enzyme.\nFamiliarity with React Navigation for handling app routing and navigation.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279462443/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nHiring: Frontend Developer (React.js, Next.js, Tailwind CSS) – Immediate Joining\n\nWe’re looking for a skilled Frontend Developer to join our founding team and build scalable, high-performance web applications.\n\n\n\n\nTech Stack Required:\n\nReact.js & Next.js (minimum 2 years experience)\nTailwind CSS, HTML5, CSS3, JavaScript (ES6+)\nExpress.js or backend API integration experience is a plus\n\nYour Role:\n\nBuild responsive and optimized frontend interfaces\nCollaborate with UI/UX designers and backend developers\nEnsure cross-browser compatibility and performance\nWrite clean, modular, and maintainable code\n\n\n\n\nImmediate joining required.\n\n\n\n\nIf you love clean code and great UI, come build with us!",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279463338/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nJob Title : Performance Test Engineer – JMeter\n\nLocation : India (Remote)\n\nKey Responsibilities\n\nDesign and implement performance test strategies using JMeter.\n\nDevelop and maintain performance test scripts for web and API-based applications.\n\nExecute load, stress, endurance, and scalability tests.\n\nAnalyze test results and identify performance bottlenecks.\n\nCollaborate with development, DevOps, and QA teams to resolve performance issues.\n\nMonitor system performance using tools like Grafana, InfluxDB, New Relic, or Dynatrace.\n\nCreate detailed test reports and present findings to stakeholders.\n\nContinuously improve performance testing processes and frameworks.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281486573/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\nWebknot Technologies is a software development company that specializes in software engineering, product development, cloud architecture, and digital transformation. We work with clients worldwide in industries such as Retail, Financial Services, Telecommunications, Health Care, and High-Tech. Our team consists of young and highly talented individuals who creatively solve business problems and deliver products that enhance our clients' competitive edge. We prioritize speed and efficiency, ensuring that every product is delivered quickly to accelerate business success.\n\n\n\n\nRole Overview\n\nAs a MERN Stack Developer, you will be responsible for developing and maintaining end-to-end web applications using MongoDB, Express.js, React.js, and Node.js. The ideal candidate is a self-starter who is comfortable working in a dynamic environment and has a passion for clean, efficient, and scalable code.\n\nKey Responsibilities\nDesign, develop, and maintain robust, scalable, and high-performance web applications.\nBuild reusable components and front-end libraries for future use.\nDevelop RESTful APIs and integrate them with front-end components.\nOptimize applications for maximum speed and scalability.\nCollaborate with UI/UX designers, product managers, and backend developers to deliver high-quality solutions.\nWrite clean, maintainable, and well-documented code.\nConduct code reviews and troubleshoot/debug applications.\nKeep up with emerging technologies and best practices in web development.\nRequirements\n2+ years of hands-on experience in MERN stack development.\nStrong proficiency in React.js including hooks, state management (Context API/Redux), and component lifecycle.\nExperience building RESTful APIs using Node.js and Express.js.\nExperience with MongoDB, including schema design, aggregation, and performance optimization.\nProficient understanding of JavaScript, ES6+, HTML5, CSS3, and modern front-end build pipelines and tools.\nFamiliarity with version control tools like Git.\nUnderstanding of CI/CD pipelines and deployment best practices.\nExperience with authentication systems like JWT, OAuth, etc.\nKnowledge of containerization (Docker) is a plus.\nAbility to work in an Agile/Scrum environment.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279452243/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nOverall Responsibilities:\n\nNode.js Developer will be responsible for developing, implementing, and maintaining scalable and high-performance applications using Node.js technologies. They will collaborate with cross-functional teams, including project managers, designers, and other developers, to ensure that deliverables meet the highest standards of quality and performance.\n\nSoftware Requirements:\n\nAt least 5 years of coding experience with Node.js, JavaScript, and databases.\nA minimum of 3 years of hands-on experience with TypeScript.\nProven expertise in performance tuning, debugging, and monitoring applications. \n\nTechnical Skills (Category-wise):\n\nBackend Development:\n\nStrong knowledge in developing scalable and highly available RESTful APIs using Node.js technologies.\nPractical experience with GraphQL. \n\nDevOps and CI/CD:\n\nWell-versed with CI/CD principles.\nActively involved in solving and troubleshooting issues in a distributed services ecosystem. \n\nContainerization and Orchestration:\n\nUnderstanding of containerization with hands-on experience in Docker and Kubernetes.\nExposure to API gateway integrations like 3Scale. \n\nSecurity and Authentication:\n\nUnderstanding of Single-Sign-On or token-based authentication (REST, JWT, OAuth). \n\nMessaging and Queue Management:\n\nExpert knowledge of task/message queues, including but not limited to AWS, Microsoft Azure, Pushpin, and Kafka. \n\nFunctional Skills:\n\nExperience in following best coding, security, unit testing, and documentation standards and practices.\nExperience in the banking, financial, and fintech sectors within an enterprise environment is preferred.\nProficiency in Agile methodology.\nEnsure the quality of technical and application architecture and design of systems across the organization.\nEffectively research and benchmark technology against other best-in-class technologies. \n\nExperience:\n\nMinimum 5 years of coding experience in Node.js, JavaScript, and databases.\nAt least 3 years of hands-on experience with TypeScript.\nHands-on experience in performance tuning, debugging, and monitoring applications. \n\nDay-to-Day Activities:\n\nDevelop and maintain scalable and high-performance applications using Node.js technologies.\nImplement RESTful APIs and integrate with GraphQL.\nParticipate in the CI/CD process and troubleshoot issues in a distributed services ecosystem.\nWork with containerization technologies such as Docker and Kubernetes.\nIntegrate with API gateways like 3Scale.\nImplement security measures such as Single-Sign-On and token-based authentication.\nManage task/message queues using AWS, Microsoft Azure, Pushpin, and Kafka.\nCollaborate with cross-functional teams to ensure project deliverables are met on time and within budget.\nStay up-to-date with the latest advancements in Node.js and related technologies. \n\nQualification:\n\nDegree or postgraduate degree in Computer Science or a related field (or equivalent industry experience). \n\nSoft Skills:\n\nAble to influence multiple teams on technical considerations, increasing their productivity and effectiveness by sharing deep knowledge and experience.\nSelf-motivator and self-starter with the ability to own and drive tasks without supervision.\nWorks collaboratively with teams across the organization.\nExcellent soft skills and interpersonal skills to interact with and present ideas to senior and executive management. \n\n\n\n\nIf interested kindly mail on Shraddha.shende@synechron.com\n\n\n\n\nS YNECHRON’S DIVERSITY & INCLUSION STATEMENT\n\nDiversity & Inclusion are fundamental to our culture, and Synechron is proud to be an equal opportunity workplace and is an affirmative action employer. Our Diversity, Equity, and Inclusion (DEI) initiative ‘Same Difference’ is committed to fostering an inclusive culture – promoting equality, diversity and an environment that is respectful to all. We strongly believe that a diverse workforce helps build stronger, successful businesses as a global company. We encourage applicants from across diverse backgrounds, race, ethnicities, religion, age, marital status, gender, sexual orientations, or disabilities to apply. We empower our global workforce by offering flexible workplace arrangements, mentoring, internal mobility, learning and development programs, and more.\n\nAll employment decisions at Synechron are based on business needs, job requirements and individual qualifications, without regard to the applicant’s gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law.\n\nCandidate Application Notice",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281304208/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\nProfitonium Apps creates AI-powered tools exclusively for Shopify, simplifying automation, enhancing SEO, and promoting growth for merchants. We are a dedicated team of developers and e-commerce experts passionate about making success easier for Shopify stores. Our flagship apps include the ChatGPT-AI Product Description Generator, ChatGPT-Blog Generator Pro, EditEngine Bulk Product Editor, Fastrr Page Speed Booster, designed to save time, drive organic traffic, and optimize store performance.\n\n\n\n\nRole Description\n\nThis is a full-time hybrid role for a Full-Stack Developer specializing in Shopify, React, and Node.js. The role is based in Bengaluru with some work from home flexibility. The developer will be responsible for designing, developing, and maintaining web applications, troubleshooting and debugging issues, and ensuring seamless integration with Shopify APIs. Additional tasks include front-end development using React, back-end development using Node.js, and collaborating with the team to implement new features and enhancements.\n\n\n\n\nQualifications\n\nFront-End Development skills including proficiency in React\nBack-End Web Development skills with experience in Node.js\nProficiency in Full-Stack Development and Software Development\nFamiliarity with Shopify APIs and the e-commerce environment\nStrong problem-solving and debugging skills\nExcellent communication and collaboration abilities\nBachelor's degree in Computer Science, Engineering, or a related field or equivalent experience\nExperience in AI-powered tools and applications is a plus\n\n\n\n\nCompensation\n\n6-12LPA",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279850143/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nDear Applicant,\n\n\n\n\nWe at Netvurq are looking for Full Stack Developers for a contractual work for 2 months and can also lead to a full time job on mutual consent.\n\n\n\n\nAbout the Company\n\nAt Netvurq, we believe in building strong, long-lasting partnerships with our clients by providing reliable, secure, and cost-effective IT solutions that empower growth and efficiency. At Netvurq, your success is our priority, and we are committed to delivering excellence every step of the way.\n\n\n\n\nAll the services offered by us are quality tested, compatible, equipped with user-friendly settings, requiring low maintenance, having reliable operations, high efficiency, and easy to operate with accurate results. We have provided new ranges of services and designs having updated technologies from time to time to enable a wider acceptance of the clients as per their varied requirements.\n\n\n\n\nQualification\n\nB.Tech. CSE, BCA, MCA, B.Sc. IT, M.Sc. IT with at least 1-2 years of experience in full stack development. Freshers will need to pass a test to qualify for paid apprenticeship.\n\n\n\n\nScope of Work\n\nWorking with end clients on end-to-end technical solutions pertaining to web design and development, and Database Management System (DBMS).\n\n\n\n\nWorking Knowledge of\n\nDBMS\n\nSQL\n\nWordpress\n\nPHP\n\nHTML\n\nCSS\n\n\n\n\nInterested candidates can email your PDF resume to careers@netvurq.com. The candidates will be contacted on Saturday and Sunday.\n\n\n\n\nRegards,\n\nHiring Team\n\nNetvurq Solutions Private Limited\n\nhttps://netvurq.com",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281532143/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nThe ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code. \n Responsibilities\n\nDevelop quality software and web applications \nAnalyze and maintain existing software applications \nDesign highly scalable, testable code \nDiscover and fix programming bugs\n\n\nQualifications\n\nBachelor's degree or equivalent experience in Computer Science or related field \nDevelopment experience with programming languages \nSQL database or relational database skills",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281602165/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nPlease read the requirements carefully before applying\n\n\n\n\nJob Title: WordPress Developer \nExperience: 2+ years\nLocation: Phase 8B, Mohali, Punjab (work from office)\nInterview Mode: Face-to-face with a machine test at our office (Mandatory)\n\n\n\n\nKey Requirements:\n\n\n\n\nWordPress Expertise: Proven experience in WordPress development.\nExcellent knowledge and experience in HTML, CSS, JavaScript, jQuery, and Bootstrap.\nExperience working on ACF (Advanced Custom Field)\n2 years of Experience in working on both frontend and backend development. \nBachelor's Degree in a relevant/similar field.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4255599475/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nAbout Us\n\nQuillBot was founded in 2017 with the mission of helping students and professionals, especially those learning English, strengthen their writing. Today, QuillBot is on a mission to make written communication better and more efficient. With over 56 million users worldwide, QuillBot empowers people to write without limits. The platform offers a suite of AI-powered tools, including paraphrasing, grammar checking, summarizing, and more to help users communicate more effectively across languages and cultures. With a dedicated team of 190 employees, QuillBot continues to innovate, enabling users to enhance their writing and express themselves with clarity and confidence. \"Write without limits\" is at the core of everything we do at QuillBot.\n\nOverview\n\nThis role is ideal for someone who is proficient in ReactJS, TypeScript, Vanilla JavaScript, and NodeJS and is eager to take ownership of development from concept to production. You'll work closely with engineers, product managers, and designers to launch impactful features in a fast-paced, learning-oriented environment.\n\nResponsibilities\n\n\nYou will be responsible for designing and developing systems and applications with agility and quality.\nEngage in continuous learning and stay updated with frontend technological advancements\nYou will be responsible for end-to-end ownership of tasks from development to production.\nYou will help with the design, implementation, and launch of many key product features.\nParticipate in a culture of code reviews and collaborate closely with other engineers, product managers, and designers.\nDrive best practices and engineering improvements.\nCreate prototypes and proofs-of-concept for iterative development.\n\n\nQualifications\n\n\nSoftware development experience of 1-4 years of working with scalable frontend/full-stack applications.\nExperience in developing stable and performant software at scale.\nGood experience in Vanilla JavaScript, TypeScript, ReactJS, DOM manipulation, HTML parsing, and NodeJS.\nHave experience in owning the quality of developed features and contribute to automation for better coverage.\nAbility to communicate effectively with employees in the company in both technical and non-technical roles.\nAggressive problem diagnosis and creative problem-solving skills.\nShould have a startup mentality and a high willingness to learn with a growth mindset.\nHands-on experience with authentication and payment systems is a plus.\n\n\nBenefits & Perks\n\n\nCompetitive salary, stock options & annual bonus\nMedical coverage\nLife and accidental insurance\nVacation & leaves of absence (menstrual, flexible, special, and more!)\nDevelopmental opportunities through education & developmental reimbursements & professional workshops\nMaternity & parental leave\nHybrid & remote model with flexible working hours\nOn-site & remote company events throughout the year\nTech & WFH stipends & new hire allowances\nEmployee referral program\nPremium access to QuillBot\nBenefits and benefit amounts differ by region. A comprehensive list applicable to your region will be provided in your interview process.\n\n\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria. We strongly encourage you to apply if you're interested: we'd love to learn how you can amplify our team with your unique experience!\n\nThis role is eligible for hire in India.\n\nWe are a virtual-first company and have employees dispersed throughout the United States, Canada, Germany, Netherlands, and India. We have a market-based pay structure that varies by location. The base pay for this position is dependent on multiple factors, including candidate experience and expertise, and may vary from the amounts listed below. You may also be eligible to participate in our bonus program and may be offered an equity award, benefits, and other types of compensation.\n\n#QuillBot\n\nEqual Employment Opportunity Statement (EEO)\n\nWe are an equal opportunity employer and value diversity and inclusion within our company. We will consider all qualified applicants without regard to race, religion, color, national origin, sex, gender identity, gender expression, sexual orientation, age, marital status, veteran status, or ability status. We will ensure that individuals who are differently abled are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment as provided to other applicants or employees. Please contact us to request accommodation.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279458396/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\nAppinventiv is a global product development and digital transformation agency dedicated to redefining mobile experiences through cutting-edge technology. With over 1500 passionate experts, we empower startups and fortune companies in transforming their ideas into reality.\n\n\n\n\nRole Description\n\n\n\n\nThis is a full-time, on-site role for a Junior Engineer located in Noida. The Junior Engineer will be responsible for supporting the development, testing, and maintenance of software applications. Day-to-day tasks include coding, debugging, assisting in the design of software solutions, collaborating with team members, and participating in project meetings. The Junior Engineer will work closely with senior engineers and project managers to ensure the successful delivery of projects.\n\n\n\n\nQualifications\n\n\n\n\nProficiency in programming languages such as Java, C++, Python\nBasic understanding of software development methodologies and principles\n1-3 years of experience\nKnowledge of database systems and SQL\nProblem-solving skills and attention to detail\nGood communication and teamwork abilities\nFamiliarity with version control systems like Git\nBachelor's degree in Computer Science, Engineering, or a related field\nPrevious internship or project experience in software development is a plus",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281490199/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nJob description\n\nAbout the Role\n\nWe are looking for a skilled and passionate Laravel Developer to join our development team. You will be responsible for developing high-quality web applications, RESTful APIs, and backend services using the Laravel framework. The ideal candidate should have a strong understanding of PHP, Laravel, and database management.\n\n\n\n\nKey Responsibilities\n\nDevelop and maintain web applications using Laravel and related technologies.\nCollaborate with front-end developers, UI/UX designers, and project managers to deliver user-friendly features.\nDesign and implement RESTful APIs and integrate third-party services (e.g., payment gateways, email services).\nCreate and manage database schemas using Eloquent ORM and Laravel migrations.\nWrite clean, secure, scalable, and testable code following Laravel standards.\nPerform unit testing, debugging, and performance optimization.\nMaintain and update existing codebases, libraries, and tools.\nUtilize Git for version control and collaborate using tools like GitHub or Bitbucket.\nEnsure application security and data protection practices.\nDocument development processes, APIs, and technical decisions.\n\n\n\n\nJob Location: Thaltej, Ahmedabad (Work from Office only) 🏢\n\nYou can drop your resume at hr@antinoob.tech\n\n\n\n\nRequirements\n\nStrong proficiency in PHP and the Laravel framework.\nExperience with MySQL or PostgreSQL.\nFamiliarity with HTML5, CSS3, JavaScript, and front-end integration.\nHands-on experience with Laravel features like Queues, Events, Jobs, Middleware, Service Providers, and Artisan commands.\nExperience with RESTful API development and integration.\nFamiliarity with Git and CI/CD processes.\nGood problem-solving and communication skills.\nAbility to work independently and as part of a team.\n\n\n\n\nPreferred Qualifications \n\nExperience with Vue.js, React, or Livewire.\nKnowledge of Docker, Composer, and Laravel Forge, Telescope, or Horizon.\nFamiliarity with cloud platforms like AWS or DigitalOcean.\nPrevious experience working in Agile/Scrum environments.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279453586/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\nAppinventiv is a leading global product development and digital transformation agency that empowers startups and Fortune companies through new-age technology. With a team of over 1500+ mobile experts, we craft innovative solutions and deliver unparalleled results, breaking all growth records. \n\n\n\n\nRole Description\n\nAssist in the development and maintenance of software applications\nWrite clean, scalable, and efficient code\nCollaborate with cross-functional teams to define and implement new features\nTroubleshoot, debug, and upgrade existing software\nContribute to software testing and quality assurance processes\nParticipate in code reviews and maintain coding best practices\nLearn and grow in new technologies and methodologies\n\n\n\n\nQualifications\n\nBachelor’s degree in Computer Science, Engineering, or related field\n2-5 years of experience\nProficiency in one or more programming languages such as Java, Python, C++, or JavaScript\nBasic understanding of software development principles and methodologies (Agile, Scrum, etc.)\nFamiliarity with databases (SQL or NoSQL) and web development frameworks is a plus\nStrong problem-solving skills and a passion for coding",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281537037/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nRole Overview\n\n\n\n\nWe’re seeking a backend-focused Software Engineer with a strong foundation in Backend development and a passion for building scalable, secure systems. You’ll play a core role in scaling our threat intelligence platform and integrating with real-time data pipelines and global feeds.\n\n\n\n\nWhat You’ll Do\n\n\n\n\nBuild and maintain performant backend service\nDesign and implement scalable APIs and microservices (REST/gRPC)\nCollaborate with threat intelligence and data teams for system integrations\nWrite clean, testable code and conduct peer reviews\nMonitor backend performance and debug production issues\nContribute to CI/CD pipelines and DevOps best practices\nStay updated with evolving AI, cybersecurity, and backend tech trend\n\n\n\n\nWhat We’re Looking For\n\n\n\n\n1+ years of experience in backend development (startup experience is a plus)\nProficiency in a backend framework such as Python, TypeScript, or Golang—Golang experience preferred\nFamiliarity with MongoDB, DynamoDB, or other NoSQL databases\nSolid grasp of Git workflows and modern development practices\nAwareness of software security principles\nA strong interest in exploring emerging tools like vector DBs and agent frameworks, and in conducting POCs.\nEnd-to-end ownership of your work and deliverables.\n\n\n\n\nWhy Join Us?\n\n\n\n\nBe part of a fast-growing cybersecurity company solving global challenges\nWork in a flat hierarchy with high ownership and creative freedom\nCollaborate with global threat researchers and security analysts\nGet hands-on exposure to the evolving cyber threat landscape\nFocus on continuous learning and innovation",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4274609338/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\n🚀 We’re Hiring: Storyline Developer – Pune (On-Site)\n\n\n\n\nJoin Ceryx Digital – Where Creativity Meets Learning\n\n\n\n\nAre you passionate about creating interactive learning experiences? Ceryx Digital, a fast-growing e-learning solutions company, is looking for a Storyline Developer with at least 1 year of hands-on experience to join our Pune team on-site.\n\n\n\n\n🎯 Position: Storyline Developer\n\n📍 Location: Pune (Work from Office)\n\n🕒 Experience: 1 year\n\n💼 Employment Type: Full-time\n\n\n\n\nWhat You’ll Do\n\n✔ Develop engaging and responsive L1, L2, and L3 e-learning modules using Articulate Storyline\n\n✔ Work closely with instructional designers and graphic teams to build interactive learning solutions\n\n✔ Ensure functionality, visual consistency, and SCORM compliance across deliverables\n\n✔ Troubleshoot and optimize course performance as needed\n\nWhat We’re Looking For\n\n🔹 Proven expertise in Articulate Storyline\n\n🔹 Experience developing e-learning courses of varying complexity (L1 to L3)\n\n🔹 Basic knowledge of Adobe Illustrator is a bonus\n\n🔹 Strong attention to detail and a proactive approach\n\n🔹 Ability to work collaboratively in a deadline-driven environment\n\n\n\n\n📩 To Apply\n\nSend your resume to faruk.m@ceryxdigital.com.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281536908/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n \n\npiHappiness offers a customer feedback management system available on iPad and Android tablets. Known for its real-time feedback reports and survey analytics, piHappiness allows businesses to create customized feedback forms and collect feedback either in-person or through survey kiosks. The system provides insightful reports and a response inbox to analyze and take actions on customer feedback, helping businesses improve customer experiences swiftly and effectively.\n\n\n Role Description\n \n\nThis is a full-time, on-site role located in Hyderabad for a Full Stack Engineer. Day-to-day tasks include development and maintenance of both front-end and back-end systems, participating in the full software development lifecycle, and implementing responsive CSS designs. The Full Stack Engineer will collaborate with cross-functional teams to deliver high-quality software solutions, troubleshoot and debug applications, and ensure software is scalable and secure.\n\n\n Qualifications\n \nExperience in Back-End Web Development, and Full-Stack Development\nProficiency in Front-End Development and Cascading Style Sheets (CSS)\nGeneral Software Development skills\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a team environment\nBachelor's degree in Computer Science, Engineering, or a related field is preferred\nExperience in customer feedback systems is a plus",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279859433/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nRole: Angular Developer\n\n\n\n\nExperience: 3–5 Years\n\nBudget: 14 LPA\n\nNotice Period: Immediate to 15 Days\n\nLocation: Bangalore ( WFO - 5 Days )\n\nQualifications: B.E/B.Tech only\n\n\n\n\nInterview Process-\n\nL1- Technical Assessment (ATS)\n\nL2-Technical Discussion with Panel \n\nL3- Hackerrank Test \n\n\n\n\nTechnical Skills Must Have - Strong hands-on experience with Angular v-14+ , Angular Material, Data Structure, jasmine, karma , bootstrap, Angular signals, Rxjs and ngrx\n\n\n\n\n🔹 Key Responsibilities:\n\nDevelop dynamic, responsive web applications using Angular\nCollaborate with backend developers, UI/UX designers, and other team members\nWrite clean, maintainable, and testable code\nImplement responsive designs and ensure cross-browser compatibility.\n\n\n\n\n🔹 Required Skills:\n\nProficiency in Angular (version 14+), Data Structures, TypeScript, JavaScript, HTML5, and CSS3\nExperience with RxJS, Angular CLI, NgRx (or similar state management libraries)\nStrong understanding of RESTful APIs and integration with Angular apps\nExperience with Git and testing frameworks like Jasmine/Karma",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281529030/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nJob Role: .NET Developer\n\n \n\nLocation: Bangalore/Mangalore Type: Full-Time \n\nWhat This Role Requires \n\nIn the role of .NET Developer, you will be a key contributor to the organization’s mission of empowering our clients with data-driven insights and innovative digital solutions. Each day brings exciting challenges and growth opportunities. Here is what you will do: \n\n \n\n• Design, develop, and maintain scalable applications using .NET Core / .NET Framework. \n\n• Build and optimize complex SQL Server queries, stored procedures, views, and functions. \n\n• Develop and manage SSIS packages and SQL jobs for ETL processes. \n\n• Deploy, monitor, and maintain applications on Azure App Services. \n\n• Integrate and manage messaging solutions using Azure Service Bus. \n\n• Design and implement data workflows using Azure Data Factory. \n\n• Create and consume RESTful Web APIs for internal and external integration. \n\n• Collaborate with front-end developers to integrate server-side logic with client-side functionality. \n\n• Participate in code reviews, sprint planning, and design discussions. Troubleshoot and resolve application issues in production and development environments. \n\n \n\n Key Skills to Succeed in This Role: \n\n \n\n• Bachelor’s degree in computer science, Engineering, or a related field. \n\n• Experience with CI/CD tools and DevOps pipelines (Azure DevOps is a plus). \n\n• Familiarity with microservices architecture and cloud-native design patterns. \n\n• Strong understanding of software development best practices and design principles. \n\n• Excellent verbal and written communication skills. \n\n• Ability to work independently and as part of a team in an Agile environment. \n\n\n\n\nIf you have relevant experience and are exploring new opportunities, share your profiles with teams@brihatisglobal.com",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281396745/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nwww.linkedin.com/company/autogenx-ai\n\n\n\n\nCompany Description\n\nAUTOGENX.AI is an AI consulting and integration firm focusing on agentic automation and digital labor for modern enterprises. We design custom AI systems tailored to industry workflows, compliance, and commercial outcomes. Our solutions are modular, composable, and seamlessly integrate with existing systems to enable intelligent decision-making and autonomous execution. Our expertise spans the full breadth of business operations, addressing the specific needs of each industry we serve. We engineer business advantage through AI.\n\n\n\n\nRole Description\n\nThis is a full-time remote role for an AI Automation Developer. The AI Automation Developer will be responsible for designing and developing automation solutions, implementing AI systems, ensuring high-quality software development, programming, and maintaining quality assurance standards. The role requires close collaboration with cross-functional teams to deliver customized AI solutions that drive business efficiency and performance.\n\n\n\n\nQualifications\n\nExperience in Process Automation and Automation\nProficiency in Software Development and Programming\nQuality Assurance skills\nStrong analytical and problem-solving abilities\nExcellent communication and teamwork skills\nAbility to work independently and remotely\nExperience in AI and machine learning is a plus",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281392074/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nrequirement:\n\n\n\n\nhas built and shipped atleast one fully functional swift app to the app store\n\n\n\n\nbonus:\n\n\n\n\nyou use coding agents to help you build faster\n\n\n\n\nyou use superwall for revenue gating\n\n\n\n\nyou use mixpanel for analytics\n\n\n\n\nyou've implemented some sort of agentic workflow and are familiar with how agentic loops work",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279835166/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n \nAffy Cloud Solution assists companies in leveraging technology to unlock real value. We offer a range of services including software development for web, mobile, and APIs, AI solutions, and cloud integration & IT consulting. We are also experienced in SAP SuccessFactors implementation and support to meet contemporary HR needs. Our goal is to provide high-powered, AI-enabled tools and smooth web/mobile applications.\n\n Role Description\n \nThis is a full-time remote role for an ODOO Developer. Odoo Developer - Job Description\nWe are seeking a skilled and passionate Odoo Developer to join our team. You will be responsible for designing, developing, customizing, and implementing Odoo modules to meet diverse business requirements, optimizing processes, and enhancing overall system efficiency.\nResponsibilities:\n * Develop and customize Odoo modules (new features, existing module enhancements).\n * Integrate Odoo with third-party applications and systems via APIs.\n * Design and optimize Odoo databases using PostgreSQL.\n * Troubleshoot, debug, and resolve technical issues within the Odoo environment.\n * Create and maintain technical documentation.\n * Collaborate with business analysts and other developers to deliver high-quality solutions.\n * Stay updated with the latest Odoo versions and best practices.\nRequired Skills:\n * Strong Python: Excellent grasp of Python programming, including OOP.\n * Odoo Framework: In-depth understanding of Odoo's architecture, ORM, models, views, and controllers.\n * PostgreSQL: Proficient in database design, SQL querying, and optimization.\n * Web Technologies: Solid skills in HTML, CSS, JavaScript, and XML (especially QWeb).\n * Version Control: Experience with Git for collaborative development.\n * Problem-Solving: Strong analytical and troubleshooting abilities.\n * Communication: Effective verbal and written communication skills.\nBonus Points:\n * Experience with Odoo migrations/upgrades.\n * Knowledge of Odoo UI JS framework or OWL.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281383845/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nWe are seeking a passionate and versatile Full Stack Developer with strong experience in Node.js, Next.js, and Three.js to join our growing tech team. You’ll be working on cutting-edge web applications, real-time 3D visualizations, and back-end systems that power next-generation STEM, AI, and robotics learning experiences.\n\n\n\n\nAs part of an innovative team in the EdTech and IoT space, you’ll contribute to projects that blend software development, 3D interactive UI, and hardware integration (Arduino and microcontrollers). Experience in Python and AI/ML programming is a strong plus and will give you an edge in building intelligent, adaptive systems for smart education platforms.\n\n\n\n\n⸻\n\n\n\n\nWhat You’ll Do\n\n • Build and maintain scalable full-stack applications using Next.js and Node.js\n\n • Design 3D visualizations and interactive elements using Three.js\n\n • Develop and integrate RESTful APIs and database solutions\n\n • Collaborate with UI/UX teams, hardware developers, and product managers\n\n • Contribute to IoT features by integrating Arduino-based systems or microcontrollers\n\n • (Optional) Use Python and AI libraries to implement smart learning features and automation\n\n\n\n\n⸻\n\n\n\n\nWho You Are\n\n • You have 2–5 years of experience in full-stack development\n\n • You write clean, modular code in JavaScript/TypeScript\n\n • You have hands-on experience with Next.js (SSR, routing, API handling)\n\n • You’re skilled in Node.js, Express or similar back-end frameworks\n\n • You’ve built or worked on 3D projects with Three.js/WebGL\n\n • You’re familiar with modern front-end tools, Git, and cloud platforms (like Vercel, AWS)\n\n • You’re curious about hardware or have tinkered with Arduino, Raspberry Pi, etc.\n\n • (Bonus) You’ve worked with Python, AI/ML, or computer vision libraries\n\n\n\n\n⸻\n\n\n\n\nWhy Join Us?\n\n • Work on real-world, impactful STEM + AI/IoT products\n\n • Collaborate with a cross-disciplinary team of tech and education experts\n\n • Opportunity to shape the future of learning through innovation\n\n • Flexible environment with room for creativity and growth\n\n\n\n\n⸻\n\n\n\n\nThis role is ideal for developers who love building interactive, intelligent systems that connect the digital and physical worlds.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281351322/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nWe're seeking a passionate frontend engineer to join our fast-paced startup. You'll play a key role in creating intuitive, performant, and visually appealing dashboards for our SaaS product. You will be responsible for the day-to-day tasks associated with frontend development. This includes designing and implementing user interfaces, collaborating with the design team to ensure a seamless user experience, and optimizing website performance.\n\nResponsibilities\n\n\n Develop complex user interfaces using modern JavaScript frameworks like Next.js, SvelteKit, Nuxt.js, or Remix.\n Translate design mockups into functional, responsive web applications.\n Collaborate with backend engineers to integrate frontend components with APIs and data sources.\n Optimize frontend code for performance, scalability, and maintainability.\n Implement real-time data visualizations and interactive elements.\n Adopt test-driven development (TDD) practices and write unit tests.\n\n\nIdeal Candidate\n\n\n 2+ years of experience building web applications in a product-based company.\n Proficiency with HTML, CSS, and JavaScript.\n Strong experience with at least one modern frontend framework (Next.js, SvelteKit, Nuxt.js, Remix, etc.).\n Understanding of web accessibility principles and cross-browser compatibility.\n A knack for building user-centric, intuitive interfaces.\n Bachelor's degree in Computer Science or related field preferred, but not required.\n\n\nBonus\n\n\n Experience with TypeScript.\n Experience building cross-platform mobile apps with React Native or Flutter.\n Credible open-source contributions.\n\n\nSkills: User Interface Programming,Next.js,Svelte,Nuxt.js,Design,HTML/CSS,test-driven development,JavaScript,Frontend Development,TypeScript",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281653407/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nAbout Kagool \n\nWe are a fast-growing IT consultancy specialising in the transformation of complex Global enterprises. We are looking for several project managers to help deliver for our global customer base. We embrace the opportunities of the future and work proactively to make good use of technology. As you can imagine, this means that we have a vibrant and diverse mix of skills and people making Kagool a great place to work. \n\n \n\nYour place in the team  \n\nWe are looking at expanding Kagool Application Management Service portfolio supporting Azure Data Analytics platform. As a Support consultant your responsibilities would involve the daily management of incidents, operational maintenance and support, development support, and proactive/preventative analysis of systems. \n\n \n\nResponsibilities  \n\nResponsible for analysing the Data & Analytics related incident and provide the fix \nRe-creation, analysis, troubleshooting, and diagnosis of incidents relating to off-the-shelf and proprietary applications and/or platforms. \nDetermination of root cause of incidents (configuration vs. defect) \nLiaison with appropriate teams for the development of corrective actions or viable workarounds to resolve incidents \nInstallation of applications in supported environments. \nDeployment of application upgrades and fixes \nResponding to automated alerts on the health of systems \nExecuting scheduled or unscheduled tasks relating to operational maintenance and monitoring of applications \nPerforming routine audits of systems for the purpose of preventative maintenance of applications and reporting on their status \n\n\n\n\nQualifications  \n\nBachelor’s degree in Computer Science, Engineering or other related subject \n\n \n\nEssential Experience \n\nExperience in Data & Analytics support/project using Azure and BI reporting tools \nExperience in following technical area \nAzure Cloud \nData Lake \nDatabricks \nData Factory \nLogic Apps \nAzure SQL Database \nSQL, PL/SQL, TSQL \nPython, PySpark \nAbility to read and understand code (Code-competency) for diagnosis, escalation to tier 4 teams \nKnowledge of troubleshooting tools and techniques related to networks and systems i.e. remote access tools, Windows Support tools, connectivity tests, etc. \nExcellent communication skills \nGood analytical and problem-solving skills \nAbility to organise and prioritise in a demanding environment \nExcellent attention to detail \nGood team working skills and also able to work individually \n\n \n\nPreferred Experience \n\nSAP or any other ERP understanding or experience \nExperience in ETL Tools, Databases, Warehouse, Programming languages, Transport Protocol and code management \n\n \n\nCareer at Kagool \n\nA career at Kagool will give you a path towards progression and opportunities, with the current rate of growth we at Kagool have dedicated time towards individual growth, recognizing individual contributions, filling the team with a strong sense of purpose along with providing a fun, flexible and friendly work environment.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281344516/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nLocation: In-Person (sftwtrs.ai Lab)\n\nExperience Level: Early Career / 1–3 years\n\nAbout sftwtrs.ai\n\nsftwtrs.ai is a leading AI lab focused on security automation, adversarial machine learning, and scalable AI-driven solutions for enterprise clients. Under the guidance of our Principal Scientist, we combine cutting-edge research with production-grade development to deliver next-generation AI products in cybersecurity and related domains.\n\nRole Overview\n\nAs a Research Engineer I, you will work closely with our Principal Scientist and Senior Research Engineers to ideate, prototype, and implement AI/ML models and pipelines. This role bridges research and software development: you’ll both explore novel algorithms (especially in adversarial ML and security automation) and translate successful prototypes into robust, maintainable code. This position is ideal for someone who is passionate about pushing the boundaries of AI research while also possessing strong software engineering skills.\n\nKey Responsibilities\nResearch & Prototyping\nDive into state-of-the-art AI/ML literature (particularly adversarial methods, anomaly detection, and automation in security contexts).\nRapidly prototype novel model architectures, training schemes, and evaluation pipelines.\nDesign experiments, run benchmarks, and analyze results to validate research hypotheses.\nSoftware Development & Integration\nCollaborate with DevOps and MLOps teams to containerize research prototypes (e.g., Docker, Kubernetes).\nDevelop and maintain production-quality codebases in Python (TensorFlow, PyTorch, scikit-learn, etc.).\nImplement data pipelines for training and inference: data ingestion, preprocessing, feature extraction, and serving.\nCollaboration & Documentation\nWork closely with Principal Scientist and cross-functional stakeholders (DevOps, Security Analysts, QA) to align on research objectives and engineering requirements.\nAuthor clear, concise documentation: experiment summaries, model design notes, code review comments, and API specifications.\nParticipate in regular code reviews, design discussions, and sprint planning sessions.\nModel Deployment & Monitoring\nAssist in deploying models to staging or production environments; integrate with internal tooling (e.g., MLflow, Kubeflow, or custom MLOps stack).\nImplement automated model-monitoring scripts to track performance drift, data quality, and security compliance metrics.\nTroubleshoot deployment issues, optimize inference pipelines for latency and throughput.\nContinuous Learning & Contribution\nStay current with AI/ML trends—present findings to the team and propose opportunities for new research directions.\nContribute to open-source libraries or internal frameworks as needed (e.g., adding new modules to our adversarial-ML toolkit).\nMentor interns or junior engineers on machine learning best practices and coding standards.\nQualifications\nEducation:\nBachelor’s or Master’s degree in Computer Science, Electrical Engineering, Data Science, or a closely related field.\nResearch Experience:\n1–3 years of hands-on experience in AI/ML research or equivalent internships.\nFamiliarity with adversarial machine learning concepts (evasion attacks, poisoning attacks, adversarial training).\nExposure to security-related ML tasks (e.g., anomaly detection in logs, malware classification using neural networks) is a strong plus.\nDevelopment Skills:\nProficient in Python, with solid experience using at least one major deep-learning framework (TensorFlow 2.x, PyTorch).\nDemonstrated ability to write clean, modular, and well-documented code (PEP 8 compliant).\nExperience building data pipelines (using pandas, Apache Beam, or equivalent) and integrating with RESTful APIs.\nSoftware Engineering Practices:\nFamiliarity with version control (Git), CI/CD pipelines, and containerization (Docker).\nComfortable writing unit tests (pytest or unittest) and conducting code reviews.\nUnderstanding of cloud services (AWS, GCP, or Azure) for training and serving models.\nAnalytical & Collaborative Skills:\nStrong problem-solving mindset, attention to detail, and ability to work under tight deadlines.\nExcellent written and verbal communication skills; able to present technical concepts clearly to both research and engineering audiences.\nDemonstrated ability to collaborate effectively in a small, agile team.\nPreferred Skills (Not Mandatory)\nExperience with MLOps tools (MLflow, Kubeflow, or TensorFlow Extended).\nHands-on knowledge of graph databases (e.g., JanusGraph, Neo4j) or NLP techniques (transformer models, embeddings).\nFamiliarity with security compliance standards (HIPAA, GDPR) and secure software development practices.\nExposure to Rust or Go for high-performance inference code.\nContributions to open-source AI or security automation projects.\nWhy Join Us?\nCutting-Edge Research & Production Impact: Work on adversarial ML and security–automation projects that go from concept to real-world deployment.\nHands-On Mentorship: Collaborate directly with our Principal Scientist and Senior Engineers, learning best practices in both research methodology and production engineering.\nInnovative Environment: Join a lean, highly specialized team where your contributions are immediately visible and valued.\nProfessional Growth: Access to conferences, lab resources, and continuous learning opportunities in AI, cybersecurity, and software development.\nCompetitive Compensation & Benefits: Attractive salary, health insurance, and opportunities for performance-based bonuses.\n\nHow to Apply\n\nPlease send a résumé/CV, a brief cover letter outlining relevant AI/ML projects, and any GitHub or portfolio links to careers@sftwtrs.ai with the subject line “RE: Research Engineer I Application.”\n\nsftwtrs.ai is an equal-opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279806085/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nXedok is a dynamic and innovative software company specializing in cutting-edge solutions tailored to meet business needs. Our expert team excels in software development, web design, and SEO services. We are passionate about technology and committed to empowering businesses with the tools necessary for thriving in the digital age. Join us in our journey of innovation and transformation.\n\n Role Description\n \nThis is a full-time on-site role for a Laravel Developer located in Patna. The Laravel Developer will be responsible for developing and maintaining back-end web applications, implementing object-oriented programming, and ensuring seamless integration with front-end components. Daily tasks include writing clean and efficient code, troubleshooting applications, and collaborating with cross-functional teams to deliver high-quality software solutions.\n\n Qualifications\n \nExperience in Back-End Web Development and Object-Oriented Programming (OOP)\nProficiency in Front-End Development\nStrong skills in Software Development and Programming\nExcellent problem-solving and analytical abilities\nAbility to work collaboratively in a team environment\nBachelor's degree in Computer Science, Software Engineering, or a related field\nExperience with Laravel or other PHP frameworks is a plus",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281344220/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\nTussle Digital is a leading digital marketing agency based in Sydney, Australia, offering a wide range of digital marketing services including web design, content creation, and graphics. We assist clients with Google Ads, Bing Ads, and Social Media Marketing across various platforms. Our team is proficient in handling eCommerce solutions such as Shopify, Magento, and WooCommerce. We are dedicated to transparency, persistence, mutual trust, and integrity with our clients. \n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Java & ReactJS Developer located in Gurugram. The Java & ReactJS Developer will be responsible for both front-end and back-end web development tasks, including developing and maintaining software applications. Daily tasks involve writing and testing code, debugging programs, and integrating applications with existing systems. The developer will be expected to collaborate with other team members and contribute to enhancing the user experience.\n\n\n\n\nQualifications\n\nFront-End Development skills: ReactJS, JavaScript, Redux.js\nBack-End Web Development skills: Java, Software Development\nExperience with integrating and working with various APIs\nStrong problem-solving and debugging skills\nExcellent communication and teamwork abilities\nBachelor's degree in Computer Science, Engineering, or related field\nExperience in digital marketing or eCommerce platforms is a plus",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279496979/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\nWe suggest you enter details here.\n\n\n\n\nRole Description\n\nThis is a full-time, on-site role for an AI MLOps FastAPI Engineer located in Gurugram. The AI MLOps FastAPI Engineer will be responsible for developing and maintaining API services using FastAPI, implementing MLOps practices, managing machine learning models in production, and ensuring the scalability and stability of the AI solutions. The Engineer will also collaborate with data scientists, software engineers, and stakeholders to streamline the deployment process and optimize model performance. Key tasks include deploying models, monitoring, logging, and automating workflows to improve the efficiency and reliability of AI systems.\n\n\n\n\nQualifications\n\nProficiency in FastAPI, RESTful API development\nExperience with MLOps practices, including CI/CD pipelines, containerization, and orchestration tools like Docker and Kubernetes\nStrong understanding of machine learning frameworks and libraries such as TensorFlow, PyTorch, or scikit-learn\nFamiliarity with cloud platforms like AWS, Azure, or GCP\nExcellent problem-solving skills and the ability to troubleshoot issues in production environments\nStrong communication skills and the ability to work collaboratively in a team environment\nBachelor's or Master’s degree in Computer Science, Engineering, or a related field\nPrior experience in the AI or Eucation in AI is a plus\nWillingness to learn and adapt to new technologies and methodologies",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281610037/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nCompany Description\n\niedeo specializes in providing full-stack digital solutions, focusing on app, web, and AI technologies. Our customized services and innovative products are designed to transform business operations. Flagship products like iDoExam, an AI-powered exam platform, and SnapMyMoment, an event management solution, empower organizations to achieve digital transformation and excel in a competitive market. Our mission is to deliver advanced technology solutions that enable businesses to enhance efficiency and drive growth.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Server Developer located in Chennai. The Server Developer will handle day-to-day tasks including server-side application logic, integration of front-end functionalities, database management, and ensuring the performance, stability, and security of server applications. Duties also encompass collaborating with front-end developers, optimizing server performance, and participating in all phases of the development lifecycle.\n\n\n\n\nNote\n\nThis is 3 months internship\nThere is no stipend for this internship\nAfter 3 months we'll hire you based upon your performance\n\n\n\n\nQualifications\n\nProficiency in server-side programming languages such as Node.js, PHP, Python, or Java\nExperience in database management with SQL and NoSQL databases\nFamiliarity with server architecture and RESTful API design\nSkills in performance optimization and tuning of server applications\nStrong problem-solving skills and attention to detail\nExcellent teamwork and communication skills\nExperience in cloud services like AWS or Azure is a plus\nBachelor's degree in Computer Science, Engineering, or related field",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4280847585/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nEvolutyz Corp is Hiring a GenAI Engineer (0-2 YOE)\n\n \n\nEvolutyz Corp is on a mission to turn cutting-edge language models into products that matter—from conversational analytics to multi agent systems to building Vertical Saas applications. We'd love to meet you if you can spin up an LLM, wrangle a RAG pipeline, build AI agents and still argue about UI state management.\n\n \n\nWhat You’ll Build 🚀\n\nDesign Python-first micro-services that fuse LangChain workflows, OpenAI/Anthropic models, and vector search to ship delightful GenAI features.\nOwn a slice of the front end: craft fast, responsive React/Next.js screens, wire them to your APIs with TanStack Query, and sprinkle Tailwind, Framer Motion, and Zod validation magic.\nPrototype multi-agent flows (think planner-executor patterns) and measure them with real user telemetry.\nPush code to production on AWS/Azure through container-first pipelines; automate tests, monitor metrics, and iterate like a true DevOps believer.\nPair with senior engineers, PMs, and designers—shipping value is a team sport here.\n\n\n\n\nMust-Have Superpowers 🛠️\n\nYou’ve built something from scratch—a side project, hackathon winner, or startup MVP (no YouTube-clone portfolios, please).\nFluency in Python (functions, OOP, decorators, async IO) and RESTful API design with FastAPI.\nWorking knowledge of LLMs, vector stores, RAG concepts, and prompt-craft fundamentals.\nComfort with MySQL/PostgreSQL CRUD, joins, and SQLAlchemy ORM patterns.\nGit, Docker, and a bias for automated testing / CI pipelines.\n\n\n\n\nGreat-to-Have Extras 🎁\n\nNode.js chops for high-throughput utilities.\nExperience with Next.js, TypeScript, and modern React state libraries.\nPrior dabbling in multi-agent frameworks, autonomous AI systems, or open-source model fine-tuning.\nContributions to OSS or technical blogging around GenAI.\n\n\n\n\nWhy Evolutyz? 🌈\n\nAmazing pay & benefits—competitive stipend, free lunch, and generous learning credits.\nOn-site in our Vizag HQ: hack nights, coffee roulette, spontaneous karaoke after shipping a sprint goal.\nDirect access to founders and senior architects; your idea can ship the same week.\nA culture that rewards curiosity, rapid experimentation, and responsible AI practices.\n\n\n\n\nHiring Journey 🔍\n\nLet’s Talk – 30-min “get-to-know” chat (bring your best project story).\nTake-Home Build – a weekend micro-challenge to flex your GenAI muscles.\nLive Coding & Deep Dive – pair-programming + architecture discussion.\nManager & Culture Round – vision fit, growth path, and karaoke score (kidding… sort of).\n\nReady to build GenAI products that see daylight?\n\n\n\n\nApply now with your best repo, demo link, or portfolio. If you’ve got the skills, the degree is optional; passion isn’t.\n\n \n\nSend your resume to \"resumes@evolutyz.com\"",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281498422/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nKey Responsibilities: \n\n • Develop, maintain, and improve CAD features and plugins.\n\n • Work with Intellicad SDK to integrate and extend functionality.\n\n • Write clean, maintainable, and efficient code in C# and C++.\n\n • Diagnose and fix bugs, performance bottlenecks, and UI/UX inconsistencies.\n\n • Collaborate with other team members remotely and provide progress updates.\n\n • Read and interpret technical specifications and implement features.\n\n \n\nRequired Skills and Qualifications: \n\n Education: Bachelor’s degree in any engineering discipline or a related field.\n\n Skills: Strong experience in C# and C++, Experience working with Intellicad SDK or AutoCAD \n\n development (Auto LISP), Understanding of CAD systems, geometry processing, and graphical \n\n UI design.\n\n\n\n\nSoft Skills: \n\nAbility to work independently and manage your own time and tasks, Good communication skills in English.\n\n\n\n\nPreferred Skills: \n\n • Experience in Intellicad-based solutions.\n\n • Familiarity with Visual Studio and Git.\n\n • Knowledge of Windows Desktop Application Development.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Generative AI Engineer",
    "job_id": "4281496226",
    "company_name": "Not mentioned in description, looking for Azure OpenAI experience",
    "location": "India",
    "experience": "3-5 years",
    "salary": null,
    "key_skills": [
      "Generative AI",
      "LLM",
      "GPT",
      "Llama 2",
      "Claude",
      "Azure OpenAI",
      "Azure Functions",
      "Azure Data Factory",
      "Cosmos DB",
      "AKS",
      "Python",
      "TypeScript",
      "LangChain",
      "AutoGen"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281496226/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout The Opportunity\n\nWe are a high-growth enterprise AI platform provider in the cloud services & SaaS sector, modernizing data pipelines and automating knowledge work for Fortune 500 clients. Our hybrid teams in Pune and Mumbai build production-grade generative AI solutions on Microsoft Azure—enabling real-time insights, intelligent agents, and scalable RAG applications with robust security and responsible-AI guardrails.\n\nRole & Responsibilities\n\n\nArchitect, prototype, and deploy GenAI applications (LLMs, RAG, multimodal) on Azure OpenAI, Cognitive Search, and Kubernetes-based microservices.\nBuild and orchestrate agentic frameworks (LangChain, AutoGen) for multi-agent reasoning, tool-calling, and end-to-end workflow automation.\nEngineer low-latency, high-throughput data and prompt pipelines using Azure Data Factory, Event Hub, and Cosmos DB.\nOptimize model performance and cost via fine-tuning, quantization, scalable caching on Azure ML and AKS.\nImplement production-grade CI/CD, observability (App Insights, Prometheus), security, and responsible-AI guardrails.\nCollaborate cross-functionally with product, design, and customer success teams to deliver measurable business impact.\n\n\nSkills & Qualifications\n\nMust-Have\n\n\n3-5 years hands-on Generative AI/LLM engineering (GPT, Llama 2, Claude) with at least one solution in production.\nProficiency with Microsoft Azure services: Azure OpenAI, Functions, Data Factory, Cosmos DB, AKS.\nStrong Python & TypeScript skills with experience in agentic frameworks (LangChain, AutoGen, Semantic Kernel) and REST/GraphQL APIs.\nSolid foundation in cloud MLOps: Docker, Helm, Terraform/Bicep, GitHub Actions or Azure DevOps.\nProven ability to optimize end-to-end GenAI pipelines for performance, cost efficiency, and reliability.\n\n\nPreferred\n\n\nExperience scaling GenAI pipelines to >10 K QPS using vector databases (Pinecone, Qdrant) and distributed caching.\nFamiliarity with prompt engineering, fine-tuning methodologies, and retrieval-augmented generation best practices.\nKnowledge of Kubernetes operators, Dapr, and service mesh patterns for resilient microservices.\n\n\nBenefits & Culture Highlights\n\n\nCompetitive salary and flexible hybrid work model in Pune and Mumbai offices.\nRapid career growth within a pioneering AI leadership team.\nCollaborative, innovation-driven culture emphasizing ethical and responsible AI.\n\n\nSkills: Generative AI,Azure,Python,LLMs,SQL Azure,agentic framework,Langgraph,autogen,CI,Cd,Kubernetes,Microsoft Azure,Cloud",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Engineer Intern",
    "job_id": "4279455451",
    "company_name": "Appinventiv",
    "location": "India",
    "experience": "0-1 years",
    "salary": null,
    "key_skills": [
      "Java",
      "Python",
      "JavaScript",
      "HTML",
      "CSS",
      "React",
      "iOS",
      "Android",
      "DevOps"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279455451/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nAppinventiv is a leading global product development and digital transformation agency that bridges the gap between ideas and reality through innovative technology. With a team of over 1500 mobile experts, we design and develop cutting-edge solutions for disruptive startups and Fortune companies\n\n\n\n\nJob Description\n\n\n\n\nThis is a full-time on-site role for an Engineer Intern located in Noida. The Engineer Intern will assist with the design, development, and testing of mobile and web applications. Daily tasks include writing and debugging code, conducting research, and collaborating with senior engineers to understand project requirements and deliver solutions. The intern will also participate in brainstorming sessions and contribute to the continuous improvement of processes and technology.\n\n\n\n\nQualifications\n\nProficiency in programming languages such as Java, Python, or JavaScript\nBasic understanding of software development principles and methodologies\n0-1 years of experience\nExperience with mobile application development (iOS/Android) and web technologies (HTML, CSS, React)\nFamiliarity with cloud services and DevOps practices\nGood problem-solving skills and a proactive approach to learning\nExcellent teamwork and communication skills\nCurrently pursuing a degree in Computer Science, Engineering, or a related field\nPrevious internship or project experience in a tech environment is a plus",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Intern",
    "job_id": "4277512039",
    "company_name": "ELITEFUSION TECHNOLOGIES LLP",
    "location": "India",
    "experience": "Final-year or recently graduated students",
    "salary": null,
    "key_skills": [
      "Python",
      "OpenCV",
      "Raspberry Pi",
      "Arduino",
      "ESP",
      "CAD"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4277512039/",
    "posted_at": null,
    "job_description": "About the job\n\n*Internship Opportunities at ELITEFUSION*\n\n\n\n\nWe’re inviting applications for two internship roles as we move into the next phase of our prototype development at ELITEFUSION TECHNOLOGIES LLP.\n\n\n\n\nIf you're passionate about building things that work and enjoy learning through hands-on experience, this might be the right opportunity for you.\n\n\n\n\n\n\n\n🔧 Role 1: Intern – Smart Systems (AI + Sensors)\n\n\n\n\nYou'll work with hardware like Raspberry Pi, cameras, and sensors, helping us bring intelligence to our devices.\n\n\n\n\nSkills we're looking for:\n\n\n\n\n1. Python, OpenCV basics\n\n2. Sensor interfacing\n\n3. Interest in small-scale AI deployment\n\n\n\n\n\n\n\n⚙️ Role 2: Intern – Control & Mechanism Design\n\n\n\n\nThis role focuses on the design and control side — motors, microcontrollers, and how everything moves together.\n\n\n\n\nSkills we're looking for:\n\n\n\n\n1. Arduino/ESP-based development\n\n2. Basic motor control\n\n3. Comfortable with CAD tools (or similar)\n\n\n\n\nEligibility:\n\n– Final-year or recently graduated students from ECE, EEE, Mechatronics, or Robotics\n\n– Must be available for hands-on work (lab / field-based)\n\n\n\n\n📍 Work Style: Onsite\n\n⏳ Internship Duration: 3–6 months\n\n💰 Stipend: Yes (based on contribution)\n\n\n\n\nInterested? Drop your resume at info.elitefusiontech@gmail.com\n\n\n\n\nCandidates from and around Ranipet/Vellore, Tamil Nadu, are preferred.\n\n\n\n\nWhat you get:\n\n– Mentoring from experienced R&D engineers\n\n– Opportunity to work on a real-world funded product development\n\n– Certificate, networking, and the possibility of continued engagement\n\n\n\n\n#internships hashtag\n\n#engineeringstudents hashtag\n\n#projectbasedlearning hashtag\n\n#hardwareinternship hashtag\n\n#ELITEFUSION",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Full Stack Developer (Interview Coach/Trainer)",
    "job_id": "4279452441",
    "company_name": "Not mentioned in description, looking for Full Stack Developer",
    "location": "India",
    "experience": "Freshers or candidates with up to 1 year of experience only",
    "salary": "₹35,000 – ₹40,000/month",
    "key_skills": [
      "Full Stack Development",
      "System Design",
      "Data Structures"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279452441/",
    "posted_at": null,
    "job_description": "About the job\n\n📌 Job Title: Full Stack Developer (Interview Coach/Trainer)\n\n 📍 Location: Gurgaon\n\n 🕒 Branch Timing: 6:30 PM – 3:30 AM\n\n 💼 Type: Full-Time\n\n 💰 Salary Range: ₹35,000 – ₹40,000/month\n\n 🎯 Experience: Freshers or candidates with up to 1 year of experience only\n\n📝 Job Summary\n\nWe are seeking a detail-oriented and technically strong Full Stack Developer to train and prepare candidates for high-stakes technical interviews. Your role will involve helping candidates understand and explain their project experience, coaching them through technical assessments, and conducting live interview simulations to ensure success.\n\nYou’ll be responsible for hands-on project documentation, system design walkthroughs, coding guidance, and tailored technical preparation. Strong communication, mentoring skills, and full stack knowledge are essential.\n\n✅ Key Responsibilities\n\nProject Understanding & Preparation\n\nAnalyze and document candidates’ project details thoroughly\nConduct discovery calls to verify technical understanding\nCreate concise, story-based architectural breakdowns\nPrepare candidates for confident project walkthroughs\n\nInterview Preparation\n\nConduct technical Q&A coaching and pre-interview check-ins\nShare customized interview strategies and project documentation\nAssist during mock interviews with real-time support\nKeep technical documentation updated with relevant questions and insights\n\nTechnical Coaching & Assessment Guidance\n\nExplain system design, data structures, and real-world coding logic\nPrepare problem-solving exercises with ideal answers\nTeach time/space complexity analysis and clean coding practices\nFocus on practical, scenario-based technical reasoning\n\nPost-Session Follow-up\n\nProvide structured feedback after each session\nLog session outcomes and track progress in detail\nFlag issues and ensure all coaching activity is recorded properly\n\nOperational Requirements\n\nMaintain quick response times and session readiness\nManage calendar scheduling and session invites\nUse collaboration tools like Zoom, Teams, Google Docs effectively\nFollow clear documentation and preparation protocols\n\n👤 Requirements\n\nHands-on skills in full stack development (Java, Python, SQL, etc.)\nGood understanding of system design, APIs, and scalable architectures\nStrong verbal communication and mentoring abilities\nCapable of simplifying complex concepts into business-ready language\nDetail-oriented, organized, and proactive in follow-ups\nPrior experience in interview coaching is a bonus (not mandatory)",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "AI/ML Engineer",
    "job_id": "4281164125",
    "company_name": "Not mentioned in description, looking for AI/ML experience",
    "location": "India",
    "experience": "2+ Years",
    "salary": null,
    "key_skills": [
      "Machine Learning",
      "Deep Learning",
      "AI",
      "NLP",
      "Computer Vision"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281164125/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: AI/ML Engineer (2+ Years Experience)\n\nLocation: Bangalore\n\nExperience Required: 2+ Years\n\nEmployment Type: Full-time\n\nDepartment: Data Science / Engineering\n\n\n\n\nAbout the Role:\n\nWe are looking for a highly motivated AI/ML Engineer with a strong background in building and deploying machine learning models and intelligent systems. The ideal candidate should have at least 2 years of hands-on experience in data preparation, model development, training, evaluation, and deployment across real-world applications. You will work closely with data scientists, engineers, and product teams to bring AI-driven features and solutions to life.\n\n\n\n\nResponsibilities:\nDesign, develop, and deploy machine learning models for classification, regression, recommendation, NLP, or computer vision use-cases.\nWork with large datasets to clean, preprocess, and perform feature engineering.\nBuild and maintain scalable pipelines for training and inference.\nEvaluate model performance using relevant metrics and perform model tuning and optimization.\nIntegrate ML models into production environments via APIs or services.\nCollaborate with software engineers, product managers, and data teams to translate business requirements into AI/ML solutions.\nStay updated with the latest trends in machine learning, deep learning, and AI.\nDocument processes, models, experiments, and decisions.\n\n\n\n\nRequired Skills & Qualifications:\nBachelor’s or Master’s in Computer Science, Data Science, Artificial Intelligence, or related field.\n2+ years of hands-on experience in building machine learning models using Python.\nProficiency in ML libraries like scikit-learn, TensorFlow, PyTorch, Keras, XGBoost, etc.\nGood understanding of data structures, algorithms, and mathematics/statistics behind machine learning.\nExperience working with Pandas, NumPy, Matplotlib/Seaborn for data analysis and visualization.\nFamiliarity with NLP techniques, transformers, or computer vision is a plus.\nExperience with cloud platforms like AWS, Azure, or GCP is an advantage.\nKnowledge of MLOps tools (e.g., MLflow, DVC, Airflow) is a bonus.\nStrong problem-solving skills and ability to work independently in a fast-paced environment.\n\n\n\n\nGood to Have:\nExperience with deep learning architectures (CNNs, RNNs, LSTMs, GANs, Transformers).\nUnderstanding of model explainability tools (SHAP, LIME).\nExposure to AI ethics and responsible AI practices.\nExperience working in an Agile development environment.\n\n\n\n\nWhy Join Us:\nWork on cutting-edge AI/ML solutions.\nOpportunity to grow with a passionate and skilled team.\nFlexible work environment and culture of innovation.\nContinuous learning opportunities and mentorship.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer Intern – Python, Cloud & Modern Web Stack",
    "job_id": "4281199563",
    "company_name": "Innomax IT Solutions Pvt Ltd",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Python",
      "Flask",
      "FastAPI",
      "Django",
      "React.js",
      "Next.js",
      "RESTful APIs",
      "GraphQL",
      "AWS",
      "GCP",
      "Azure"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281199563/",
    "posted_at": null,
    "job_description": "About the job\n\n🧾 Job Title:\n\nFull Stack Developer Intern – Python, Cloud & Modern Web Stack\n\n🏢 Company:\n\nInnomax IT Solutions Pvt Ltd\n\n Location: Hyderabad | Internship Duration: 3–6 Months | Mode: On-site / Hybrid / Remote (based on team requirement)\n\n🧩 About Innomax IT:\n\nInnomax IT Solutions is a domain-focused tech consulting and product development company, building intelligent solutions across HealthTech, FinTech, and TravelTech sectors. With a vision to disrupt and digitize traditional models, our teams work on AI-first, cloud-native, and secure-by-design platforms to power the next-gen digital economy.\n\n🎯 Role Overview:\n\nWe're looking for a Full Stack Developer Intern with strong foundations in Python and a passion for solving real-world problems using modern backend, frontend, and cloud-based technologies. You will be an integral part of our product team, working on scalable applications from idea to deployment.\n\n🛠️ Key Responsibilities:\nAssist in building and maintaining responsive, secure, and scalable web applications.\nWork on data-driven backend services using Python (Flask/FastAPI/Django).\nContribute to frontend development using React.js / Next.js with a focus on usability and performance.\nImplement and consume RESTful APIs / GraphQL.\nUse cloud services (AWS / GCP / Azure) to deploy and monitor full-stack applications.\nWrite testable code and perform unit/integration testing.\nParticipate in standups, sprint planning, and agile rituals with cross-functional teams.\nDocument code, APIs, and workflows.\n💡 Tech Stack Exposure (Preferred):\nLanguages: Python (required), JavaScript/TypeScript, R (nice to have for analytics or modeling)\nBackend: Flask, FastAPI, Django\nFrontend: React.js, Next.js, Tailwind CSS / Bootstrap\nDatabases: PostgreSQL, MongoDB, Firebase, Redis\nCloud & DevOps: AWS (Lambda, EC2, S3, DynamoDB), GCP (App Engine, Firestore), Docker, GitHub Actions\nOthers: REST/GraphQL, OAuth2, WebSockets, Git, CI/CD pipelines, Jupyter (for data/ML projects)\n📘 Required Qualifications:\nFinal year or recent graduate in Computer Science, Engineering, Math, or related fields.\nSolid foundation in Python programming, data structures, and algorithms.\nFamiliarity with web technologies, API concepts, and cloud deployment.\nStrong problem-solving ability and eagerness to learn full-stack engineering.\nExcellent written and verbal communication skills.\n🌟 Good to Have (Bonus):\nExposure to data science workflows using R or Python (Pandas, NumPy, Matplotlib, etc.).\nUnderstanding of MLOps or data pipelines in production.\nPrior internship / GitHub portfolio / freelance projects.\nKnowledge of authentication flows (JWT, OAuth2).\n🚀 What You’ll Gain:\nMentorship from a multi-domain product team (HealthTech, FinTech, TravelTech).\nOpportunity to work on real client projects & internal IP products.\nExposure to end-to-end product development using cutting-edge technologies.\nCertificate, recommendation, and Pre-Placement Offer (PPO) consideration for top performers.\nInsight into how cloud-native apps and digital health infrastructure are being built.\n📩 How to Apply:\n\nSend your updated resume, GitHub/portfolio link (if available), and a short note on why you’re interested to:\n\n 📧 hr@innomaxsol.com or whatsapp to 9281111716",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer Intern",
    "job_id": "4279451154",
    "company_name": "Not mentioned in description, looking for Full Stack Developer",
    "location": "India",
    "experience": "Last Year students are welcome to apply!",
    "salary": "$500 per month",
    "key_skills": [
      "JavaScript",
      "Java",
      "Meteor",
      "Mongo DB",
      "Spring"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279451154/",
    "posted_at": null,
    "job_description": "About the job\n\nAs a Full Stack Developer Intern, you'll be working directly with our senior engineers to add new features, fix bugs, and other programming requirements. You should also be interested and willing to learn new programming languages as necessary.\n\nWe're revolutionizing software testing with the backing of top Silicon Valley investors. We need your help in letting the world know. We are looking for that specific driven human being who wants to make an impact on the world by changing the way software is tested.\n\nWe are also open to offering the full-time position post Internship period, subject to the Intern's performance.\n\n\nStipend: $500 per month\n\nDuration of the Internship: 12 Months\n\nResponsibilities\n\n\nAssisting in the development of new features \nResolve bugs and issues reported by the team and users\nParticipate in projects that will help you learn best practices of how to architect, design, and develop a product\nWorking on building and maintaining the company's existing product\nParticipate in brainstorming sessions with other members of the technical team \nUse your strong analytical abilities and programming skills to write efficient, production quality code while maintaining adaptability to new technologies/frameworks as the need arises\n\n\n\nQualifications\n\n\nBachelor's/Master's in Computer Science/Information Technology. Last Year students are welcome to apply!\nGood Knowledge of JavaScript / Java 11 or Java 8\nKnowledge of Meteor, Mongo DB, Spring\nAbility to work with a great deal of autonomy, as well as in a team environment\nKnowledge of Engineering Concepts\nAbility to work in a global team, with multiple stakeholders across functions, business units and geographical regions\nFluency in the English Language is a must!\nThis position may require working during U.S. hours\n\n\nPlease, share your MBTI type in your cover letter.\n\n(If you don't know your type, here is a free test online: https://personalityjunkie.com/free-online-personality-test-3/ )",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Freelance Web Developer",
    "job_id": "4281159811",
    "company_name": "Not mentioned in description, looking for Freelance Web Developer",
    "location": "India",
    "experience": "2+ years of experience in web development or a portfolio of 2+ working on projects.",
    "salary": null,
    "key_skills": [
      "Web Development",
      "Full-Stack Concepts",
      "APIs",
      "System Design",
      "Auth",
      "DB Logic"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281159811/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Summary:-\n\nWe are seeking \"skilled freelancers\" to join our team, responsible for designing and developing websites.\n\n\n\n\nResponsibilities:-\n\n1. Design and Development: Design and develop websites.\n\n2. Coding: Write clean, efficient, and well-documented code in programming languages.\n\n3. Collaboration: Work closely with cross-functional teams to ensure smooth project delivery.\n\nRequirements\n\n1. Education: Bachelor's degree in Computer Science, Information Technology, or related field.\n\n2. Experience: 2+ years of experience in web development or a portfolio of 2+ working on projects.\n\n3. Communication Skills: Excellent communication and teamwork skills.\n\n\n\n\nThere will be 4 rounds for recruitment\n\n\n\n\nStep-1:- Shortlisted candidates will receive a Google Form in their email. Fill out with attention to detail—\n\nYour resume and GitHub/portfolio link will be judged carefully.\n\n\n\n\nStep-2 :- Coding Round (MCQ + Problem solving) \n\nWe will test your technical, fundamental, and real-world coding approach. No Leeway, only those who score well will move forward.\n\n\n\n\nStep-3:- Interview round (2 hrs 30 mins)\n\n\n\n\nHr and Communication Round (15 mins)\n\nReal-life problem-solving thinking \nApproach to freelance work \nCommunication and collaboration style\n\nTechnical Interview Round (2hrs 15mins)\n\nDeep dive into Full-Stack concepts\nSystem design, APIS, Auth, DB logic, Performance \nDebugging, Edge cases, Scalability \nReal-time coding and code review\n\nStep-4:- Mock projects (6-7 Days)\n\nYou'll be given a real-world mock project that mimics our actual client tasks. The task will test\n\nEnd-to-End Development \nCode Quality, Scalability \nUI/UX Precision\nTime and Communication Discipline \n\nWe are hiring 2 top-tier freelance full-stack developers to join SkillHive, our growing startup focused on quality-driven digital solutions. \n\nFor now, this will be a freelance-based collaboration, but for rthe ight individual who proves their skills, consistency, and alignment with our vision, can join our full-time Full-Stack developers team in the future.\n\n\n\n\nLet us know if you have any questions.\n\n\n\n\nBest regards \n\nSkillHive Team",
    "source": "linkedin",
    "relevance_score": "medium"
  }
]