[
  {
    "title": "Frontend Developer",
    "job_id": "4273553001",
    "company_name": "iMobile Designs Pvt. Ltd.",
    "location": "Ahmedabad, India",
    "experience": "1–3 Years",
    "salary": null,
    "key_skills": [
      "Flutter",
      "Dart",
      "REST APIs",
      "Firebase",
      "Git",
      "Provider",
      "Riverpod",
      "Bloc",
      "Figma",
      "XD"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/frontend-developer-at-immersive-mobile-designs-4273553001",
    "posted_at": null,
    "job_description": "Location: Ahmedabad (On-site only)\n\nExperience: 1–3 Years\n\nCompany: iMobile Designs Pvt. Ltd.\n\nType: Full-time\n\n\nAt iMobile Designs Pvt. Ltd., we’re more than just an app development company — we’re a bunch of tech enthusiasts who love turning smart ideas into seamless digital products. Based in Ahmedabad, we work with clients across healthcare, e-commerce, and SaaS to build apps that are fast, user-friendly, and actually useful.\n\n\n\n\nWe’re growing, and we’re looking for someone who’s just as passionate about clean code and great design as we are.\n\n\nYour Responsibilities:\n\nBuild and maintain mobile apps using Flutter & Dart\nTurn beautiful UI/UX designs (from Figma or XD) into working code\nCollaborate with backend developers to connect APIs and services\nTest, debug, and make sure the app performs well across devices\nKeep your code clean, readable, and well-structured\nBring in your own ideas to improve the user experience\n\n\n\n\nRequirements:\n\n1–3 years of experience working with Flutter\nA solid understanding of how mobile UIs work\nExperience with REST APIs, Firebase, and version control (Git)\nComfort with state management tools like Provider, Riverpod, or Bloc\nBonus points if you’ve published apps or know native Android/iOS\nA team player who communicates clearly and loves learning\n\n\n\n\nPerks of working with us:\n\nA supportive, friendly team that values your input\nReal projects for real clients — no fake tasks here\nPlenty of space to grow, experiment, and upskill\nA workplace where you’re seen as a person, not a resource\n\n\n\n\nHow to apply:\n\nIf this sounds like a good fit, we’d love to hear from you!\nSend your resume (and any app links or GitHub profiles) to hr@imobiledesigns.com\n\n﻿Subject: Flutter Developer Application",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer (Node.js)",
    "job_id": "4273596858",
    "company_name": "Supportsoft Technologies",
    "location": "Jaipur, India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Back-End Web Development",
      "Full-Stack Development",
      "Front-End Development",
      "HTML",
      "CSS",
      "JavaScript",
      "Software Development",
      "Node.js"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/full-stack-developer-nodejs-at-supportsoft-technologies-4273596858",
    "posted_at": null,
    "job_description": "Company Description\n\n\nEstablished in 2013, Supportsoft Technologies is committed to transforming businesses through technology and excellence. Initially starting with just an investment of AUD 2K and 5 seats, the company has grown into a thriving enterprise with over 40 employees. Our mission is to empower small and medium businesses by offering virtual staffing solutions, reducing in-house payroll and rental costs. We specialize in custom software development, mobile app development, web development, and digital marketing. We serve clients across various industries including IT & Technology, Hospitality & Tourism, Finance & Banking, Manufacturing, Real Estate, and E-commerce & Retail.\n\n\nRole Description\n\n\nThis is a full-time on-site role for a Full Stack Developer (Node.js) located in Jaipur. The Full Stack Developer will be responsible for developing and maintaining web applications, creating and implementing front-end and back-end components, and collaborating with cross-functional teams to deliver high-quality software solutions. The developer will also be required to ensure the application of best practices in coding, testing, and deployment processes.\n\n\nQualifications\n\nProficiency in Back-End Web Development and Full-Stack Development\nExperience with Front-End Development, including HTML, CSS, and JavaScript\nSkilled in Software Development and proficient in Node.js\nCascading Style Sheets (CSS) expertise\nStrong problem-solving skills and ability to work in a collaborative environment\nExcellent written and verbal communication skills\nBachelor's degree in Computer Science, Information Technology, or related field\nExperience in the technology industry is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer - NestJS + React.js",
    "job_id": "4273083531",
    "company_name": "Sennes Technology Solutions Pvt Ltd",
    "location": "Chennai, India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "NestJS",
      "React.js",
      "RESTful APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/full-stack-developer-nestjs-%2B-react-js-at-sennes-technology-solutions-pvt-ltd-4273083531",
    "posted_at": null,
    "job_description": "Company Description\n\nAt SenneS Technology Solutions Pvt Ltd, we specialize in building AI-powered products that solve real-world problems and drive digital transformation. Our mission is to transform ideas into smart, scalable AI solutions that deliver impact. We offer services in custom AI product development, predictive modeling and data analysis, computer vision and NLP solutions, and end-to-end AI integration. With a team of passionate developers, data scientists, and innovators, we focus on building intelligent, intuitive, ethical AI systems ready for the future.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Full Stack Developer specializing in NestJS and React.js at our Chennai location. The Full Stack Developer will be responsible for developing and maintaining both back-end and front-end applications. Day-to-day tasks include designing and implementing APIs, ensuring application performance, collaborating with cross-functional teams, debugging and troubleshooting code, and continuously enhancing the user experience through innovative solutions.\n\n\n\n\nKey Responsibilities:Develop and maintain server-side applications using NestJS framework.\n\nDesign RESTful APIs and ensure security, performance, and scalability.\nBuild responsive and dynamic user interfaces with React.js.\nCollaborate with designers and other developers to deliver high-quality features.\nWrite clean, maintainable, and well-documented code.\nIntegrate third-party APIs and services as required.\nParticipate in code reviews and ensure adherence to best practices.\nDebug and resolve technical issues across the stack.\nOptimize application performance on both frontend and backend.\n\n\n\n\nRequired Skills & Qualifications:\n\n2+ years of experience with Node.js, and at least 1 year with NestJS.\nStrong proficiency in JavaScript and TypeScript.\nSolid understanding of React.js, hooks, and component-based architecture.\nExperience with RESTful APIs, JWT, and middleware handling.\nFamiliarity with PostgreSQL, MongoDB, or other databases.\nKnowledge of frontend tools such as Webpack, Babel, ESLint, etc.\nExperience with version control (Git) and CI/CD workflows.\nUnderstanding of software development principles (SOLID, DRY, etc.).\nAbility to write unit and integration tests (e.g., Jest, Supertest, React Testing Library).\n\nGood to Have:\n\nExperience with GraphQL.\nFamiliarity with containerization (Docker).\nCloud deployment experience (AWS/GCP/Azure).\nBasic understanding of UI/UX principles.\n\n\n\n\nEducation:\n\nBachelor's degree in Computer Science, Engineering, or related field (or equivalent practical experience).",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Web Developer (Wordpress)",
    "job_id": "4272126098",
    "company_name": "Know All Edge Networks Pvt Ltd",
    "location": "Mumbai, India",
    "experience": "2+years",
    "salary": null,
    "key_skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "WordPress",
      "SEO",
      "Core Web Vitals"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/web-developer-wordpress-at-know-all-edge-4272126098",
    "posted_at": null,
    "job_description": "Hiring for Web Developer (Wordpress) for Malad, Mumbai @ Know All Edge Networks Pvt Ltd\n\n\n\n\nPosition: Web Developer (Wordpress)\n\nEmployment: Full time\n\nExperience: 2+years\n\nJob location: Malad, Mumbai\n\n\n\n\nRole Summary:\n\nWe're looking for a technically strong web developer who can build, manage, and optimize websites with an eye on SEO, user experience, and performance. A deep understanding of technical SEO and Core Web Vitals is a must.\n\n\n\n\nResponsibilities:\n\nDevelop and maintain company websites (WordPress or other CMS)\nEnsure websites are fast, responsive, and technically SEO-optimized\nImplement Core Web Vitals best practices (LCP, FID, CLS)\nHandle domain, hosting, CDN, and caching solutions\nCollaborate with SEO, content, and design teams to support digital campaigns\n\n\n\n\nRequirements:\n\nStrong skills in HTML, CSS, JavaScript, and WordPress/other CMS\nExperience optimizing Core Web Vitals\nFamiliarity with schema markup, sitemaps, robots.txt, etc.\nBasic knowledge of SEO and analytics tools",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Machine Learning Engineer (T25)",
    "job_id": "4259876968",
    "company_name": "eBay",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Machine Learning",
      "Data Science",
      "Big Data"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/machine-learning-engineer-t25-at-ebay-4259876968",
    "posted_at": null,
    "job_description": "At eBay, we're more than a global ecommerce leader — we’re changing the way the world shops and sells. Our platform empowers millions of buyers and sellers in more than 190 markets around the world. We’re committed to pushing boundaries and leaving our mark as we reinvent the future of ecommerce for enthusiasts.\n\nOur customers are our compass, authenticity thrives, bold ideas are welcome, and everyone can bring their unique selves to work — every day. We're in this together, sustaining the future of our customers, our company, and our planet.\n\nJoin a team of passionate thinkers, innovators, and dreamers — and help us connect people and build communities to create economic opportunity for all.\n\nMachine Learning Engineer (T25), Product Knowledge\n\nDo you love Big Data? Deploying Machine Learning models? Challenging optimization problems? Knowledgeable, collaborative co-workers? Come work at eBay and help us redefine global, online commerce!\n\nWho Are We?\n\nThe Product Knowledge team is at the epicenter of eBay’s Tech-driven, Customer-centric overhaul. Our team is entrusted with creating and using eBay’s Product Knowledge - a vast Big Data system which is built up of listings, transactions, products, knowledge graphs, and more. Our team has a mix of highly proficient people from multiple fields such as Machine Learning, Data Science, Software Engineering, Operations, and Big Data Analytics. We have a strong culture of collaboration, and plenty of opportunity to learn, make an impact, and grow!\n\nWhat Will You Do\n\nWe Are Looking For Exceptional Engineers, Who Take Pride In Creating Simple Solutions To Apparently-complex Problems. Our Engineering Tasks Typically Involve At Least One Of The Following\n\n\nBuilding a pipeline that processes up to billions of items, frequently employing ML models on these datasets\nCreating services that provide Search or other Information Retrieval capabilities at low latency on datasets of hundreds of millions of items\nCrafting sound API design and driving integration between our Data layers and Customer-facing applications and components\nDesigning and running A/B tests in Production experiences in order to vet and measure the impact of any new or improved functionality\n\n\n\nIf you love a good challenge, and are good at handling complexity - we’d love to hear from you!\n\neBay is an amazing company to work for. Being on the team, you can expect to benefit from:\n\n\nA competitive salary - including stock grants and a yearly bonus\nA healthy work culture that promotes business impact and at the same time highly values your personal well-being\nBeing part of a force for good in this world - eBay truly cares about its employees, its customers, and the world’s population, and takes every opportunity to make this clearly apparent\n\n\n\nJob Responsibilities\n\n\nDesign, deliver, and maintain significant features in data pipelines, ML processing, and / or service infrastructure\nOptimize software performance to achieve the required throughput and / or latency\nWork with your manager, peers, and Product Managers to scope projects and features\nCome up with a sound technical strategy, taking into consideration the project goals, timelines, and expected impact\nTake point on some cross-team efforts, taking ownership of a business problem and ensuring the different teams are in sync and working towards a coherent technical solution\nTake active part in knowledge sharing across the organization - both teaching and learning from others\n\n\n\nMinimum Qualifications\n\n\nPassion and commitment for technical excellence\nB.Sc. or M.Sc. in Computer Science or an equivalent professional experience\n2+ years of software design and development experience, tackling non-trivial problems in backend services and / or data pipelines\nA solid foundation in Data Structures, Algorithms, Object-Oriented Programming, Software Design, and core Statistics knowledge\nExperience in production-grade coding in Java, and Python/Scala\nExperience in the close examination of data and computation of statistics\nExperience in using and operating Big Data processing pipelines, such as: Hadoop and Spark\nGood verbal and written communication and collaboration skills\n\n\n\nPlease see the Talent Privacy Notice for information regarding how eBay handles your personal data collected when you use the eBay Careers website or apply for a job with eBay.\n\neBay is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you have a need that requires accommodation, please contact us at talent@ebay.com. We will make every effort to respond to your request for accommodation as soon as possible. View our accessibility statement to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities.\n\nThe eBay Jobs website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer Intern",
    "job_id": "4273593407",
    "company_name": "Therra",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "React.js",
      "HTML5",
      "CSS3",
      "ES6+",
      "Flexbox",
      "Grid",
      "Redux",
      "Zustand",
      "Recoil",
      "Context",
      "REST",
      "GraphQL",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-intern-at-therra-4273593407",
    "posted_at": null,
    "job_description": "Therra is a new kind of supplement marketplace — one built on transparency, testing, and trust.\n\nWe’re solving a massive problem in the health & wellness industry: no one knows what’s actually inside the supplements they buy. From protein powders to sleep gummies, the market is full of mislabeled, under-tested, and overhyped products.\n\n\n\n\nResponsibilities\n\nWe’re looking for a smart, driven generalist who wants to build zero-to-one with us. You'll work directly with the founder and play a cross-functional role across product, community, and growth.\n\n\n\n\nQualifications\n\nYou’re obsessed with health, wellness, or biohacking\n\nYou think like a founder — take initiative, own outcomes, ship fast\n\n\n\n\nStrong proficiency in React.js (functional components, hooks, context API)\nSolid understanding of HTML5, CSS3, and modern JS (ES6+)\nExperience building responsive, mobile-first UIs (Flexbox, Grid)\nFamiliar with state management libraries (Redux, Zustand, Recoil, or Context)\nConfident working with APIs (REST, GraphQL)\nGit proficiency and familiarity with GitHub workflows\n\n\n\n\nBonus: You've worked on marketplaces, community products, or consumer tech\n\nExtra bonus: You’ve experimented with your own stack, followed Andrew Huberman, or tracked your own biomarkers 😉",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Python Developer",
    "job_id": "4272109031",
    "company_name": "The Thesis Toolbox",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Back-End Web Development",
      "Software Development",
      "Object-Oriented Programming",
      "Python"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-the-thesis-toolbox-4272109031",
    "posted_at": null,
    "job_description": "Role Description\n\nThe Python Developer will be responsible for back-end web development, software development, and object-oriented programming. The daily tasks will include creating and maintaining databases, writing and optimizing code, and collaborating with other team members to ensure the efficiency and performance of the software.\n\n\n\n\nQualifications\n\n\\n\nProficiency in Back-End Web Development and Software Development\nStrong skills in Object-Oriented Programming (OOP) and Programming\nExperience with Databases\nExcellent problem-solving and analytical abilities\nAbility to work independently and remotely\nExperience in Agile development practices is a plus\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Product Engineer - AI/ML",
    "job_id": "4272127041",
    "company_name": "AI-Certs™ India",
    "location": "Hyderabad, India",
    "experience": "2–5 years",
    "salary": null,
    "key_skills": [
      "LLMs",
      "LangChain",
      "RAG pipelines",
      "vector databases",
      "OpenAI APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/product-engineer-ai-ml-at-ai-certs%E2%84%A2-india-4272127041",
    "posted_at": null,
    "job_description": "Location: Hyderabad, India (Hybrid or In-office)\n\nType: Full-time\n\nExperience: 2–5 years (Exceptional freshers or self-taught candidates welcome)\n\nTeam: Product Engineering – AI/ML\n\n🧠 About the Role\n\nWe're building a 10X team at the intersection of AI, product, and education. As an AI/ML Product Engineer, you’ll go beyond theory—shipping real products that impact millions. If you’re obsessed with LLMs, can build and break fast, and thrive in a builder-led, product-driven environment, we want you.\n\n✅ What You’ll Do\nBuild and deploy AI/ML-powered tools and features using LLMs, LangChain, RAG pipelines, and vector databases\nRapidly prototype and ship minimum viable products (MVPs) within weeks\nCollaborate with product designers to create intuitive, impactful user experiences\nWork closely with platform teams to integrate AI into products like Certs365 and Proctoring365\nDebug and improve user flows with a fixer-first mindset\nThink in systems — map out how various parts of the product fit together for scale\nContribute to a mission-first culture, solving real problems in skilling, certification, and lifelong learning\n🔍 What We’re Looking For1. AI/ML Proficiency\n\nHands-on with LLMs, LangChain, Pinecone/FAISS, RAG, OpenAI APIs, etc.\n\n2. Builder Mindset\n\nYou've shipped live products, tools, or demos—fast. (Think Replit, Product Hunt, or your own portfolio.)\n\n3. Product Thinking\n\nYou care about UX, not just models. You've redesigned flows or debugged frustrating interfaces.\n\n4. Fixer Mentality\n\nYou love squashing bugs and improving user experiences—even when no one asks.\n\n5. Systems Thinking\n\nYou see how everything connects: APIs, DBs, frontend, backend, and users.\n\n6. Mission-Driven Approach\n\nYou want to build meaningful AI solutions in education, skilling, or social impact—not just cool tech.\n\n7. Communication Skills\n\nYou can clearly explain decisions in docs, demos, or during standups.\n\n📎 Bonus Points For\nContributions to open-source AI tools\nPrior experience in edtech, skilling platforms, or learning ecosystems\nGitHub, Product Hunt, Kaggle, or public portfolios\nHyderabad-based but open to hybrid flexibility\n🎯 Why Join Us?\nWork with a mission-driven, 10X team\nSolve real-world problems with AI, at scale\nBuild products used by thousands (soon millions) in the learning space\nAutonomy, velocity, and ownership from Day 1",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer (LLM Applications & AI Tools)",
    "job_id": "4273271551",
    "company_name": "PiHex Labs",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "LLM",
      "JSON",
      "APIs",
      "React",
      "Next.js"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-llm-applications-ai-tools-at-pihex-labs-4273271551",
    "posted_at": null,
    "job_description": "🧑‍💻 Job Title\n\n\n\n\nSoftware Engineer (LLM Applications & AI Tools)\n\n\n\n\n🏢 Company\n\n\n\n\nPiHex Labs\n\n🌐 Website | LinkedIn\n\n📍 Remote | 🕒 Full-Time / Internship\n\n\n\n\n🧩 About PiHex Labs\n\n\n\n\nPiHex Labs is a modern tech firm focused on AI, software engineering, and scalable backend systems. We work with global clients to create robust, high-performance platforms that are secure, efficient, and reliable.\n\n\n\n\n🚀 Role Overview\n\n\n\n\nWe are looking for a Software Engineer with experience in LLM-based applications to join our team. This role involves building AI-powered tools, designing structured data pipelines with LLMs, and working on innovative applications that combine backend systems with intelligent front-end interfaces.\n\nYou'll get to work on prompt engineering, structured data generation (JSON, APIs), and seamless integration of LLMs into real-world applications.\n\n\n\n\n🛠️ Responsibilities\n\n\n\n\nDesign and build LLM-based applications and pipelines for structured data generation and processing\nDevelop prompt-engineering strategies to improve the accuracy and reliability of LLM outputs\nWork on backend integrations, APIs, and cloud-based deployments for AI-driven tools\nImplement best practices for scalable and efficient AI applications\nCollaborate on developing interactive front-end interfaces (React/Next.js) that integrate with AI-powered backends\nWrite clean, maintainable, and well-tested code, participate in code reviews, and follow agile workflows\n\n\n\n\n✅ Requirements\n\n\n\n\nStrong experience in Python (FastAPI, Flask, or Django)\nFamiliarity with LLM APIs (OpenAI, Anthropic, etc.) and prompt engineering\nGood understanding of structured data formats (JSON, YAML) and API design\nExperience with cloud platforms (AWS/GCP/Azure) and containerization (Docker)\nStrong debugging skills and the ability to work with complex data pipelines\nSolid understanding of Git workflows and collaborative software development\n\n\n\n\n🌟 Nice to Have\n\n\n\n\nExperience with LangChain, Instructor, or similar LLM frameworks\nExposure to front-end frameworks (React, Next.js) for building AI-powered interfaces\nKnowledge of data transformation tools and scientific data formats (JSON-LD, etc.)\nFamiliarity with DevOps practices and CI/CD pipelines\n\n\n\n\n🎁 Perks\n\n💰 Fair Stipend or Salary Based on Skills and Experience\n🕓 Flexible Work Hours\n📍 Remote-Friendly Setup\n📈 Learning & Growth Opportunities\n👥 Collaborative Team Culture\n\n﻿\n\n📬 How to Apply\n\nSubmit your application using this Google Form.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer (C#/.Net, Angular or React)",
    "job_id": "4272113056",
    "company_name": "Diebold Nixdorf",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "C#",
      ".Net",
      "Angular",
      "React"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-c%23-net-angular-or-react-at-diebold-nixdorf-4272113056",
    "posted_at": null,
    "job_description": "Job Description\n\nExpect more. Connect more. Be more at Diebold Nixdorf. Our teams automate, digitize, and transform the way more than 75 million people around the globe bank and shop in this hyper-connected, consumer-centric world. Join us in connecting people to commerce in this vital, rewarding role.\n\nApplies the principles of software engineering to the design, development, maintenance, testing and evaluation of software and computer systems. Works cross-functionally to understand business requirements, evaluate alternative approaches and ensure software and systems are designed to facilitate ease of use and seamless integration into the target environments. Incorporates state-of-the-art concepts, tools and practices to facilitate system functionality, security and continuous improvement.\n\nResponsibilities\n\n\nProvides Software Engineering for an assigned set of system elements.\nDesigns, codes, tests and documents basic and moderately complex components according to standard protocols and coding guidelines.\nProvides technical support and troubleshooting for new and existing systems, making recommendations for their improvement.\nParticipates in discussions about feature development and related project estimation and resource planning.\nFollows secure coding practices and aligned testing requirements.\nWrites automated unit and system tests to provide coverage for common code paths.\nGains comfort working in and contributing ideas to a development team.\nNotifies team or technical manager of variances from plans and identifies changes in scope or work.\nBuilds working relationships with cross-functional engineers and teams, striving to learn and gain broader technical understanding.\n\n\n\nQualifications\n\n\nRequired Qualifications\n\n\nAt least 2+ years of hands-on experience implementing solutions for integration of on-premises and/or cloud systems.\nExperience with full software development life cycle, continuous integration, unit testing, and version control\nDegree in Computer Science, IT, Computer Engineering, MIS, Mathematics, or related field (MBA or MS degree preferred)\nStrong written and verbal communication.\nMust have the ability to communicate technical components with clarity and ability to operate in a fast-paced environment with evolving project requirements and priorities.\nExperience in working in cross-functional, cross-geography product/content development setup.\nExperience with full software development life cycle, continuous integration, unit testing, and version control.\nGood communicative and written English\nMaster or Bachelor in IT systems, computer systems or related.\n\n\n\nMust Have :\n\n\nHTML5/XML/CSS\nAngular (at least Angular2) or React\nC# / .NET Core,\nMS SQL, Couch DB/No SQL,\nREST\n\n\n\nNice to have:\n\n\nNode.JS, Kendo UI or any other UI component library\nWindows Controls, TypeScript\nCouch DB/No SQL\nReact JSAzure SQL\nDocker, Redis, Azure Exposure,\nRabbitMQ\nJenkins\nKubernetes\nExposure on SSO/OAuth/OIDC\n\n\n\nAbout Us\n\nWhy should you join Diebold Nixdorf?\n\nBrightest minds + technology and innovation + business transformation The people of Diebold Nixdorf are 23,000+ teammates of diverse talents and expertise in more than 130 countries, harnessing future technologies to deliver personalized, secure consumer experiences that connect people to commerce. Our culture is fueled by our values of collaboration, decisiveness, urgency, willingness to change, and accountability.\n\n–Diebold Nixdorf is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status.\n\n\nTo all recruitment agencies: Diebold Nixdorf does not accept agency resumes. Please do not forward resumes to our jobs alias, Diebold Nixdorf employees or any other organization location. Diebold Nixdorf is not responsible for any fees related to unsolicited resumes**\n\n\nWe are a global Company operating in multiple Locations and Entities. As we are keen to find the best solution for our candidates several legal entities might be applicable for a Job offer. A List of our operating entities can be found here - https://www.dieboldnixdorf.com/en-us/about-us/global-locations",
    "source": "linkedin",
    "relevance_score": "medium"
  }
]