[
  {
    "title": "Node JS & Backend Developer",
    "job_id": "4281823028",
    "company_name": "ICEGlobal ECommerce Technology Pvt. Ltd.",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Node JS",
      "Backend Development",
      "JavaScript",
      "Redux.js"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281823028/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nICEGlobal ECommerce Technology Pvt. Ltd. is launching a MY MOVIES - Online Exhibition Portal for Movie Industry and with millions of Film Fan Club Members Community and over 10000 movies promotion and ICE is also launching and operating a scalable and innovative business model that has been tested by thousands of sellers across 20 cities in 14 Indian states. ICEGlobal (ICE 2.0) brings this trusted platform online, allowing brands to showcase and sell their products while gaining meaningful insights through weekly themed expos on ICEBUY. This unique model offers buyers fresh deals, discounts, and opportunities every week, integrating social media capabilities, AR/VR, Web 3, and metaverse experiences. ICEBUY aims to significantly boost online sales for both high-value established brands and the Indian MSME sector, making it a catalyst for the Indian economy.\n\n Role Description\n \nThis is a full-time on-site role for a Node JS & Backend Developer - Co-founding team member for the MY MOVIES Portal at ICEGlobal ECommerce Technology Pvt. Ltd. Based in Bengaluru, the developer will be responsible for front-end and back-end web development, software development, and working with JavaScript and Redux.js. Day-to-day tasks include designing and developing server-side logic, ensuring high performance and responsiveness to front-end requests, and collaborating with team members to deliver high-quality products.\n\n Qualifications\n \n\nFront-End Development and JavaScript skills\nBack-End Web Development, including experience with Node.js\nSoftware Development skills\nExperience with Redux.js\nStrong problem-solving abilities and collaboration skills\nBachelor's degree in Computer Science, Engineering, or related field\nExperience in eCommerce platforms is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Developer",
    "job_id": "4281816397",
    "company_name": "Consultixs",
    "location": "India",
    "experience": "Freshers",
    "salary": null,
    "key_skills": [
      "HTML5",
      "CSS3",
      "JavaScript",
      "React",
      "Vue",
      "Angular",
      "Responsive design",
      "Cross-browser compatibility",
      "API"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281816397/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nConsultixs is a premier partner for organizations seeking transformative growth through advanced technological integration and strategic marketing innovation. We deliver scalable solutions designed to enhance operational efficiency, amplify brand impact, and position businesses for sustained success. By harnessing cutting-edge technologies, we empower enterprises to optimize workflows, automate critical processes, and elevate customer experiences through data-driven insights. Our comprehensive back-office solutions provide seamless administrative, financial, and logistical support, enabling clients to focus on strategic priorities.\n\n\n\n\nWhat You’ll Do\n\nBuild intuitive, responsive user interfaces with modern web frameworks\nTranslate design and business requirements into high-quality code\nOptimize performance across browsers and devices\nCollaborate with UX designers and backend engineers to deliver seamless user experiences\nEnsure cross-browser compatibility and accessibility\nWork on fast-paced projects using the latest frontend technologies\n\nQualifications And Skills\n\nCore web technologies: HTML5, CSS3, JavaScript\nFrontend frameworks: React, Vue, Angular, etc.\nPerformance optimization and debugging\nResponsive design principles\nCross-browser and mobile compatibility\nTeam collaboration and code quality\n\n\n\n\nWhat We’re Looking For\n\nWe looking for Freshers\nProficiency in at least one modern frontend framework\nStrong understanding of web performance, testing, and UI/UX\n\n\n\n\nLocation\n\n Hyderabad (Remote, On-site, or Hybrid depending on company preference)",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter Intern",
    "job_id": "4281819034",
    "company_name": null,
    "location": "Remote",
    "experience": null,
    "salary": "₹15,000 per month",
    "key_skills": [
      "Flutter",
      "Dart",
      "Android",
      "iOS",
      "APIs",
      "Git",
      "Firebase",
      "AI tools",
      "ChatGPT",
      "GitHub Copilot"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281819034/",
    "posted_at": null,
    "job_description": "About the job\n\nWe're on the lookout for a Flutter Intern who codes smart, builds fast, and brings some good vibes along the way 😎\n\nIf you're someone who uses AI tools (like ChatGPT, GitHub Copilot, etc.) to write cleaner and faster code, and you want to work on real mobile apps—not dummy tasks—this one’s for you.\n\n\n\n\nWhat We’re Looking For:\n\n ✅ Solid foundation in Flutter & Dart\n\n ✅ Familiarity with Android/iOS development\n\n ✅ Hands-on with APIs, Git, Firebase (bonus)\n\n ✅ Experience using AI tools to boost productivity\n\n ✅ Passionate learner with a builder mindset\n\n\nInternship Details:\n\n📍 Location: Remote\n\n 🕒 Duration: 3 months\n\n 💰 Stipend: ₹15,000 per month\n\n 🚀 High chance of full-time offer based on performance & fit\n\n\nWhat You’ll Get:\nReal product work, not side projects\nMentorship from experienced developers\nFast, startup-style environment\nOwnership, learning, and actual impact\nA team that ships fast and supports each other",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Workday Integrations Developer",
    "job_id": "4280207157",
    "company_name": null,
    "location": "Remote",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Workday integrations",
      "Workday Extend",
      "EIBs",
      "PMD Scripting",
      "XSLT",
      "REST",
      "SOAP",
      "JSON",
      "XML"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280207157/",
    "posted_at": null,
    "job_description": "About the job\n\nWorkday Integrations Developer with Workday Extend Experience\n\nRemote\n\n \n\nNeed to have strong expertise in Workday integrations, especially Finance integrations\n\n \n\nUnderstanding of Workday Extend, including Business Objects, Business Processes, Orchestrations, Reports, and Security. \n\n \n\nDesign and implement integrations with other systems, leveraging EIBs, PMD Scripting, and XSLT for data transformation. \n\n \n\nExperience in developing and maintaining integrations with other systems, including web services (REST, SOAP, JSON, XML) and data transformation techniques.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "AI/ML Engineer",
    "job_id": "4280201401",
    "company_name": null,
    "location": "Pune",
    "experience": "1 to 4 years",
    "salary": null,
    "key_skills": [
      "AI",
      "Machine Learning",
      "Cloud platforms",
      "SQL",
      "Python"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280201401/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description for the AI/ML Role: \n\n\n\n\nJob Role: AI/ML Engineer\n\nJob Type: Permanent Full time\n\nLocation: Pune (Hybrid) \n\nNotice Period: Immediate Joiners\n\nExperience: 1 to 4 years\n\n\n\n\nJob Description: \n\nWe are seeking a dynamic AI & Machine Learning Engineer to join our team. This role is pivotal in implementing AI and machine learning solutions on cloud-based platforms, staying abreast of emerging trends in AI, developing proofs-of-concept, and collaborating with internal and external stakeholders to transition concepts to production. Additionally, this role involves the application of engineering principles from the classical software development lifecycle to AI and machine learning.\n\n\n\n\nKey Responsibilities:\n\nDevelop AI & Machine Learning solutions on cloud-based platforms.\nIdentify, access, import, clean, and format data from various sources.\nImplement research findings and custom models effectively.\nConstruct backend systems to interface with other microservices.\nTrain and optimize machine learning models for optimal performance.\nEngineer scalable machine intelligence systems and infrastructure for real-world deployment.\nJustify the application of AI/ML solutions based on problem statements.\nPrototype solutions efficiently and deliver results promptly.\nManipulate data using SQL and scripting languages.\nCollaborate with internal and external teams to design and deploy AI & ML solutions.\nExplore emerging AI & Machine learning trends and develop prototypes.\nDemonstrate effective communication and teamwork skills.\n\n\n\n\nExperience And Qualifications Required:\n\nProven experience in leading AI projects.\nProficiency in cloud deployment of AI solutions (AWS, GCP, or Azure).\nFamiliarity with Lang chain, advanced RAG applications, and Vector database.\nExperience in developing advanced Gen AI solutions.\nStrong analytical skills including data pre-processing and various ML techniques.\nExpertise in model building, optimization, and data visualization.\nKnowledge of major ML algorithms for Natural Language Processing, Computer Vision & Graph Networks.\nHands-on experience with cloud platforms like AWS/Microsoft Azure.\nProficient in SQL query development.\nFamiliarity with data platforms such as Snowflake is advantageous.\nKnowledge of MLOps (Machine Learning Operations) is a plus.\nExperience in advanced Computer Vision model development is beneficial.\nPractical experience in deep learning projects is highly valued.\nAbility to enhance the accuracy, runtime, scalability, and reliability of machine intelligence systems.\nProficient in understanding underlying mathematical concepts and algorithms.\nEnthusiasm for continuous learning of state-of-the-art techniques in ML/Data science.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "MERN Developer Intern / NodeJs/Backend Developer Intern",
    "job_id": "4281811994",
    "company_name": "Cybermind Works",
    "location": "Guindy, Chennai",
    "experience": null,
    "salary": "20,000 - 30,000 per month",
    "key_skills": [
      "MERN",
      "NodeJs",
      "Backend Development",
      "NestJS",
      "SQL",
      "NoSQL",
      "Kubernetes",
      "AWS",
      "Message queues",
      "cache",
      "RESTful API"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281811994/",
    "posted_at": null,
    "job_description": "About the job\n\nJob description\n\nStipend: 20,000 - 30,000 per month\n\nInternship Duration: 2 - 6 months (depending on candidate's availability)\n\nBenefits: Free lunch, snacks & get a chance to work on applications used by several thousands\n\nType: In office (no WFH), Full time (10 am - 6 pm)\n\nLocation: Guindy, Chennai\n\n\n\n\nCompany Description :\n\nCybermind Works partners with businesses to provide technology solutions from ideation and design to full product development and scaling up. We work on challenging projects ranging from real-time apps to high scale applications (millions of records processing)\n\n\n\n\nRole Description :\n\nWe are seeking a talented MERN Developer Intern to join our team in Chennai. As a NodeJs/Backend Developer Intern, you will help develop and maintain applications using NodeJs, nestJS, Sql/NoSQL, Kubernetes, AWS, Message queues, cache, and more. The role is a full-time on-site position in Chennai.\n\n\n\n\nQualifications :\n\nExperience with NodeJs, Databases (SQL preferred)\nGood understanding of RESTful API design and development\nKnowledge of Agile software development processes\nFamiliarity with Git version control\nStrong analytical and problem-solving skills\nStrong in Data structures & Algorithms\n\n \n\nJob Types: Full-time, Internship\n\nContract length: 6 months\n\nPay: ₹20,000.00 - ₹30,000.00 per month\n\nJob Types: Full-time, Internship",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Fullstack Web Developer (Freelance)",
    "job_id": "4281813559",
    "company_name": null,
    "location": "India",
    "experience": "3+ years",
    "salary": null,
    "key_skills": [
      "React",
      "MongoDB",
      "AWS",
      "payment gateway integration",
      "fullstack web applications"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281813559/",
    "posted_at": null,
    "job_description": "About the job\n\nWe’re looking for a freelance fullstack web developer to join us on a long-term, ongoing engagement. This is a great fit for someone seeking consistent part-time work with the opportunity to contribute meaningfully to a growing product and work closely with our internal team.\n\n\nRequirements:\nStrong experience with React, MongoDB, and AWS (3+ years atleast).\nMust have hands-on expertise in payment gateway integration\nSolid background in building and maintaining fullstack web applications\n\n\n\n\nWhat you'll do:\nCollaborate with our developers on product development\nDedicate a few consistent hours every day.\nContribute to building scalable web applications and integrating payment systems\n\n\n\n\nIf you’re looking for a stable, long-term side project and enjoy working with a collaborative team, we’d love to hear from you!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior Python Django Developer",
    "job_id": "4279885779",
    "company_name": null,
    "location": "Remote",
    "experience": "entry level",
    "salary": "₹6,000 – ₹10,000/month",
    "key_skills": [
      "Python",
      "Django",
      "PostgreSQL",
      "REST APIs",
      "HTML",
      "CSS",
      "JavaScript",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279885779/",
    "posted_at": null,
    "job_description": "About the job\n\n🚀 We're Hiring: Junior Python Django Developer (Full-Time)\n\n📍 Remote | Salary: ₹6,000 – ₹10,000/month\n\n\n\n\nAre you a passionate and self-motivated Python/Django developer just starting your career? We’re looking for a Junior Django Developer to join our growing tech team and work on exciting real-world projects.\n\n\n\n\n 👨‍💻 About the Role\n\n\n\n\n Full-time opportunity with flexible working hours.\n\n Work closely with our senior developers and product teams.\n\n Learn, build, and grow while working on real applications and SaaS platforms.\n\n\n\n\n 🧩 Responsibilities\n\n\n\n\n Develop and maintain Django-based web applications.\n\n Write clean, efficient, and reusable code.\n\n Work with PostgreSQL, REST APIs, and front-end integration (basic HTML/CSS/JS).\n\n Debug issues and assist in code reviews.\n\n Participate in team stand-ups and planning meetings.\n\n\n\n\n ✅ Requirements\n\n\n\n\n Basic knowledge of Python and Django (projects or coursework).\n\n Familiarity with Git, REST APIs, and databases (PostgreSQL/MySQL).\n\n Willingness to learn, take feedback, and adapt.\n\n Good communication skills.\n\n Must be able to commit full-time (8 hours/day).\n\n\n\n\n 💸 Salary\n\n\n\n\n ₹6,000 to ₹10,000/month based on skills and performance.\n\n Regular performance reviews and growth opportunities.\n\n\n\n\n 🎯 Ideal for\n\n\n\n\n Recent graduates or self-taught developers looking for their first real-world experience.\n\n Freelancers or interns ready to transition into a full-time role.\n\n\n\n\n💼 About Us\n\nWe are a product-based software company building modern SaaS platforms across education, video conferencing, payments, and more. You'll be part of a small, focused team where your contributions truly matter.\n\n\n\n\n📬 How to Apply\n\nSend your resume, portfolio (if any), and a short note about why you’re interested to: careers@pybex.io or DM me directly here on LinkedIn.\n\n\n\n\nLet’s build something meaningful together. If you're eager to grow with a passionate team — we’d love to hear from you!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "React Native Developer",
    "job_id": "4281807178",
    "company_name": null,
    "location": "India",
    "experience": "2+ years",
    "salary": null,
    "key_skills": [
      "React Native",
      "JavaScript",
      "TypeScript",
      "iOS",
      "Android",
      "RESTful APIs",
      "React Navigation",
      "Java",
      "Kotlin",
      "Swift",
      "Objective-C",
      "CI/CD",
      "Firebase",
      "Push Notifications",
      "Crashlytics",
      "Jest",
      "Detox"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281807178/",
    "posted_at": null,
    "job_description": "About the job\n\nResponsibilities\n\n2+ years of hands-on experience in React Native\n\nProficient in JavaScript/TypeScript\n\nSolid understanding of iOS and Android development lifecycles\n\nFamiliar with RESTful APIs and integration of third-party libraries\n\nKnowledge of native modules and bridging\n\nExperience with navigation libraries like React Navigation\n\nGood understanding of mobile app architecture and performance tuning\n\nExperience with native Android (Java/Kotlin) or iOS (Swift/Objective-C)\n\nFamiliarity with mobile CI/CD pipelines\n\nKnowledge of App Store / Play Store deployment process\n\nExposure to testing frameworks like Jest, Detox, etc.\n\nFamiliarity with tools like Firebase, Push Notifications, and Crashlytics",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Web Developer",
    "job_id": "4281803494",
    "company_name": "Examiverse",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Web Development",
      "HTML",
      "CSS",
      "JavaScript",
      "Tailwind",
      "React",
      "Node.js",
      "Python",
      "Web Design",
      "UX"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281803494/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nExamiverse is an AI-powered exam preparation platform helping students master any exam with personalized study plans, interactive visual learning, and smart practice tools. We combine advanced algorithms with engaging, visual content to simplify even the toughest topics — making learning efficient, intuitive, and fun. From SSC and UPSC to JEE, NEET, and more, Examiverse adapts to each student’s learning style. Our AI mentors, real-time analytics, and student-first approach are reimagining the future of education.\n\nRole Description\n\nWe’re looking for a talented Web Developer to join our remote-first team. This is a full-time work-from-home position, giving you the flexibility to work from anywhere while collaborating closely with our design, product, and AI engineering teams. You will be responsible for developing and maintaining both the front-end and back-end of our web applications.\n\nYour day-to-day will include coding, programming, implementing responsive designs, integrating AI-powered features, and ensuring seamless performance. You’ll also troubleshoot, optimize, and continuously enhance the platform’s functionality for a smooth student experience.\n\nQualifications\n\nStrong skills in Front-End Development (HTML, CSS, JavaScript, Tailwind, React or similar)\nProficiency in Back-End Development (Node.js, Python, or equivalent)\nSolid understanding of Web Design principles and UX best practices\nExcellent Programming & Problem-Solving skills\nAbility to work independently while collaborating effectively in a remote team\nExperience with AI integrations or EdTech platforms is a plus\nBachelor’s degree in Computer Science, Information Technology, or equivalent practical experience",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer",
    "job_id": "4282153273",
    "company_name": "SpeedChat.ai",
    "location": "Remote",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Backend Development",
      "Programming",
      "Object-Oriented Programming (OOP)",
      "AI technologies"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282153273/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nSpeedChat.ai is an AI-powered outbound sales platform designed to turn cold leads into real-time conversations. Our dynamic SmartLinks launch personalized AI conversations tailored to each lead, fixing traditional outbound issues like low email open rates and booking friction. Powered by GPT-4.0 and enriched with real-time data, SmartLinks qualify, pitch, and book meetings while you sleep. Join us to revolutionize the sales industry.\n\n\n Role Description\n \n\nThis is a full-time remote role for a Software Engineer. As a Software Engineer, you will be responsible for developing and maintaining backend systems, writing efficient code, and implementing object-oriented programming practices. You will also collaborate with cross-functional teams to design and deploy new features, troubleshoot issues, and improve system performance.\n\n\n Qualifications\n \nExpertise in Computer Science and Software Development\nProficiency in Back-End Web Development and Programming\nExperience with Object-Oriented Programming (OOP)\nStrong problem-solving skills and ability to troubleshoot complex systems\nExcellent communication and teamwork abilities\nBachelor's degree in Computer Science, Engineering, or a related field\nExperience with AI technologies and sales platforms is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Fullstack Developer",
    "job_id": "4279875773",
    "company_name": null,
    "location": "India",
    "experience": "2-3 years",
    "salary": null,
    "key_skills": [
      "Fullstack Development",
      "React",
      ".NET",
      "ASP.NET Core",
      "TypeScript",
      "RESTful APIs",
      "SQL Server"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279875773/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are looking for a talented Fullstack Developer with 2-3 years of experience in building modern web applications using React for the frontend and .NET (preferably ASP.NET Core) for the backend. You will be responsible for developing both client-side and server-side features, ensuring that the application is scalable, efficient, and user-friendly. This is an exciting opportunity for developers looking to grow their skill set in both frontend and backend technologies in a collaborative, fast-paced environment.\n\n\n\n\nResponsibilities\n\n\n\n\nFrontend Development: Build dynamic, responsive, and intuitive user interfaces using React and TypeScript, ensuring a seamless experience for the end-users.\nBackend Development: Design and develop scalable backend solutions using .NET (primarily ASP.NET Core), implementing business logic, services, and APIs.\nAPI Development & Integration: Create and integrate RESTful APIs to connect the frontend with backend services.\nDatabase Management: Work with SQL Server or other databases to design, implement, and query databases efficiently.\nCollaboration: Collaborate with UI/UX designers to implement visually appealing, interactive designs and work with backend developers to ensure full-stack integration.\nCode Quality & Best Practices: Write clean, maintainable, and efficient code, and participate in code reviews and unit testing.\nPerformance Optimization: Identify and address performance bottlenecks and optimize both frontend and backend systems for speed and efficiency.\nVersion Control: Work with Git for version control and collaborate with teams in an Agile environment.\nContinuous Learning: Stay up-to-date with emerging technologies and best practices in frontend and backend development.\n\n\n\n\nQualifications\n\n\n\n\nBachelor's degree in Computer Science, Engineering, or a related field (or equivalent experience).\n2-3 years of experience in full-stack development, specifically with:\nFrontend: React, React Router, Redux, or other state management tools, HTML5, CSS3, JavaScript/TypeScript.\nBackend: .NET, particularly ASP.NET Core, Entity Framework, and RESTful API development.\nDatabase Skills: Proficiency in relational databases like SQL Server or PostgreSQL and writing optimized queries.\nVersion Control: Experience with Git and source control platforms (GitHub, GitLab, Bitbucket).\nStrong understanding of frontend/backend integration and how to build scalable web applications.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Quantitative Developer",
    "job_id": "4281808062",
    "company_name": "Web5 Solution",
    "location": "Gurugram",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Quantitative Analytics",
      "Quantitative Finance",
      "Mathematics",
      "Statistics",
      "Python",
      "R",
      "MATLAB",
      "algorithmic trading systems"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281808062/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nAt Web5 Solution, we craft intelligent, scalable, and future-ready AI and blockchain solutions tailored to your business. Our AI-powered precision enhances efficiency, decision-making, and scalability, while our blockchain innovations provide secure, custom-built smart contracts, DeFi solutions, and tokenization frameworks that drive trust and transparency. We deeply analyze your business goals to architect high-impact solutions that integrate seamlessly. Every solution is designed, tested, and optimized for maximum security, efficiency, and adaptability, creating transformative solutions that fuel growth.\n\n\n Role Description\n \n\nThis is a full-time on-site role for a Quantitative Developer located in Gurugram. The Quantitative Developer will be responsible for developing and implementing quantitative models, conducting quantitative analytics, and providing support for trading strategies. The role involves working closely with the trading team to enhance algorithmic trading systems and conducting research in quantitative finance. The developer will also analyze market data, apply statistical methods, and ensure the mathematical integrity of financial models.\n\n\n Qualifications\n \nStrong skills in Trading, Quantitative Analytics, and Quantitative Finance\nExpertise in Mathematics and Statistics\nProficiency in programming languages such as Python, R, or MATLAB\nExperience with algorithmic trading systems and financial markets\nExcellent problem-solving and analytical thinking skills\nAbility to work collaboratively in an on-site team environment\nMaster's degree or higher in Quantitative Finance, Mathematics, Statistics, or a related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Android Developer",
    "job_id": "4281807033",
    "company_name": "Techwin Labs LLP",
    "location": "Mohali district",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Android Development",
      "Mobile Application Development",
      "Android Design",
      "Software Development",
      "RESTful APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281807033/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\n \n\nTechwin Labs LLP is committed to providing top-notch IT solutions and consultation services tailored to your business needs. We offer expertise in Mobile Application Development, UI/UX Designing, Web Development, API Development, Maintenance, and QA Services. Our highly qualified and experienced team ensures robust product development by following the SDLC Model, enabling consistent improvements and unique solutions. Based in Mohali District, Techwin Labs LLP delivers exceptional products and services, making your business stand out.\n\n\n\n\n Role Description\n\n \n\nThis is a full-time on-site role for an Android Developer, located in Mohali district. The Android Developer will be responsible for designing, developing, and maintaining mobile applications. Daily tasks include coding, testing, and debugging applications, collaborating with cross-functional teams to define and design new features, and ensuring the performance and quality of applications. The role involves staying updated with the latest industry trends and technologies to deliver innovative solutions.\n\n\n\n\n Qualifications\n\n \n\nSkills in Mobile Application Development and Mobile Applications\nExpertise in Android Design and Android Development\nProficiency in Software Development\nAbility to work effectively in a team and independently\nExcellent problem-solving and debugging skills\nGood understanding of the software development life cycle\nExperience with RESTful APIs and third-party libraries is a plus\nBachelor's degree in Computer Science, Engineering, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Wordpress Developer",
    "job_id": "4281599780",
    "company_name": "scaled.it",
    "location": "Remote",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Wordpress",
      "Front-End Development",
      "Responsive Web Design",
      "Back-End Web Development",
      "Web Design",
      "Web Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281599780/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nscaled.it is a software and hardware development firm that specializes in creating meaningful websites, apps, portals, and more. We offer services in SEO, digital marketing, SMM, and video marketing. Our approach focuses on understanding clients' requirements, developing matching strategies, and completing projects on time and within budget. Based on this method, scaled.it aims to build lasting relationships with clients by ensuring their satisfaction and encouraging repeat business.\n\n\n Role Description\n \n\nThis is a full-time remote role for a Wordpress Developer. The Wordpress Developer will be responsible for designing and developing websites using Wordpress, ensuring the sites are responsive, and providing both front-end and back-end development. Daily tasks will include coding, debugging, and optimizing the performance of the websites. The role will require collaboration with team members to deliver high-quality, scalable, and well-documented code.\n\n\n Qualifications\n \nExperience in Front-End Development and Responsive Web Design\nProficiency in Back-End Web Development\nSkills in Web Design and Web Development\nFamiliarity with Wordpress, including themes and plugins\nStrong problem-solving and analytical skills\nAbility to work independently and as part of a team\nExcellent communication skills\nBachelor's degree in Computer Science, Information Technology, or a related field is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Web Developer",
    "job_id": "4281585694",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "WordPress",
      "WooCommerce",
      "PHP",
      "Laravel",
      "server hosting",
      "domain management",
      "payment gateway integration",
      "HTML",
      "CSS",
      "JavaScript",
      "SEO"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585694/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are looking for a skilled Web Developer to join our team. The ideal candidate should be proficient in WordPress, WooCommerce, and PHP with a basic understanding of Laravel. The candidate should also have hands-on experience in server hosting and management, enabling them to handle all aspects of a website from domain purchase to full deployment.\n\nKey Responsibilities:\n\nDesign, develop, and maintain websites using WordPress and WooCommerce.\nIntegrate and manage payment gateways for smooth online transactions.\nHandle PHP-based coding to customize websites as per client needs.\nBasic working knowledge of Laravel to support advanced functionalities.\nPurchase and manage domains, setting up hosting solutions.\nOversee server hosting and management, ensuring smooth website operation.\nPerform troubleshooting, website updates, and backups.\n\nSkills & Qualifications:\n\nStrong proficiency in WordPress, WooCommerce, and PHP.\nBasic understanding of Laravel.\nExperience with payment gateway integration.\nHands-on experience in server management and hosting setup.\nAbility to purchase domains and manage the technical aspects of websites.\nStrong problem-solving skills and attention to detail.\nAbility to work independently and manage multiple tasks efficiently.\n\nPreferred:\n\nKnowledge of front-end technologies like HTML, CSS, and JavaScript.\nExperience with SEO optimization and website security best practices.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer Intern (AI/ML Full-Stack Developer Internship)",
    "job_id": "4281587475",
    "company_name": "HCDS Technologies",
    "location": "Gurugram",
    "experience": "entry level",
    "salary": "unpaid",
    "key_skills": [
      "AI",
      "Software Development",
      "Azure AI",
      "OpenAI Services",
      "Retrieval Augmented Generation (RAG)",
      "Data Vectorization",
      "Machine Learning",
      "Business Analytics",
      "Azure Infrastructure",
      "Azure Blob",
      "Azure App Services",
      "Azure Containers"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281587475/",
    "posted_at": null,
    "job_description": "About the job\n\nSoftware Engineer Intern @ Gurugram(AI/ML Full-Stack Developer Internship at HCDS Technologies)\n\n\n\n\nAre you a highly skilled undergraduate student passionate about AI and software development? HCDS Technologies invites you to an exclusive unpaid internship designed to launch your career. This isn't just an internship; it's a chance to transition your skills from academic projects to professional, enterprise-grade applications.\n\n\n\n\nWho We Are Looking For\n\n\n\n\nWe are seeking dedicated students with proven, hands-on experience in a range of advanced technologies. The ideal candidate is a self-starter who is ready to tackle complex challenges and contribute to a fast-paced, collaborative environment.\n\n\nRequired Skills and Expertise (Only Practices Not Experience)\n\n\n\n\nTo qualify for this role, you must have strong expertise in the following areas:\n\n\n\n\nAzure AI & OpenAI Services: Practical experience using Microsoft Azure's AI suite and OpenAI APIs for building intelligent features.\nRetrieval Augmented Generation (RAG): The ability to implement and fine-tune RAG pipelines to create advanced AI systems.\nData Vectorization: Experience converting raw data, such as PDFs, into vectors for effective AI training.\nMachine Learning & Business Analytics: A solid understanding of ML techniques and their application in business analytics.\nAzure Infrastructure: Proficiency with Azure Blob, Azure App Services, and Azure Containers for building and deploying scalable applications.\nFull-Stack Development: The capability to build a complete AI product and prepare it for distribution by creating APK/Downloadable Versions for the Google Play Store and Windows Application Marketplaces.\n\nA Unique Investment in Your Career\n\n\n\n\nThis internship is unpaid for the initial three-month period. We ask that you understand this is a significant investment in your professional development, providing access to resources that are typically beyond the reach of students. As a selected intern, you will gain unparalleled access to:\n\n\n\n\nGitHub Enterprise & GitHub Organization: Maximum access control for real-world collaborative development.\nEnterprise GitHub Copilot for Business: A powerful AI coding assistant to accelerate your learning and productivity.\nLinkedIn Premium: A subscription to help you build your professional network and skills.\nModern Corporate Office Exposure: Experience working in a professional environment at our Cybercity Gurugram office.\n\n\n\n\nFollowing a successful three-month period, you will be eligible for a paid internship from the fourth month onward, making this a direct pathway to a remunerated role.\n\n\nStipend between ₹18,000 to ₹50,000 Per Month May Be Considered from 4th Month Onwards!\nLogistics\n\n\n\n\nDuration: Minimum of 3 months (unpaid).\nWork Mode: Hybrid (3 days in the office, rest from home).\nWalk-in Interview: Join us on Thursday, August 14, 2025, at our Cybercity Gurugram office.\n\nIf you are ready to elevate your skills and career, we encourage you to attend the interview. We look forward to meeting you.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Machine Learning Engineer",
    "job_id": "4281586341",
    "company_name": "Webilius Technologies Pvt. Ltd.",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Machine Learning",
      "ML models",
      "algorithms",
      "neural networks",
      "TensorFlow",
      "PyTorch",
      "Pattern Recognition",
      "Computer Science",
      "Algorithms",
      "Statistics",
      "data analysis"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282132350/",
    "posted_at": null,
    "job_description": "Navigation failed after 2 attempts: Page.goto: Target page, context or browser has been closed\nCall log:\n  - navigating to \"https://in.l",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Dotnet Developer",
    "job_id": "4281537670",
    "company_name": null,
    "location": "Hyderabad",
    "experience": null,
    "salary": null,
    "key_skills": [
      ".NET",
      "C#",
      "ASP.NET",
      "MVC",
      "HTML",
      "CSS",
      "JavaScript",
      "Angular",
      "React",
      "SQL Server",
      "SDLC",
      "agile"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279870951/",
    "posted_at": null,
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Back-End Developer Intern",
    "job_id": "4281541575",
    "company_name": null,
    "location": "Coimbatore",
    "experience": "Internship / Freshers / Up to 1 year",
    "salary": null,
    "key_skills": [
      "Back-End Development",
      "Firebase",
      "Firestore",
      "Cloud Functions",
      "Authentication",
      "Storage",
      "RESTful APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281586341/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nWebilius Technologies Pvt. Ltd. is a leading software development company specializing in cutting-edge digital solutions. Our expert team delivers a range of services, including website development, mobile app development, chatbot development, digital marketing, and machine learning (ML) and artificial intelligence (AI) solutions. We focus on innovation, scalability, and performance to drive business growth and enhance user experiences. At Webilius, we work closely with clients to deliver custom solutions that exceed expectations, empowering businesses to stay ahead in a rapidly evolving digital landscape.\n\n Role Description\n \nThis is a full-time on-site role for a Machine Learning Engineer located in India. The Machine Learning Engineer will be responsible for designing and developing ML models and algorithms, conducting statistical analysis, working with neural networks, and recognizing patterns in data. Day-to-day tasks will include working on real-world ML projects, collaborating with cross-functional teams, and continuously enhancing the efficiency and accuracy of ML systems.\n\n Qualifications\n \n\nStrong understanding of Pattern Recognition and Neural Networks\nComprehensive knowledge of Computer Science and Algorithms\nProficiency in Statistics and data analysis\nExcellent problem-solving and programming skills\nAbility to work independently and collaboratively within a team\nExperience with ML frameworks and tools (e.g., TensorFlow, PyTorch) is preferred\nBachelor's or Master's degree in Computer Science, Data Science, or related field\nPrevious experience in applying ML and AI in real-world projects is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279875098/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279862482/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281537751/",
    "posted_at": "Not specified",
    "job_description": "Description not found on page",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281537670/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nRole Description\n\nThis is a full-time, on-site role for a Dotnet Developer located in Hyderabad. The Dotnet Developer will be responsible for designing, developing, and maintaining applications using .NET technology. Day-to-day tasks include coding, debugging, configuring systems, providing technical support, and collaborating with team members to ensure high-quality deliverables. The developer will also be involved in requirement analysis, testing, and documentation.\n\n\n\n\nQualifications\n\nProficiency in .NET development, C#, ASP.NET, and MVC\nExperience with front-end technologies like HTML, CSS, JavaScript, and frameworks such as Angular or React\nKnowledge of database management systems like SQL Server\nUnderstanding of software development life cycle (SDLC) and agile methodologies\nStrong problem-solving and debugging skills\nExcellent communication and teamwork abilities\nAbility to work on-site in Hyderabad\nBachelor's degree in Computer Science, Engineering, or a related field\nExperience in working with government projects or public sector is a plus\n\n\n\n\nEmail: hr@cgg.gov.in",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4281541575/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\n– Entry / Internship Level \n\n Location: Coimbatore (Remote/Onsite as needed) \n\n Experience: Internship / Freshers / Up to 1 year \n\n\n\n\n Position Overview \n\n\n\n\nWe are looking for a motivated Back-End Developer Intern with a passion for building scalable server-side solutions and a strong interest in Firebase technologies. In this role, you will work with the development team to design, build, and manage backend logic, APIs, and cloud infrastructure supporting web and mobile applications. This internship gives you hands-on exposure to real projects utilizing Firebase services, database modeling, and API development. \n\n\n\n\nKey Responsibilities \n\n\n\n\nCollaborate with front-end and mobile developers to integrate user-facing elements with server-side logic. \nDesign, develop, and maintain RESTful APIs and backend services using Firebase (Firestore, Cloud Functions, Authentication, Storage). \nImplement and optimize scalable Firestore data models and real-time data sync workflows. \nWrite clean, reusable, and efficient back-end code, adhering to security best practices. \nDebug, troubleshoot, and resolve backend issues, supporting deployment pipelines as needed. \nSet up and enforce Firebase security rules and permissions. \nStay updated on new features in Firebase and modern backend best practices. \nDocument code and assist in code reviews, contributing to team learning and improvement. \n\n\n\n\nRequired Skills & Qualifications \n\n\n\n\nCurrently pursuing or recently completed a bachelor's degree in computer science, ( B.Sc. CS/IT, AI/ML), Software Engineering, or a related field. \nGood programming skills in at least one backend language (e.g., JavaScript/TypeScript, Python, Vue.js or Node.js). \nBasic understanding of back-end development fundamentals, REST APIs, and authentication flows. \nFamiliarity with Firebase services, especially Firestore, Authentication, Cloud Functions, and Storage. \nExposure to database structure, modeling, and migration is a plus. \nExperience with version control tools (e.g., Git). \nGood problem-solving skills and a keen eye for detail. \nStrong teamwork and communication skills. \n\n\n\n\nWhy This Role Matters \n\n\n\n\nAs a Back-End Developer Intern with Firebase expertise, you’ll play a key role in ensuring seamless and scalable data operations behind the scenes of our web and mobile apps. \n\n \n\nThis role offers valuable real-world learning, allowing you to make an impact while developing strong cloud backend and API skills. \n\n \n\nJoin us to help build robust and efficient digital solutions!",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Python Developer",
    "job_id": "4281540543",
    "company_name": "Qilin Lab",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Python",
      "Django",
      "Flask",
      "HTML",
      "CSS",
      "JavaScript",
      "PostgreSQL",
      "MySQL",
      "MongoDB",
      "AWS",
      "Azure",
      "Google Cloud",
      "DevOps",
      "CI/CD",
      "Docker",
      "Kubernetes"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281540543/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nWe suggest you enter details here.\n\n\n Role Description\n \n\nThis is a full-time role for a Python Developer at Qilin Lab, located on-site in Bengaluru. The Python Developer will be responsible for developing and maintaining web applications using Python and related technologies. Day-to-day tasks include writing clean, maintainable code, collaborating with cross-functional teams, ensuring the smooth deployment of applications using DevOps practices, and maintaining cloud infrastructure. The developer will also work on both front-end and back-end components, ensuring seamless integration and optimal performance.\n\n\n Qualifications\n \nProficiency in Python and experience with web application frameworks (e.g., Django, Flask)\nSolid understanding of front-end technologies such as HTML, CSS, and JavaScript\nExperience with database systems (e.g., PostgreSQL, MySQL, MongoDB)\nKnowledge of cloud platforms and services (e.g., AWS, Azure, Google Cloud)\nExpertise in DevOps practices, including CI/CD pipelines and containerization (e.g., Docker, Kubernetes)\nStrong problem-solving skills and ability to troubleshoot and debug complex issues\nExcellent communication skills and ability to work in a collaborative team environment\nBachelor's degree in Computer Science, Engineering, or a related field or equivalent experience\nPrior experience in Full Stack Development and Cloud DevOps is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Developer",
    "job_id": "4281538697",
    "company_name": "Novus Loyalty",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Front-End Development",
      "Responsive Web Design",
      "Software Development",
      "Web Development",
      "Back-End Web Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281538697/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nNovus Loyalty offers a comprehensive, modular platform that allows you to efficiently manage the entire loyalty program lifecycle. The platform provides a wide range of features designed to help you build and implement successful marketing strategies. It is a cost-effective product available in a pay-per-use model, helping you nurture and enhance customer relationships for maximum outcomes over time.\n\n\n Role Description\n \n\nThis is a full-time hybrid role for a Frontend Developer based in Gurugram, with some work-from-home flexibility. The Frontend Developer will be responsible for creating and maintaining the user-facing features of our platform. Day-to-day tasks include developing web applications, ensuring responsive web design, collaborating with back-end developers, and participating in software development processes.\n\n\n Qualifications\n \nExperience in Front-End Development and Responsive Web Design\nProficiency in Software Development and Web Development\nBasic understanding of Back-End Web Development\nExcellent problem-solving skills and attention to detail\nStrong communication and teamwork abilities\nAbility to work independently with some tasks done remotely\nBachelor's degree in Computer Science, Engineering, or a related field\nExperience with loyalty program platforms is a plus",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Software Engineer",
    "job_id": "4281537037",
    "company_name": null,
    "location": "India",
    "experience": "1+ years",
    "salary": null,
    "key_skills": [
      "Backend development",
      "APIs",
      "microservices",
      "REST",
      "gRPC",
      "Python",
      "TypeScript",
      "Golang",
      "MongoDB",
      "DynamoDB",
      "NoSQL",
      "Git",
      "AI",
      "cybersecurity",
      "DevOps"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281537037/",
    "posted_at": null,
    "job_description": "About the job\n\nRole Overview\n\n\n\n\nWe’re seeking a backend-focused Software Engineer with a strong foundation in Backend development and a passion for building scalable, secure systems. You’ll play a core role in scaling our threat intelligence platform and integrating with real-time data pipelines and global feeds.\n\n\n\n\nWhat You’ll Do\n\n\n\n\nBuild and maintain performant backend service\nDesign and implement scalable APIs and microservices (REST/gRPC)\nCollaborate with threat intelligence and data teams for system integrations\nWrite clean, testable code and conduct peer reviews\nMonitor backend performance and debug production issues\nContribute to CI/CD pipelines and DevOps best practices\nStay updated with evolving AI, cybersecurity, and backend tech trend\n\n\n\n\nWhat We’re Looking For\n\n\n\n\n1+ years of experience in backend development (startup experience is a plus)\nProficiency in a backend framework such as Python, TypeScript, or Golang—Golang experience preferred\nFamiliarity with MongoDB, DynamoDB, or other NoSQL databases\nSolid grasp of Git workflows and modern development practices\nAwareness of software security principles\nA strong interest in exploring emerging tools like vector DBs and agent frameworks, and in conducting POCs.\nEnd-to-end ownership of your work and deliverables.\n\n\n\n\nWhy Join Us?\n\n\n\n\nBe part of a fast-growing cybersecurity company solving global challenges\nWork in a flat hierarchy with high ownership and creative freedom\nCollaborate with global threat researchers and security analysts\nGet hands-on exposure to the evolving cyber threat landscape\nFocus on continuous learning and innovation",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior MERN Stack Developer",
    "job_id": "4282176815",
    "company_name": null,
    "location": "India",
    "experience": "6 months (Internship) to 1 year",
    "salary": null,
    "key_skills": [
      "MERN stack",
      "MongoDB",
      "Express.js",
      "React.js",
      "Node.js",
      "HTML5",
      "CSS3",
      "JavaScript",
      "RESTful APIs",
      "Git",
      "GitHub"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282176815/",
    "posted_at": null,
    "job_description": "About the job\n\nPosition: Junior MERN Stack Developer\n\n Experience: 6 months (Internship) to 1 year\n\n Job Type: Full-Time\n\n Working Days: 5 Days a Week\n\n Location: Koramangala, Bangalore (On-site)\n\nAbout the Role\n\nWe are looking for a passionate and motivated Junior MERN Stack Developer with 6 months to 1 year of experience (including internship) to join our growing development team. You’ll be working on real-time projects and collaborating with a skilled team to build scalable web applications using the MERN stack.\n\nKey Responsibilities\nDevelop and maintain web applications using the MERN stack (MongoDB, Express.js, React.js, Node.js).\nBuild responsive and reusable UI components using HTML5, CSS3, JavaScript, and React.js.\nWork with RESTful APIs and collaborate with backend developers to ensure smooth data flow.\nParticipate in debugging, troubleshooting, and resolving technical issues.\nCollaborate with team members and follow best development practices.\nRequired Skills\nProficient in HTML, CSS, JavaScript.\nHands-on experience with React.js and Node.js.\nBasic knowledge of Express.js, MongoDB, and REST APIs.\nFamiliarity with version control systems like Git/GitHub.\nEagerness to learn and contribute to a team environment.\nNote\nThis opportunity is strictly for candidates who are available for a face-to-face interview in Bangalore.\nOnly apply if you can attend the interview in person.\n\n\nHow to Apply\n\nIf you meet the above criteria and are ready to take the next step in your development career, send your updated resume to\n\n 📧 anusha@sprintzeal.com",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "DevOps Engineer",
    "job_id": "4282149222",
    "company_name": "RN JobForce",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "DevOps",
      "Infrastructure as Code (IaC)",
      "Software Development",
      "CI",
      "System Administration",
      "Linux",
      "cloud platforms"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282149222/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nRN JobForce is dedicated to empowering job seekers and employers with cutting-edge job search tools and a professional community that fosters career advancement. We work collaboratively with clients to provide the best and most suitable candidates through our multi-layer candidate delivery function. Our platform specializes in technology job opportunities tailored to meet the unique needs of each user.\n\n\n Role Description\n \n\nThis is a full-time remote role for a DevOps Engineer. The DevOps Engineer will be responsible for managing and optimizing infrastructure as code (IaC), developing and maintaining software, implementing continuous integration (CI) processes, and performing system administration tasks. The role requires expertise in Linux systems and the ability to collaborate effectively with cross-functional teams to ensure smooth and efficient software delivery.\n\n\n Qualifications\n \nExperience with Infrastructure as Code (IaC) tools and practices\nStrong Software Development skills and familiarity with CI practices\nProficient in System Administration, especially in Linux environments\nExcellent problem-solving and analytical skills\nAbility to work independently and remotely\nBachelor's degree in Computer Science, Engineering, or a related field\nExperience with cloud platforms is a plus\nStrong communication and collaboration skills",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java Programmer",
    "job_id": "4281593800",
    "company_name": "CredibleSoft",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Java"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281593800/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are excited to announce that we are expanding our team and are actively seeking talented individuals to fill the position of 𝗝𝗮𝘃𝗮 𝗣𝗿𝗼𝗴𝗿𝗮𝗺𝗺𝗲𝗿𝘀 at CredibleSoft. \n\n\n\n\nIf you are passionate about designing, developing, and maintaining Java-based applications and software solutions, this could be the perfect opportunity for you. \n\n\n\n\nWe are looking for someone who not only possesses the necessary skills but also shares our values of quality-first approach.\n\n\n\n\nInterested candidates can apply here: 👉 https://lnkd.in/g5w4kMNP\n\n\n\n\nWe look forward to hearing from you and potentially working together to achieve great things. Please feel free to share this post with anyone who might be a good fit.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Web Interface Specialist",
    "job_id": "4281599111",
    "company_name": null,
    "location": "India",
    "experience": "at least two years",
    "salary": null,
    "key_skills": [
      "web technologies",
      "JavaScript frameworks",
      "Vue",
      "Angular",
      "React",
      "JavaScript",
      "HTML",
      "CSS"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281599111/",
    "posted_at": null,
    "job_description": "About the job\n\nJob description\n\nWe’re on the lookout for a creative web interface specialist with a proven track record of at least two years in building visually engaging and adaptive digital experiences. The right individual will demonstrate expertise in crafting layouts with core web technologies and have hands-on familiarity with contemporary JavaScript frameworks such as Vue, Angular, or React. A passion for intuitive design and meticulous attention to user interaction details are essential.\n\n \n\nKey Duties:\n\n \n\nFine-tune digital products for optimal load times, device compatibility, and seamless operation across browsers.\n\n \n\nCollaborate with server-side developers to connect front-end components with backend systems and external data sources.\n\n \n\nWork in tandem with designers to bring conceptual mockups to life, ensuring a smooth and intuitive journey for end users.\n\n \n\nSupport, update, and refine existing digital platforms to align with evolving best practices and user requirements.\n\n \n\nConstruct interactive and visually appealing front-end solutions using foundational web languages and tools.\n\n \n\nIdentify and resolve technical challenges to maintain robust and reliable interface performance.\n\n \n\nLeverage advanced JavaScript frameworks to deliver high-performance, scalable user applications.\n\n \n\nEngage in peer code assessments and help shape standards for quality and efficiency in development workflows.\n\n \n\nKeep abreast of the latest advancements in web development, integrating innovative techniques as appropriate.\n\n \n\nLocation: Chennai\n\nSalary: 3 LPA to 4 LPA\n\nJob type: WFO - No Hybrid or WFH\n\n\n\n\nNote: Request candidates to apply only if they are looking for a job in the above mentioned package criteria.\n\n\n\n\nPlease reach out to careers@uniqnex360.com with your resume.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior LAMP Developer",
    "job_id": "4157626033",
    "company_name": "Metropolis",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "LAMP stack",
      "WordPress",
      "Linux",
      "Apache",
      "MySQL",
      "PHP"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4157626033/",
    "posted_at": null,
    "job_description": "About the job\n\nThe Company\n\nMetropolis is an artificial intelligence company that uses computer vision technology to enable frictionless, checkout-free experiences in the real world. Today, we are reimagining parking to enable millions of consumers to just \"drive in and drive out.\" We envision a future where people transact in the real world with a speed, ease and convenience that is unparalleled, even online. Tomorrow, we will power checkout-free experiences anywhere you go to make the everyday experiences of living, working and playing remarkable - giving us back our most valuable asset, time.\n\nThe Role\n\nWe are looking for a motivated Junior LAMP Developer with experience in WordPress to join our growing team. As a Junior Developer, you will work alongside senior team members to create dynamic web applications and improve existing systems using the LAMP stack. This is a great opportunity to grow your skills while contributing to exciting projects.\n\nResponsibilities\n Develop and maintain web applications using the LAMP stack (Linux, Apache, MySQL, PHP)\n Assist in WordPress theme and plugin development, including customizations\n Work with databases, including creating and optimizing queries\n Participate in the design, development, and maintenance of web applications\n Collaborate with senior developers to troubleshoot and resolve issues\n Contribute to improving code quality and optimizing web application performance\n Ensure code meets high standards of quality, security, and efficiency\n Participate in testing and debugging activities\n Learn and adapt to new technologies and best practices in web development\n Support in server setup and deployment processes\nRequired Qualifications\n 3+ years of experience with the LAMP stack\n 1+ years of experience with WordPress, including theme and plugin development\n Strong understanding of HTML5, CSS3, and JavaScript\n Familiarity with MySQL databases and writing efficient queries\n Experience with noSql databases like mongodb\n Knowledge of PHP and its frameworks\n Strong understanding of object-oriented programming (OOP) and MVC architecture\n Familiarity with version control tools like Git\n Good problem-solving skills and attention to detail\n Strong desire to learn and grow in the field of web development\n Ability to work in a team environment and collaborate effectively\nPreferred Skills\n Experience with front-end frameworks like React\n Familiarity with content management systems beyond WordPress\n Experience with RESTful API integration\n\nWhen you join Metropolis, you’ll join a team of world-class product leaders and engineers, building an ecosystem of technologies at the intersection of parking, mobility, and real estate. Our goal is to build an inclusive culture where everyone has a voice and the best idea wins. You will play a key role in building and maintaining this culture as our organization grows. The base salary offered is determined by a number of variables, including, as appropriate, the applicant's qualifications for the position, years of relevant experience, distinctive skills, level of education attained, certifications or other professional licenses held, and the location of residence and/or place of employment. \n\n \n\nMetropolis Technologies is an equal opportunity employer. We make all hiring decisions based on merit, qualifications, and business needs, without regard to race, color, religion, sex (including gender identity, sexual orientation, or pregnancy), national origin, disability, veteran status, or any other protected characteristic under federal, state, or local law.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4281587259",
    "company_name": null,
    "location": "India",
    "experience": "2 – 4 Years",
    "salary": null,
    "key_skills": [
      "PHP",
      "CodeIgniter",
      "Angular",
      "Node.js",
      "MySQL",
      "MongoDB"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281587259/",
    "posted_at": null,
    "job_description": "About the job\n\nPosition: Full Stack Developer\n\nLocation: Remote work- General Shift.\n\nType: Full-Time \n\n\n\n\nExperience: 2 – 4 Years \n\nNP: Immediate to 15 days\n\n\n\n\nMust-Have Skills & Experience \n\n✅ PHP with CodeIgniter framework \n\n✅ Angular and Node.js \n\n✅ MySQL and MongoDB",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior Python Developer",
    "job_id": "4281583728",
    "company_name": "eShipz",
    "location": "India",
    "experience": "2-3 years",
    "salary": null,
    "key_skills": [
      "Python",
      "Flask",
      "full-stack",
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281583728/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\neShipz is revolutionizing how businesses manage their shipping processes by offering seamless multi-carrier integration. Whether you're an e-commerce brand, a manufacturer, or a logistics provider, eShipz streamlines your supply chain with real-time tracking, automated shipping labels, and cost-effective shipping rates. Our platform aims to simplify logistics, reduce shipping costs, and improve operational efficiency for businesses of all sizes located in the Greater Bengaluru Area.\n\n\n\n\nRole Summary:\n\nWe are seeking a talented and motivated Junior Python Developer with 2-3 years of professional experience to join our development team. The ideal candidate will have a strong foundation in Python and a proven track record of building web applications using the Flask framework. This role requires a full-stack mindset, as you will be involved in both back-end and front-end development, ensuring seamless integration and a great user experience.\n\nResponsibilities:\n\nDesign, develop, and maintain web applications using Python and the Flask framework.\nWrite clean, efficient, and well-documented code that is scalable and reusable.\nCollaborate with senior developers and cross-functional teams to define, design, and ship new features.\nIntegrate front-end components with server-side logic, ensuring high performance and responsiveness.\nContribute to the front-end development using technologies like HTML, CSS, and JavaScript to create intuitive and responsive user interfaces.\nWork with databases (e.g., SQL, NoSQL) to manage and retrieve data.\nParticipate in the full software development lifecycle, including requirements gathering, testing, and deployment.\nTroubleshoot, debug, and optimize applications to ensure smooth functionality and performance.\nParticipate in code reviews to maintain code quality and share best practices.\n\nRequired Skills and Qualifications:\n\nBachelor's degree in Computer Science, Software Engineering, or a related field.\n2-3 years of professional experience in Python development.\nProven experience developing web applications using the Flask framework.\nSolid understanding of core front-end technologies: HTML5, CSS3, and JavaScript.\nExperience with relational databases (e.g., PostgreSQL, MySQL) and ORM libraries.\nFamiliarity with version control systems, especially Git.\nExcellent problem-solving, analytical, and communication skills.\nAbility to work independently and collaboratively in a team environment.\n\nPreferred Skills (Nice-to-Have):\n\nExperience with a modern front-end framework or library (e.g., React, Vue, Angular).\nKnowledge of RESTful API design and implementation.\nExperience with server-side templating languages (e.g., Jinja2).\nFamiliarity with containerization tools like Docker.\nUnderstanding of authentication and authorization mechanisms.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "React.js Frontend Developer",
    "job_id": "4281581477",
    "company_name": "Delta4 Infotech Pvt. Ltd.",
    "location": "India",
    "experience": "Fresher",
    "salary": null,
    "key_skills": [
      "React.js",
      "JavaScript",
      "HTML",
      "CSS",
      "Tailwind CSS",
      "REST APIs",
      "Next.js"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281581477/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are Delta4 Infotech Pvt. Ltd., the team behind YourGPT – a next-gen AI platform.\n\nWe are looking for a Fresher React.js Frontend Developer with strong fundamentals and a passion for building fast, scalable, and modern web applications. If you have worked on projects using React.js and are confident in your frontend skills, we’d love to have you on our team.\n\nResponsibilities\n\n\nBuild responsive, interactive web applications using React.js. \nIntegrate APIs to fetch and display dynamic data effectively. \nWrite clean, efficient, and maintainable code using JavaScript, HTML, and CSS (or Tailwind CSS). \nCollaborate with the team to deliver high-quality, performant applications. \nContinuously learn and adopt modern frontend best practices and tools. \n\n\nRequirements\n\n\nGood knowledge of React.js — components, props, state, hooks, and lifecycle methods. \nStrong understanding of JavaScript, HTML, and Tailwind CSS. \nExperience working with REST APIs. \nAbility to debug, test, and optimize React applications. \nWillingness to learn and work in a collaborative environment. \n\n\nGood To Have\n\n\nExperience with Next.js. \nFamiliarity with Tailwind CSS or other CSS-in-JS libraries. \nUnderstanding of responsive design principles. \n\n\nWho Can Apply?\n\n\nFresh graduates with hands-on project experience in React.js. \nSelf-learners who have built personal or academic projects in React.js. \nDevelopers eager to work on real-world applications and grow their skills. \n\n\nHow To Apply\n\nWe care about what you’ve built, Please share:\n\n\nLinks to your projects (GitHub, CodeSandbox, personal website, etc.) \nYour portfolio (if available) \nAny relevant code samples or small applications you’ve created.\n\n\nSkills: javascript,rest apis,react.js,fresherjobs,react,tailwind css,frontend developer,css,frontend development,html",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": ".NET Developer",
    "job_id": "4208396819",
    "company_name": null,
    "location": "India",
    "experience": "2–3 years",
    "salary": "6+ Lac",
    "key_skills": [
      ".NET",
      "C#",
      "ASP.NET MVC Core",
      "Web API",
      "OOP",
      "REST APIs",
      "SQL Server",
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4208396819/",
    "posted_at": null,
    "job_description": "About the job\n\nLocation: On-Site, Vadodara, Gujarat\n\n\n\n\nSalary: 6+ Lac\n\n\n\n\nRole Overview:\n\n\n\n\na. Develop and maintain web applications using .NET (C#, ASP.NET MVC Core/Web API)\n\nb. Collaborate with cross-functional teams for design and implementation\n\nc. Write clean, scalable code and participate in code reviews\n\nd. Troubleshoot and optimize application performance\n\n\n\n\nRequirements:\n\n\n\n\na. 2–3 years of hands-on experience in .NET development\n\nb. Solid understanding of OOP, REST APIs, and SQL Server\n\nc. Familiarity with front-end technologies (HTML, CSS, JavaScript)\n\nd. Good problem-solving and communication skills",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Mobile App Developer",
    "job_id": "4281542236",
    "company_name": "Starstack Technologies Pvt. Ltd.",
    "location": "India",
    "experience": "2+ years",
    "salary": null,
    "key_skills": [
      "mobile app development",
      "Flutter",
      "React Native",
      "Dart",
      "JavaScript",
      "TypeScript",
      "RESTful APIs",
      "Android",
      "iOS",
      "BLoC",
      "Redux",
      "Provider",
      "Context API"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281542236/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nStarstack Technologies Pvt. Ltd. is a next-gen AI powered digital transformation company specializing in intelligent software solutions. By leveraging Artificial Intelligence, Immersive Experience Design, Modern Engineering, and Decentralised technologies, we deliver scalable and high-performance solutions to overcome unique business challenges.\n\n\n\n\nWhat You’ll Do\n\nDesign, develop, and maintain cross-platform mobile applications using Flutter or React Native\nCollaborate with product managers, UI/UX designers, and backend developers to deliver high-quality mobile solutions\nIntegrate mobile apps with RESTful APIs and third-party libraries\nWrite clean, scalable, and well-documented code\nConduct thorough testing and debugging to ensure smooth performance across Android and iOS devices\nParticipate in Agile sprints, code reviews, and continuous integration workflows\nStay updated with the latest in mobile technologies and contribute innovative ideas to enhance app performance and user experience\n\n\n\n\nQualifications\n\n2+ years of hands-on experience in mobile app development using Flutter or React Native\nProficiency in Dart (for Flutter) or JavaScript/TypeScript (for React Native)\nExperience publishing apps on the Google Play Store and Apple App Store\nFamiliarity with native modules, device APIs, and performance tuning for mobile applications\nSolid understanding of mobile architecture patterns such as BLoC, Redux, Provider, or Context API\nStrong experience integrating with APIs and backend services\nKnowledge of version control systems like Git and experience with CI/CD pipelines\nBachelor's degree in Computer Science, Information Technology, or a related field.\n\n\n\n\nSoft Skills\n\nStrong Communication Skills: Ability to communicate clearly and effectively in English with both technical and non-technical stakeholders\nUser-Focused Development: Passion for building user-friendly and performance-driven applications that meet real business needs\nTeam Collaboration: Able to work closely with designers, developers, and product teams to bring mobile features to life",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "MERN Stack Developer",
    "job_id": "4281990977",
    "company_name": "Zeminent",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "MERN Stack",
      "MongoDB",
      "Express.js",
      "React.js",
      "Node.js",
      "HTML",
      "CSS",
      "JavaScript",
      "RESTful APIs",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281990977/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany\n\nZeminent\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a MERN Stack Developer located in Bengaluru. The MERN Stack Developer will be responsible for designing, developing, and maintaining web applications using MongoDB, Express.js, React.js, and Node.js. Day-to-day tasks will include writing clean code, collaborating with cross-functional teams, integrating with third-party services, and ensuring high performance and responsiveness of applications. The developer will also be involved in troubleshooting and resolving technical issues as they arise.\n\n\n\n\nQualifications\n\nProficiency in MongoDB, Express.js, React.js, and Node.js\nExperience with front-end technologies such as HTML, CSS, and JavaScript\nKnowledge of RESTful APIs and web services\nStrong understanding of version control tools such as Git\nAbility to write clean, reusable, and efficient code\nExcellent problem-solving skills and attention to detail\nExperience in full-stack development\nBachelor's degree in Computer Science, Engineering, or related field\nStrong communication skills and ability to work collaboratively",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Dot Net Developer",
    "job_id": "4281537630",
    "company_name": "Traversia",
    "location": "India",
    "experience": "2-3 Years",
    "salary": null,
    "key_skills": [
      ".NET Core",
      "C#",
      "API integration"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281537630/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: Hiring Dot Net Developer\n\nLocation: Visakhapatnam, Andhra Pradesh(Work From Office)\n\nExperience: 2-3 Years \n\n \n\nResponsibilities: \n\n- Design, develop, and maintain .NET Core applications using C#. \n\n- Collaborate with cross-functional teams to gather and implement software requirements. \n\n- Write efficient, reusable, and reliable code. \n\n- Perform unit testing and debugging to ensure software quality. \n\n- Keep up-to-date with .NET Core advancements and best practices.\n\n- API integration.\n\n\n\n\nShare your resume here- talent.acquisition@traversia.net",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java Developer Intern",
    "job_id": "4279859495",
    "company_name": "Sumanju Technologies",
    "location": "India",
    "experience": "Intern",
    "salary": null,
    "key_skills": [
      "Java",
      "fintech",
      "backend systems"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279859495/",
    "posted_at": null,
    "job_description": "About the job\n\nPosition: Java Developer Intern \n\nLocation: Ahmedabad \n\nDuration: 3 Months-6 Months \n\n\n\n\nAbout Liquify: \n\nLiquify, developed by Sumanju Technologies, is a cutting-edge fintech platform that is revolutionizing investor access to liquidity through instant, paperless loans secured against mutual funds and securities. Our mission is to deliver innovative financial solutions that cater to evolving customer needs. We are seeking passionate and talented Java Developer Interns to join our tech team in Ahmedabad. \n\n\n\n\nJob Overview: As a Java Developer Intern at Liquify, you will be part of a dynamic development team working on backend systems that power our fintech platform. You will be involved in coding, debugging, and developing core features, gaining hands-on experience in Java development and exposure to fintech industry applications. Key \n\n\n\n\nResponsibilities: \n\nAssist in the design, development, and maintenance of Java-based applications and systems. \nWrite clean, efficient, and reusable code to support the backend architecture of our fintech platform. \nCollaborate with cross-functional teams, including product managers and frontend developers, to integrate user-facing elements with server-side logic. \nDebug and troubleshoot issues in existing codebases to ensure application performance and functionality. \nParticipate in code reviews and contribute to improving development processes and standards. • Assist in testing and deployment activities. \n\n\n\n\nQualifications: \n\nCurrently pursuing or recently completed B.Tech, BCA, or MCA with a specialization in Computer Science or related fields. \nStrong knowledge of Java programming and object-oriented principles. \nFamiliarity with Java frameworks such as Spring or Hibernate is a plus. \nBasic understanding of databases, SQL, and web technologies. \nAbility to work with version control systems like Git. \nStrong problem-solving skills and attention to detail. \nGood communication and teamwork skills. \n\n\n\n\nPreferred Skills: \n\nExperience with RESTful APIs and web services. \nFamiliarity with Agile development practices. \nKnowledge of front-end technologies like HTML, CSS, or JavaScript is a bonus. \n\n\n\n\nWhy Intern with Liquify? \n\nGain hands-on experience in Java development within a fast-growing fintech company. \nWork on real-world projects that directly impact product development. \nMentorship from experienced developers and exposure to cutting-edge technology. \nA collaborative and supportive working environment.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "MERN/MEAN Full Stack Developer",
    "job_id": "4281536826",
    "company_name": "StarHealth Insurance",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Full Stack Development",
      "Back-End Web Development",
      "Front-End Development",
      "CSS",
      "MERN stack",
      "MEAN stack",
      "Software Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281536826/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nStarHealth Insurance offers comprehensive insurance policies that prioritize the health and safety of your family. The plan provides protection from unforeseen situations, ensuring peace of mind for you and your loved ones.\n\n\n\n\nRole Description\n\nThis is a full-time, on-site role based in Bengaluru for a MERN/MEAN Full Stack Developer. The developer will be responsible for both front-end and back-end web development, engaging in software development, and integrating with the team to deliver high-quality solutions. Daily tasks include developing user-facing elements, building reusable code, optimizing applications for speed and scalability, and collaborating with other team members to design and launch new features.\n\n\n\n\nQualifications\n\nExperience in Back-End Web Development and understanding of Full-Stack Development\nProficiency in Front-End Development and familiarity with Cascading Style Sheets (CSS)\nStrong Software Development skills and experience with MERN/MEAN stack\nExcellent problem-solving skills and attention to detail\nAbility to work in a team-oriented, collaborative environment\nBachelor's degree in Computer Science, Engineering, or a related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Application Developer",
    "job_id": "4281343940",
    "company_name": "API Centrics",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Java",
      "Python",
      "MuleSoft",
      "Salesforce",
      "AI"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281343940/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nAPI Centrics specializes in API-led transformation and is a trusted Salesforce and MuleSoft Partner. We are a go-to shop for MuleSoft projects, boasting multiple Certified Integration Architects, Platform Architects, and Certified Mule 4 Developers\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for an Application Developer, located in Guntur. Process will be as follows\n\nTraining with Stipend - will be a software Trainee\nOnce you complete the training, - You become Software Engineer\nTwo years commitment needed\nSalary reviews every six months\n\n\n\n\n\n\n\nQualifications\n\nProgramming skills (Java or Python)\nStrong Communication Skills\nStrong problem-solving abilities and attention to detail\nStrong work Ethics\nBachelor's degree in Computer Science, Information Technology, or a related field\n\n\n\n\nTraining Areas:\n\nMuleSoft\nSalesforce\nAI",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Software Engineer",
    "job_id": "4270158913",
    "company_name": null,
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "full-stack development",
      "backend",
      "frontend",
      "cloud-based AI systems",
      "AWS",
      "Akamai",
      "Hetzner",
      "GCP",
      "Azure",
      "Linux",
      "Python",
      "CSS",
      "JavaScript",
      "APIs",
      "distributed systems",
      "cloud-native applications",
      "React",
      "Angular",
      "Vue.js",
      "open-source"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4270158913/",
    "posted_at": null,
    "job_description": "About the job\n\nWe're seeking a highly skilled Software Engineer to join our engineering team. You’ll play a key role in designing, building, and maintaining scalable cloud-based AI systems while contributing to open-source initiatives and collaborating with top talent in a technically challenging environment.\n\n\n\n\nWhat You’ll Do\n\nLead or be a significant contributor to the end-to-end development of major projects—from architecture and design to implementation, deployment, and maintenance.\nDesign and develop responsive, user-friendly front-end interfaces using modern frameworks.\nTackle complex problems in large-scale multi-cloud environments (AWS, Akamai, Hetzner).\nDrive technical excellence through research, architecture reviews, and hands-on development.\nContribute to and/or maintain open-source tools and platforms.\nCollaborate cross-functionally to build reliable, scalable, and secure systems.\n\n\n\n\nWhat We’re Looking For\n\nStrong full-stack development skills—experience in both backend and frontend technologies.\nProficiency with cloud platforms like AWS, Akamai, Hetzner, GCP, or Azure.\nHands-on experience with Linux-based systems.\nProficient in Python.\nProficiency in frontend development and solid knowledge of CSS and JavaScript.\nBackground in developing, debugging, and managing APIs, distributed systems, and cloud-native applications.\nExperience with front-end technologies like React, Angular, or Vue.js.\nFamiliarity with open-source projects—either contributing to or managing them.\nExperience applying SOLID principles in real-world software design and architecture.\nAbility to work independently and manage priorities in a remote, agile environment.\n\n\n\n\nWhy Join Us\n\nCompetitive salary plus equity options.\nFully remote with flexible working hours.\nCollaborate with industry veterans and sharpen your skills in a cutting-edge environment.\nOpportunities to contribute to cutting-edge AI and cloud-native technology and meaningful products from day one.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Developer/Intern",
    "job_id": "4282137956",
    "company_name": "Incrust Software",
    "location": "India",
    "experience": "Intern",
    "salary": null,
    "key_skills": [
      "Frontend Development",
      "React",
      "VueJs",
      "web applications",
      "responsive web design",
      "Back-End Web Development",
      "Software Development",
      "Web Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282137956/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nIncrust Software is a strategic solution provider specializing in Application Development, Maintenance, and Testing for clients globally, including the USA, UK, and South Africa. We primarily serve Small and Medium Enterprises (SMEs) by delivering high-quality software applications that meet tacit client requirements. Our collaborative approach with clients and end-users ensures timely and perfect project delivery. We are currently in the process of becoming ‘Microsoft Certified Partners’ under the Microsoft Partner Network program.\n\n\n\n\nRole Description\n\nThis is a full-time hybrid role for a Frontend Developer/Intern specializing in React and VueJs at Incrust Software. The role is located in Pune, with some work from home acceptable. Daily tasks include developing and maintaining web applications, ensuring responsive web design, collaborating with backend developers, and participating in testing and deployment processes. The role involves working closely with the technical team and clients to deliver high-quality software solutions.\n\n\n\n\nQualifications\n\nStrong skills in Front-End Development, including proficiency in React and VueJs\nKnowledge of Back-End Web Development to enable collaboration with backend developers\nGeneral proficiency in Software Development and Web Development workflows\nBachelor's degree in Computer Science, Information Technology, or a related field is a plus\nGood communication skills and the ability to work in a collaborative team environment\nAbility to manage tasks efficiently and meet project deadlines",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Node Developer",
    "job_id": "4281592562",
    "company_name": null,
    "location": "India",
    "experience": "2+ year",
    "salary": "Min 3 LPA to Max 6 LPA",
    "key_skills": [
      "NodeJS",
      "ExpressJS",
      "MySQL",
      "MongoDB",
      "AWS",
      "GoDaddy",
      "APIs",
      "Javascript",
      "WEBRTC",
      "Socket.io"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281592562/",
    "posted_at": null,
    "job_description": "About the job\n\nJob description\n\n\n\n\nHiring for Node Developer:-\n\n\n\n\nExperience- 2+ year\n\n\n\n\nSalary- Min 3 LPA to Max 6 LPA\n\n\n\n\nResponsibilities:-\n\n\n\n\nWrite clear quality code for software and applications and perform test reviews\nExcellent Knowledge of Deploying Backend on Server AWS or Godaddy.\nDevelop, implement, and test APIs.\nProvide input on software development projects\nWorked on the integration of 3rd party application like payment gateway amazon S-3 bucket, 3rd party authentication services, google, API's etc.\nHands-on knowledge on a wide range of Javascript Technology.\nBuild reusable code, modules and libraries for future use\nHands-on knowledge on a NodeJS frameworks\nExcellent knowledge of ExpressJS framework.\nExcellent Knowledge of MySQL, MongoDB database, added & test APIs on postman.\nExcellent Knowledge of WEBRTC and Socket.io\n\n\n\n\nInterested Candidates can ping me on whatsapp/call on +91-9319682826.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Developer",
    "job_id": "4282119478",
    "company_name": "HawkVision AI",
    "location": "India",
    "experience": "1–4 years",
    "salary": null,
    "key_skills": [
      "React",
      "Express",
      "Tailwind CSS"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282119478/",
    "posted_at": null,
    "job_description": "About the job\n\n🧠 We’re Hiring! Frontend Developer – Real-Time AI Dashboards – Jaipur 🇮🇳\n\n🚀 HawkVision AI | The fastest-growing AI Computer Vision company\n\n 💼 Experience: 1–4 years\n\n 📍 Location: Jaipur (On-site)\n\n 💰 Compensation: Competitive\n\n 💎 Equity: Future stock options for key employees\n\n\n🌟 Why HawkVision AI?\n\nHawkVision AI is one of the fastest-growing AI computer vision companies, already trusted by customers across Europe and India, with a bold mission to become a global leader in industrial safety technology.\n\nWe’re bootstrapped with significant founder funding, moving at the speed of a startup but with the stability of a well-funded scale-up. We work with top enterprises worldwide to solve high-stakes, real-time safety challenges—our software literally helps prevent accidents and save lives.\n\nOur team combines exceptional talent from IIM, IIT, and other leading institutions with global industry experience across the globe, bringing together people from different countries and nationalities. You’ll be joining a high-performance environment where every engineer works on cutting-edge technology with immediate real-world impact.\n\nThis is not a role for average performers—it’s a challenging position for engineers who want to accelerate their careers, work alongside elite peers, and create products used by some of the largest industrial companies in the world.\n\n\n🔧 What You’ll Do\n\n✅ Build responsive, high-performance web applications using React, Express, and Tailwind CSS\n\n ✅ Integrate REST APIs & WebSockets to deliver real-time AI-driven insights\n\n ✅ Create modular, reusable UI components for scalability and speed\n\n ✅ Work closely with backend, AI, and product teams to ensure seamless user experiences\n\n ✅ Optimize for speed, security, accessibility, and cross-browser compatibility\n\n\n✅ What We’re Looking For\n\n🔹 1–4 years of production-grade frontend development experience\n\n 🔹 Strong expertise in React, Express, and Tailwind CSS\n\n 🔹 Proficiency in state management (Redux, Context API, or similar)\n\n 🔹 Experience integrating APIs and working with live data\n\n 🔹 Track record in fast-paced, product-based environments\n\n\n🌱 Bonus Skills\n\n✨ Data visualization (D3.js, Chart.js, Recharts)\n\n ✨ AI-driven interfaces or real-time dashboard experience\n\n ✨ Experience with developer co-pilots or AI-assisted development tools\n\n\n🎁 What You’ll Get\n\n💼 The chance to work on real-time AI dashboards used globally\n\n 🌍 Exposure to top-tier enterprise clients across multiple continents\n\n 🚀 Career acceleration in a fast-growing, elite engineering team\n\n 📈 Future stock options for key contributors\n\n 🤝 Mentorship from industry leaders and IIT/IIM alumni\n\n 🎯 A high-performance culture where talent is recognised and rewarded\n\n👋 If you have the skills, ambition, and hunger—this is where you build the future.\n\n 📩 Apply via info@hawkvision.ai\n\n\n#Hiring #FrontendDeveloper #AIJobs #ComputerVision #HawkVisionAI #HighGrowthStartup #IIT #IIM #JaipurJobs",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Java Developer",
    "job_id": "4281554087",
    "company_name": null,
    "location": "India",
    "experience": "4–6 years",
    "salary": "Up to ₹14 LPA",
    "key_skills": [
      "Java",
      "Spring Boot",
      "RESTful APIs",
      "microservices",
      "Angular",
      "React",
      "Next.js",
      "CI/CD",
      "TDD",
      "DevOps"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281554087/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: Full Stack Java Developer34287\n\nLocation: Chennai\n\nWork Type: Hybrid\n\nType: Full-Time\n\nCompensation: Up to ₹14 LPA\n\nPosition Summary\n\nWe are looking for an experienced Java Full Stack Software Engineer with a strong background in designing, developing, and maintaining scalable and high-performing applications. The ideal candidate will be passionate about software craftsmanship, cloud-native technologies, and working in an Agile environment.\n\nKey Responsibilities\n\n\nCollaborate with software engineers and cross-functional teams to develop high-quality solutions. \nWork with Product Owners, Managers, and Architects to translate business requirements into technical designs. \nDesign and develop RESTful APIs and microservices to enable seamless communication across systems. \nContribute to the front-end development using modern frameworks such as Angular, React, and Next.js. \nImplement continuous integration, automation, and refactoring practices to ensure code maintainability. \nParticipate actively in Agile ceremonies including daily stand-ups, sprint planning, and retrospectives. \nPromote and adopt DevOps practices, including CI/CD, TDD, and software craftsmanship principles. \nEngage in pair programming, code reviews, and collaborative development practices. \n\n\nRequired Skills & Experience\n\n\n4–6 years of hands-on experience in full stack Java development. \nStrong knowledge of Java, Spring Boot, REST APIs, and software design patterns. \nExperience in front-end development using Angular, React, TypeScript, JavaScript, HTML5, CSS3, Next.js. \nFamiliarity with microservices and micro front-end architecture. \nExperience in developing and managing cloud-native applications, preferably on Google Cloud Platform (GCP). \nHands-on experience with CI/CD pipelines, preferably using Tekton. \nFamiliarity with Agile/Scrum methodologies. \n\n\nNice To Have\n\n\nExperience with Extreme Programming (XP) practices such as Pair/Mob Programming and Test-Driven Development (TDD). \nExposure to Progressive Web Applications (PWA). \nKnowledge of stream processing and queuing technologies like Kafka or Pub/Sub. \nA collaborative mindset and enthusiasm for building inclusive and high-performing team cultures. \n\n\nEducational Qualifications\n\n\nBachelor’s Degree in Computer Science, Engineering, or a related field (required). \n\n\nSkills: agile/scrum methodologies,html5,angular,microservices,css3,spring boot,google cloud platform (gcp),react,cloud-native applications,agile,tdd,ci/cd pipelines,rest apis,devops practices,next.js,javascript,software,typescript,java,stack",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Web Developer",
    "job_id": "4281548401",
    "company_name": null,
    "location": "India",
    "experience": "1 - 2 years",
    "salary": null,
    "key_skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "Java",
      "PHP",
      "NodeJS",
      "Python",
      "Ruby"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281548401/",
    "posted_at": null,
    "job_description": "About the job\n\nThe ideal candidate is a creative problem solver who will work in coordination with cross-functional teams to design, develop, and maintain our next generation websites and web tools. You must be comfortable working as part of a team while taking the initiative to take lead on new innovations and projects. \n\n \n\nResponsibilities\nRevise, edit, proofread & optimize web content \nWork with cross-functionally to enhance overall user experience of our platforms \nOwn various design tasks involved in the web development life cycle from start to finish\n\n\n\n\nQualifications\n\nBachelor's degree or equivalent experience in Computer Science \nAt least 1 - 2 years' of experience using HTML, CSS, and JavaScript \nProficiency in at least one server-side technology (Java, PHP, NodeJS, Python, Ruby) \nAbility to multi-task, organize, and prioritize work",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Technology Team Member",
    "job_id": "4280976081",
    "company_name": "Advance Auto Parts",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4280976081/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 2-4 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Web Developer",
    "job_id": "4281801853",
    "company_name": "Not Specified",
    "location": "Pune",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Back-End Web Development",
      "Front-End Development",
      "Web Design",
      "Web Development",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281801853/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nWe suggest you enter details here.\n\n Role Description\n \nThis is a full-time on-site role for a Web Developer located in Pune. The Web Developer will be responsible for both front-end and back-end web development tasks. Day-to-day tasks include designing, developing, and maintaining web applications, writing clean and efficient code, troubleshooting and debugging applications, collaborating with designers and other developers, and ensuring the technical feasibility of UI/UX designs.\n\n Qualifications\n \n\nProficiency in Back-End Web Development and Programming\nExperience in Front-End Development and Web Design\nStrong skills in Web Development including knowledge of various web technologies\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a team environment\nStrong understanding of responsive design principles\nBachelor's degree in Computer Science, Information Technology, or related field\nExperience with version control systems like Git is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "UI/UX Designer",
    "job_id": "4281541191",
    "company_name": "Not Specified",
    "location": "India",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "UI Design",
      "UX Design",
      "Web Design",
      "Graphic Design"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281541191/",
    "posted_at": null,
    "job_description": "About the job\n\nScope of work includes designing visually appealing and intuitive user interfaces for our web and mobile applications. Resource will be responsible for creating high-fidelity designs, designing icons and graphics, and developing a consistent design language. He/ She will collaborate with cross-functional teams to ensure design solutions meet business goals and user needs.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Not Specified",
    "job_id": "4263608674",
    "company_name": "Advance Auto Parts",
    "location": "India",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4263608674/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 1-2 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Not Specified",
    "job_id": "4280969909",
    "company_name": "Advance Auto Parts",
    "location": "India",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4280969909/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 1-2 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": ".NET Full Stack Developer",
    "job_id": "4279886740",
    "company_name": "Ek Software Pvt. Ltd.",
    "location": "Ahmedabad",
    "experience": "2–3 years",
    "salary": null,
    "key_skills": [
      ".NET",
      "ASP.NET MVC/Core",
      "C#",
      "RESTful APIs",
      "SQL Server",
      "JavaS"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279886740/",
    "posted_at": null,
    "job_description": "About the job\n\nOnly resumes sent to the HR department will be considered. Personal messages will not be eligible. Please email your application to HR@EKSOFTWARE.IN\n\n\n\n\nCompany Description\n\n\n\n\nEk Software Pvt. Ltd. is a custom software consulting and development firm based in Ahmedabad. Founded in 2014 as an extension of Cyzma LLC, our consulting firm in the USA, we specialize in delivering scalable quality solutions primarily to healthcare services organizations such as specialty pharmacies, Pharmacy Benefit Managers (PBM), as well as industries like finance and manufacturing. Our team of experienced IT professionals have real-life on-field experience in navigating the ever-changing landscape within the healthcare industry.\n\n\n\n\n\n\n\nRole Description\n\nWe are seeking a passionate and skilled .NET Full Stack Developer with 2–3 years of hands-on experience. The ideal candidate will have a strong foundation in backend development using .NET technologies and a working knowledge of modern front-end development practices. This role offers significant learning opportunities and a clear growth path toward becoming a senior full-stack engineer.\n\n\n\n\n\n\n\nKey Responsibilities\n\nTechnical Responsibilities\n\nDevelop, maintain, and enhance web applications using ASP.NET MVC/Core and C#.\n\nDesign and develop RESTful APIs, backend services, and database components.\n\nHands-on experience with SQL Server (including writing stored procedures, views, DML, DDL, and normalization concepts).\n\nWork with JavaScript, jQuery, HTML5, CSS3, and preferably a modern JavaScript framework (React, Angular, or Vue is a plus).\n\nImplement unit tests and participate in code reviews to ensure high code quality.\n\nParticipate in the full software development lifecycle (SDLC): requirement analysis, design, development, testing, deployment, and support.\n\nDebug and troubleshoot production issues and collaborate with teams for resolution.\n\nOptimize application performance and ensure scalability and security best practices.\n\n\n\n\nAnalytical & Problem Solving\n\nTranslate business requirements into technical solutions.\n\nDemonstrate strong debugging and logical reasoning skills.\n\nIdentify bottlenecks, bugs, and devise solutions to address and mitigate issues.\n\n\n\n\n\n\n\nNon-Technical & Soft Skills\n\nStrong verbal and written communication skills.\n\nAbility to work independently and collaboratively within a team.\n\nFast learner with a curiosity to explore new tools, frameworks, and best practices.\n\nFlexible to adapt to changing priorities and deliver under deadlines.\n\nA proactive attitude with a commitment to continuous improvement.\n\n\n\n\n\n\n\nAdditional Responsibilities\n\nCreate and maintain technical documentation.\n\nProvide technical support and guidance to internal stakeholders or end users.\n\nContribute to knowledge sharing and help build team best practices.\n\n\n\n\n\n\n\nPreferred Qualifications\n\nBachelor’s degree in computer science, Engineering, or a related field.\n\nHands-on experience with source control tools like Git.\n\nExposure to cloud platforms like Azure or AWS is a plus.\n\nFamiliarity",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Angular Developer",
    "job_id": "4281802996",
    "company_name": "Workelevate",
    "location": "Noida",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Angular",
      "Front-end Development",
      "APIs",
      "Software Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281802996/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nWorkelevate is a leading unified platform for Endpoint Management and Employee Experience, designed to create smarter and happier employees. The platform includes an AI IT Copilot for self-service and ticket resolution, Digital Employee Experience (DEX) for proactive engagement, Root Cause Analysis (RCA), self-healing capabilities, and Unified Endpoint Management (UEM) for device visibility, compliance, and control. Seamlessly integrating within enterprise ecosystems, Workelevate supports multilingual environments and offers flexible deployment in both SaaS and on-premises models. Trusted by global customers and recognized by industry leaders, Workelevate integrates with top ITSM platforms and is accessible via popular communication tools.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for an Angular Developer based in Noida. The Angular Developer will be responsible for developing and maintaining the front-end web applications, collaborating with back-end developers to integrate APIs, enhancing software development processes, and ensuring the overall functionality and performance of the web applications. The role requires close collaboration with cross-functional teams to ensure the delivery of high-quality solutions.\n\n\n\n\nShare Your Resume at:- riya.raj@progressive.in",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Engineer",
    "job_id": "4281592200",
    "company_name": "THAMIZHAGA CABLE TV COMMUNICATION PRIVATE LIMITED",
    "location": "Chennai",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Full-Stack Development",
      "Back-End Web Development",
      "Front-End Development",
      "CSS",
      "Software Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281592200/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nTHAMIZHAGA CABLE TV COMMUNICATION PRIVATE LIMITED is a company based out of NO. 9A, OLD NO. 5, CLUB ROAD CHETPET, CHENNAI, Tamil Nadu, India. The company focuses on providing cable TV communication services in the region.\n\n Role Description\n \nThis is a full-time on-site role for a Full Stack Engineer located in Chennai. The Full Stack Engineer will be responsible for developing both front-end and back-end components of the company’s web applications. Daily tasks will include writing clean, scalable code, optimizing performance, and troubleshooting issues across the stack. The engineer will also work on integrating user-facing elements with server-side logic and collaborating with cross-functional teams to design and implement new features.\n\n Qualifications\n \n\nProficiency in Back-End Web Development and Front-End Development\nExperience in Software Development and Full-Stack Development\nStrong knowledge of Cascading Style Sheets (CSS)\nExcellent problem-solving skills and attention to detail\nAbility to work collaboratively in a team environment\nRelevant experience working in the technology industry is a plus\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Software Engineer",
    "job_id": "4281541490",
    "company_name": "Watermark",
    "location": "India",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Full Stack Development",
      "Backend Development",
      "Frontend Development",
      "PERL",
      "PHP",
      "Ruby on Rails",
      "MySQL",
      "APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281541490/",
    "posted_at": null,
    "job_description": "About the job\n\nWatermark's mission is to equip administrators, faculty, and students worldwide with superior data, enabling them to connect information and gain insights into learning that drive meaningful improvements. With its innovative educational intelligence system, Watermark supports over 1,600 institutions globally in adopting a purposeful approach to learning, allowing them to utilize data for a comprehensive understanding of learning outcomes, faculty and staff impact, and overall institutional quality. For more details about Watermark, visit www.watermarkinsights.com. \n\n\n\n\nJob Overview: We are seeking a skilled Full Stack Software Engineer who has a solid foundation in both backend and frontend development. In this role, you will contribute to the design, development, and maintenance of web applications, working closely with a team to deliver reliable and scalable solutions. You will collaborate with cross-functional teams to meet project goals and enhance user experience while following best practices in software development. \n\nKey Responsibilities: \n\nDesign & Development: \n\n● Contribute to the design and development of web applications using PERL, PHP, Ruby on Rails, and MySQL. \n\n● Implement backend services, APIs, and databases, ensuring integration with frontend components. \n\n● Write clean, maintainable code following established coding standards and best practices. \n\n\n\n\nCollaboration & Code Review: \n\n● Work with peer developers to understand project requirements and create high-quality solutions. \n\n● Participate in code reviews, providing and receiving constructive feedback to maintain code quality. \n\n● Collaborate with product managers, designers, and other stakeholders to clarify requirements and ensure alignment with project objectives. \n\n\n\n\nTesting & Debugging: \n\n● Develop and maintain unit and integration tests to ensure the reliability of applications. \n\n● Debug and resolve issues across the stack, ensuring optimal performance and user experience. \n\n● Identify and fix bugs in a timely manner, contributing to the overall stability of the product. \n\n\n\n\nDocumentation & Communication: \n\n\n\n\n● Document code, processes, and system designs to ensure clear communication and knowledge sharing within the team. \n\n● Communicate effectively with team members and stakeholders, providing updates on progress and challenges. \n\n● Assist in creating user guides and technical documentation as needed. \n\n\n\n\nContinuous Improvement: \n\n● Stay updated on the latest technologies, tools, and trends in full stack development. \n\n● Participate in team discussions and contribute ideas to improve development processes and product quality. \n\n● Seek opportunities to learn new skills and take on increasing responsibilities within the team. \n\n\n\n\nRequired Skills & Qualifications: \n\nTechnical Expertise: \n\n● 1-3 years of experience as a Full Stack Software Engineer, with a strong focus on PERL, PHP, Ruby on Rails, jQuery, JS, HTML and MySQL. \n\n● Proficiency in backend development with Ruby on Rails, PERL, PHP, including experience with APIs and database integration. \n\n● Solid frontend development skills with jQuery, JavaScript and HTML, including experience with component design and state management. \n\n● Working knowledge of MySQL, ETL, with experience in database design and query optimization. \n\n\n\n\nSoftware Development Practices: \n\n● Experience with version control (Git) and Agile methodologies. \n\n● Familiarity with automated testing frameworks and a basic understanding of test-driven development (TDD). \n\n● Understanding of CI/CD pipelines and deployment processes. \n\n\n\n\nProblem-Solving & Communication: \n\n● Strong problem-solving skills with attention to detail. \n\n● Ability to work both independently and as part of a team. \n\n● Good communication skills, with the ability to explain technical concepts to non-technical stakeholders. \n\n\n\n\nAdditional Qualifications: \n\n● Bachelor’s degree in Computer Science, Engineering, or a related field, or equivalent practical experience. \n\n● Experience with cloud platforms (e.g., AWS, GCP) and containerization (e.g., Docker) is a plus. \n\n● A proactive approach to learning and staying current with industry development",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Python & Django Developer",
    "job_id": "4281537795",
    "company_name": "SOL9X | AVTECHFIN",
    "location": "New Delhi",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Python",
      "Django",
      "Back-End Web Development",
      "Software Development",
      "Front-End Development",
      "Databases management"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281537795/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nAt SOL9X | AVTECHFIN, we specialize in empowering businesses with a strong online presence and accelerating their growth. Our expertise spans from creating captivating websites, intuitive mobile apps, and powerful desktop applications to developing effective business strategies and marketing techniques. Committed to quality, affordability, and client satisfaction, we deliver top-notch work without compromising on price. Our streamlined processes and efficient project management ensure we meet deadlines and exceed expectations consistently. Partner with us to unlock your business's full potential in the digital era.\n\n\n Role Description\n \n\nThis is a full-time role for a Python & Django Developer based on-site in New Delhi. The Developer will be responsible for back-end web development using Python and Django, software development, front-end development, and database management. Day-to-day tasks include writing clean and efficient code, collaborating with cross-functional teams, participating in code reviews, identifying and fixing bugs, and ensuring the performance and responsiveness of applications.\n\n\n Qualifications\n \nExperience in Back-End Web Development and Software Development\nProficiency in Front-End Development and Programming\nStrong skills in Databases management\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a team environment\nExperience with Python and Django frameworks\nBachelor's degree in Computer Science, Engineering, or a related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Backend Developer (Node.js)",
    "job_id": "4279802896",
    "company_name": "AVYRO",
    "location": "Gurugram",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Backend Development",
      "Node.js",
      "Database",
      "Object-Oriented Programming (OOP)",
      "Programming",
      "Front-End Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279802896/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nAVYRO is an all-in-one Workforce Command Center designed for the Architecture, Engineering, and Construction (AEC) industry. It provides an intelligent, modular platform for managing recruitment, training, compliance, and performance tracking, specifically catering to the unique workflows of AEC teams. AVYRO streamlines processes including timesheet management, contract lifecycle management, and resource allocation, offering real-time insights through a seamless dashboard. Scalable for teams of all sizes, AVYRO adapts to both growing consultancies and large enterprises.\n\n\n Role Description\n \n\nThis is a full-time on-site role for a Backend Developer (Node.js) based in Gurugram. The Backend Developer will be responsible for developing server-side logic, defining and maintaining the central database, and ensuring high performance and responsiveness to requests from the front-end. Day-to-day tasks include integrating front-end elements with server-side logic, optimizing applications for speed and scalability, and collaborating with front-end developers.\n\n\n Qualifications\n \nProficiency in Back-End Web Development and Software Development\nStrong skills in Object-Oriented Programming (OOP)\nExperience in Programming\nBasic understanding of Front-End Development\nExcellent problem-solving skills and attention to detail\nBachelor's degree in Computer Science, Information Technology, or a related field\nExperience with Node.js and related frameworks\nGood communication skills and ability to work collaboratively",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer (NodeJS / React / TypeScript)",
    "job_id": "4281666644",
    "company_name": "Script Assist",
    "location": "Remote (India-based)",
    "experience": "2–4 years",
    "salary": null,
    "key_skills": [
      "Full Stack Development",
      "NodeJS",
      "NestJS",
      "TypeScript",
      "ReactJS",
      "RESTful APIs",
      "Database",
      "UI"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281666644/",
    "posted_at": null,
    "job_description": "About the job\n\n🚀 Full Stack Developer (NodeJS / React / TypeScript)\n\n 📍 Remote (India-based) | 🏥 Healthtech SaaS | 🕒 Full-time\n\n\n\n\nScript Assist is building the operating system for the future of private healthcare.\n\n\n\n\nWe already power over 20% of the UK’s medical cannabis market—and we’re expanding fast into GLP-1s, TRT, and other next-gen therapies. With 15%+ monthly growth, we’re the backbone behind digital clinics and pharmacies transforming how care is delivered.\n\n\n\n\nNow, we’re hiring India-based developers to help us scale.\n\n\n\n\nWhat you’ll do\n\n • Build and maintain scalable backend systems in NodeJS, NestJS, and TypeScript\n\n • Design and optimize RESTful APIs for a complex, multi-tenant health platform\n\n • Deliver real product features (not just pixel-pushing) in ReactJS + TypeScript\n\n • Own the full stack—from UI to database\n\n • Write tests, review code, and keep our standards world-class\n\n • Work closely with a fast-moving product and engineering team\n\n • Make healthcare smarter, safer, and more human—one release at a time\n\n\n\n\nWhat we’re looking for\n\n • 2–4 years of hands-on experience as a full stack or backend developer\n\n • Strong skills in NodeJS, NestJS, TypeScript\n\n • At least 2 years of real-world experience with ReactJS\n\n • Clear English, collaborative mindset, and bias to action\n\n • Bonus: experience with SaaS, healthcare, or regulated platforms\n\n\n\n\nWhy join Script Assist?\n\n ✅ Your code helps lives—not just moves pixels\n\n ✅ No fluff—real ownership, high standards, and a platform that matters\n\n ✅ Remote-friendly team with global impact\n\n ✅ Learn fast, grow faster—our ambitions are big and the mission is real\n\n\n\n\n📩 Interested?\n\n Send your CV or portfolio to [INSERT EMAIL]. We're reviewing now.\n\n#Hiring #IndiaJobs #FullStackDeveloper #NodeJS #ReactJS #NestJS #TypeScript #Healthtech #StartupJobs #RemoteJobs",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Founding Backend Engineer",
    "job_id": "4281347906",
    "company_name": "Not Specified",
    "location": "India",
    "experience": "2+ years",
    "salary": null,
    "key_skills": [
      "Backend Engineering",
      "SaaS",
      "Microservices",
      "AWS",
      "Serverless",
      "Node.js",
      "RESTful APIs",
      "IoT",
      "Unit Testing",
      "Code Reviews",
      "TypeScript",
      "Distributed Systems",
      "Relational Databases",
      "NoSQL Databases"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281347906/",
    "posted_at": null,
    "job_description": "About the job\n\nWe're looking for a talented founding backend engineer to design and build the robust foundation of our SaaS platform. You'll architect scalable microservices on AWS and implement serverless solutions. Be responsible for developing and maintaining the back-end systems and infrastructure of our platform and will collaborate with a team of engineers to design and implement scalable and efficient solutions.\n\nResponsibilities\n\n\n Design and develop highly available and performant microservices using Node.js.\n Leverage AWS services (Lambda, API Gateway, DynamoDB, etc.) to build serverless architectures.\n Implement secure and robust RESTful APIs to power the frontend experience.\n Manage data streams from IoT devices, ensuring reliable data ingestion and processing.\n Ensure code quality through unit testing and code reviews.\n Collaborate with frontend engineers and DevOps to ensure seamless integration and deployment.\n\n\nIdeal Candidate\n\n\n 2+ years of experience building backend systems in a product-based company.\n Solid foundation in Node.js and experience building scalable APIs.\n Deep understanding of AWS services, with a focus on serverless technologies.\n Experience with microservices architecture and distributed systems.\n Experience with both relational and NoSQL databases.\n Bachelor's degree in Computer Science or related field preferred but not required.\n\n\nBonus\n\n\n Experience with a type-safe language (TypeScript, Java, C++, etc.).\n Experience with monitoring and observability tools.\n Credible open-source contributions.\n\n\nSkills: Node.js,Backend Development,Lambda Expressions,Microservices,AWS,API,IOT,Code,DevOps,NOSQL,TypeScript,Java,C++,AWS Lambda,API Gateway,DynamoDB,serverless architectures,RESTful APIs",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Engineer",
    "job_id": "4281351322",
    "company_name": "Not Specified",
    "location": "India",
    "experience": "2+ years",
    "salary": null,
    "key_skills": [
      "Frontend Development",
      "JavaScript",
      "Next.js",
      "SvelteKit",
      "Nuxt.js",
      "Remix",
      "HTML",
      "CSS",
      "APIs",
      "TypeScript"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281351322/",
    "posted_at": null,
    "job_description": "About the job\n\nWe're seeking a passionate frontend engineer to join our fast-paced startup. You'll play a key role in creating intuitive, performant, and visually appealing dashboards for our SaaS product. You will be responsible for the day-to-day tasks associated with frontend development. This includes designing and implementing user interfaces, collaborating with the design team to ensure a seamless user experience, and optimizing website performance.\n\nResponsibilities\n\n\n Develop complex user interfaces using modern JavaScript frameworks like Next.js, SvelteKit, Nuxt.js, or Remix.\n Translate design mockups into functional, responsive web applications.\n Collaborate with backend engineers to integrate frontend components with APIs and data sources.\n Optimize frontend code for performance, scalability, and maintainability.\n Implement real-time data visualizations and interactive elements.\n Adopt test-driven development (TDD) practices and write unit tests.\n\n\nIdeal Candidate\n\n\n 2+ years of experience building web applications in a product-based company.\n Proficiency with HTML, CSS, and JavaScript.\n Strong experience with at least one modern frontend framework (Next.js, SvelteKit, Nuxt.js, Remix, etc.).\n Understanding of web accessibility principles and cross-browser compatibility.\n A knack for building user-centric, intuitive interfaces.\n Bachelor's degree in Computer Science or related field preferred, but not required.\n\n\nBonus\n\n\n Experience with TypeScript.\n Experience building cross-platform mobile apps with React Native or Flutter.\n Credible open-source contributions.\n\n\nSkills: User Interface Programming,Frontend Development,Next.js,Svelte,Nuxt.js,JavaScript,JavaScript Frameworks,TypeScript,Design,test-driven development,remix,SvelteKit,HTML,HTML/CSS,CSS",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer (Next.js + Firebase)",
    "job_id": "4281645742",
    "company_name": "Not Specified",
    "location": "Remote",
    "experience": "1–2 years",
    "salary": "₹30,000 INR/month",
    "key_skills": [
      "Full Stack Development",
      "Next.js",
      "React",
      "Firebase",
      "Stripe",
      "UI",
      "Tailwind CSS"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281645742/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: Full Stack Developer (Next.js + Firebase)\n\n\n\n\nLocation: Remote\n\n\n\n\nEmployment Type: Full-Time\n\n\n\n\nSalary: ₹30,000 INR/month (with performance-based raises and bonuses)\n\n\n\n\nJob Summary\n\n\n\n\nWe’re hiring a full-time developer to build and maintain our web app for a growing product. The stack includes Next.js, React, Firebase, and Stripe. You’ll work closely with the founding team to deliver fast, clean, and scalable code.\n\n\n\n\nKey Responsibilities\n\nBuild and maintain frontend with Next.js + React.\nUse Firebase (Auth, Firestore, Functions) for backend features.\nIntegrate Stripe for payments and subscriptions.\nWrite clean, responsive UI and scalable logic.\nCollaborate with founders and deliver fast iterations.\n\n\n\n\nRequired Skills\n\nStrong experience with Next.js and React.\nFamiliar with Firebase services (Firestore, Auth, Functions).\nHands-on experience with Stripe integration.\nGood understanding of web app development and deployment.\nComfortable working remotely and communicating clearly.\n\n\n\n\nPreferred Qualifications\n\n1–2 years of relevant experience.\nExperience with Tailwind CSS and Git workflows.\nFamiliar with testing and CI/CD tools.\n\n\n\n\nWhat We Offer\n\nRemote work with flexible hours.\nClose collaboration with founders.\nGrowth opportunities and bonuses.\nAccess to AI coding tools such as cursor IDE subscriptions.\nPotential for leadership and long-term role.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Python Developer (Freshers)",
    "job_id": "4282170121",
    "company_name": "Artmac Soft",
    "location": "Hyderabad, Telangana",
    "experience": "0 - 1 Year",
    "salary": null,
    "key_skills": [
      "Python",
      "Object-Oriented Programming (OOP)",
      "AI Models",
      "HTML",
      "CSS",
      "JavaScript",
      "RESTful APIs",
      "JSON/XML",
      "Git",
      "Databases",
      "AWS",
      "Azure",
      "GCP"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282170121/",
    "posted_at": null,
    "job_description": "About the job\n\nWho We Are\n\nArtmac Soft is a technology consulting and service-oriented IT company dedicated to providing innovative technology solutions and services to customers.\n\nJob Description\n\nJob Title : Python Developer (Freshers)\n\nJob Type  : Full Time\n\nExperience  : 0 - 1 Year\n\nLocation  : Hyderabad, Telangana\n\nResponsibilities\n\n\nStrong knowledge of Python programming. \nBasic understanding of OOP (Object-Oriented Programming) principles. \nStrong Knowledge on AI Models \nKnowledge of HTML, CSS, and JavaScript is an added advantage. \nGood understanding of RESTful APIs and JSON/XML. \nFamiliarity with version control systems like Git. \nBasic knowledge of databases (MySQL, PostgreSQL, MongoDB, etc.). \nStrong problem-solving skills and attention to detail. \nGood communication and interpersonal skills. \nCompleted a Python course or internship. \nKnowledge of cloud platforms like AWS, Azure, or GCP. \n\n\nQualifications\n\n\nBachelor's degree or equivalent combination of education and experience.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Developer",
    "job_id": "4281549231",
    "company_name": "Novus Loyalty",
    "location": "India",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Frontend Developer",
      "Web Interfaces",
      "HTML5",
      "CSS3",
      "JavaScript (ES6+)",
      "React.js",
      "Responsive Design",
      "Mobile-First Design",
      "RESTful APIs",
      "Git",
      "TypeScript",
      "Next.js",
      "Angular"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281549231/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout Us:\n\nNovus Loyalty is an API-first, AI-powered loyalty technology company empowering brands across the globe to build smarter, more personalized engagement programs. We serve industries including Banking, E-commerce, Retail, Travel, Automotive, and more.\n\n\n\n\nRole Overview:\n\nWe are looking for a talented Frontend Developer to join our dynamic team. The ideal candidate should have strong experience in creating responsive, high-performance, and visually appealing web interfaces.\n\n\n\n\nKey Responsibilities:\n\nDevelop and maintain user-friendly web applications using modern frontend frameworks.\nTranslate UI/UX designs into functional and efficient code.\nCollaborate with backend developers, designers, and product teams to deliver seamless solutions.\nOptimize applications for maximum speed and scalability.\nEnsure technical feasibility of UI/UX designs.\nStay up to date with emerging trends and technologies in frontend development.\n\n\n\n\nRequirements:\n\nBachelor’s degree in Computer Science, IT, or a related field.\nProven experience as a Frontend Developer or similar role.\nStrong proficiency in HTML5, CSS3, JavaScript (ES6+), and React.js (or similar frameworks).\nExperience with responsive and mobile-first design.\nFamiliarity with RESTful APIs and version control (Git).\nStrong problem-solving skills and attention to detail.\n\n\n\n\nPreferred Skills:\n\nExperience with TypeScript, Next.js, or Angular.\nUnderstanding of SEO best practices for web applications.\nKnowledge of frontend build tools and package managers (Webpack, npm, yarn).\n\n\n\n\nNote: Applications should be submitted directly through LinkedIn.\n\nFor queries only: +91 9319855118 or career@novus-loyalty.com.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Python Developer",
    "job_id": "4281806697",
    "company_name": "Ozrit",
    "location": "Hyderabad",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Python Developer",
      "Back-end Web Development",
      "Software Development",
      "Object-Oriented Programming (OOP)",
      "Programming",
      "Databases",
      "Agile Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281806697/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nWith 16 years of industry expertise and a dedicated team of over 500 professionals, Ozrit specializes in developing innovative applications and software solutions that drive business success. Combining creativity, precision, and cutting-edge technology, Ozrit delivers impactful digital experiences tailored to the unique needs of each client. Our mission is to provide high-quality and customized solutions to ensure customer satisfaction and business growth.\n\n\n Role Description\n \n\nThis is a full-time on-site role for a Python Developer located in Hyderabad. The Python Developer will be responsible for back-end web development, software development, and object-oriented programming (OOP). The developer will work closely with cross-functional teams to analyze user requirements, create and maintain efficient, reusable, and reliable Python code, and ensure the best possible performance, quality, and responsiveness of applications.\n\n\n Qualifications\n \nProficiency in Back-End Web Development and Software Development\nStrong knowledge in Object-Oriented Programming (OOP) and general Programming\nExperience working with Databases and ensuring data integrity\nExcellent problem-solving skills and attention to detail\nAbility to work collaboratively in a team environment\nBachelor's degree in Computer Science, Information Technology, or related field\nExperience in agile development methodologies is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Product Engineer – Backend (Golang)",
    "job_id": "4281811052",
    "company_name": "Kshana.ai",
    "location": "On-site",
    "experience": "0–2 years",
    "salary": null,
    "key_skills": [
      "Product Engineer",
      "Backend",
      "Golang",
      "APIs",
      "DevOps",
      "Infrastructure",
      "Cloud Platforms",
      "Docker",
      "CI/CD",
      "Kubernetes",
      "AI tooling"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281811052/",
    "posted_at": null,
    "job_description": "About the job\n\n🚀 We’re Hiring: Product Engineer – Backend (Golang)\n\n Location: On-site\n\n Type: Full-time\n\n\n\n\nWe’re building AI Equity CoAnalysts for Investment Teams — helping portfolio managers cover more, cover faster, and cover better. We’re a small, fast-moving team looking for a hands-on engineer who can own features end-to-end and ship at startup speed.\n\n\n\n\nExperience: 0–2 years\n\n\n\n\nWhat you’ll be doing:\n\nBuilding backend APIs in Golang to power product features.\nTaking features from build → test → deploy with full ownership.\nWorking on DevOps and infrastructure to keep systems running smoothly.\nCollaborating closely with founders to design, implement, and refine capabilities.\nRapidly experimenting and iterating on new ideas.\n\n\n\nWhat we’re looking for:\n\nStrong Golang skills — ideally with projects/products you’ve built.\nComfortable across the backend stack, from APIs to infrastructure.\nSelf-driven, curious, and excited to work on meaningful products.\nBonus points for exposure to cloud platforms, Docker, CI/CD, and basic Kubernetes.\nInterest in AI tooling and building agentic apps.\n\n\n\nWhy join us?\n\nBuild a product that redefines how investment teams work.\nSmall, early team = big ownership & direct impact.\nNo bureaucracy — just fast decisions and faster shipping.\nWork directly with the founders in a collaborative, high-trust environment.\nFlexible work, async-friendly, and genuinely good vibes.\n\n\n\n📩 Send your GitHub/portfolio to hr@kshana.ai\n\n 🌐 Learn more at kshana.ai",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software AI Engineer",
    "job_id": "4258070307",
    "company_name": "Netradyne",
    "location": "Bangalore",
    "experience": "2 to 3 years",
    "salary": null,
    "key_skills": [
      "Software AI Engineer",
      "Computer Vision",
      "Edge Computing",
      "AI-powered solutions",
      "Edge devices",
      "AI model integration"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4258070307/",
    "posted_at": null,
    "job_description": "About the job\n\nNetradyne harnesses the power of Computer Vision and Edge Computing to revolutionize the modern-day transportation ecosystem. We are a leader in fleet safety solutions. With growth exceeding 4x year over year, our solution is quickly being recognized as a significant disruptive technology. Our team is growing, and we need forward-thinking, uncompromising, competitive team members to continue to facilitate our growth.\n\nAbout Us\n\nNetradyne, an innovator in fleet and road safety technologies, utilizes the potential of Artificial Intelligence and Edge Computing to transform the transportation ecosystem. By adopting Netradyne's vision-based technology, organizations have achieved remarkable results, such as a 50% reduction in road accidents and over 90% decrease in dist racted driving incidents, while also excelling in other performance indicators.\n\nWith its headquarters in Bangalore and San Diego, Netradyne’s Driver\n\n\nI assists organizations in enhancing safety, boosting driver retention, increasing profitability, and facilitating transparency\n\n\n\nJob Title: Software AI Engineer\n\nExperience: 2 to 3 years\n\nRole Overview\n\nAs a Software AI Engineer in the System Optimization team, you will contribute to developing scalable, efficient AI-powered solutions deployed on edge devices. This role involves working with a multidisciplinary team to enhance software performance, optimize resource usage, and streamline AI model integration into production environments.\n\nResponsibilities\n\n\nContribute to the development of tools and frameworks for performance measurement and system optimization.\nAssist in profiling and tuning AI models and software components for deployment on edge platforms (CPU/GPU/DSP).\nSupport algorithm integration for driver monitoring and driver assistance systems.\nHelp optimize data pipelines and logging/reporting mechanisms to support real-time analytics.\nCollaborate with senior engineers to identify bottlenecks and implement efficient code.\nSupport debugging and triaging of issues in production and test environments.\n\n\n\nRequired Skills\n\n\nE/B.Tech or M.E/M.Tech in Computer Science, Electronics, Electrical, or related fields.\n2–3 years of experience in software development, preferably in embedded or IoT environments.\nGood grasp of CS fundamentals including data structures, algorithms, and operating systems.\nProficiency in at least one programming language: C/C++, Python.\nBasic knowledge of system profiling, performance tuning, or resource optimization.\nFamiliarity with ML/CV concepts and frameworks such as OpenCV, TensorFlow, PyTorch, or ONNX is a plus.\nExposure to build systems (Make/CMake), version control (Git), and CI/CD tools like Jenkins.\n\n\n\nPreferred (Good To Have)\n\n\nFamiliarity with embedded/edge computing platforms such as NVIDIA Jetson, Qualcomm Snapdragon, etc.\nExposure to ML optimization tools like TensorRT, SNPE, or OpenVino.\nUnderstanding of containerization (Docker) and orchestration (Kubernetes) environments.\nHands-on experience with Linux-based development and debugging.\n\n\n\nWe are committed to an inclusive and diverse team. Netradyne is an equal-opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status, or any legally protected status.\n\nIf there is a match between your experiences/skills and the Company's needs, we will contact you directly.\n\nNetradyne is an equal-opportunity employer.\n\nApplicants only - Recruiting agencies do not contact.\n\nRecruitment Fraud Alert!\n\nThere has been an increase in fraud that targets job seekers. Scammers may present themselves to job seekers as Netradyne employees or recruiters. Please be aware that Netradyne does not request sensitive personal data from applicants via text/instant message or any unsecured method; does not promise any advance payment for work equipment set-up and does not use recruitment or job-sourcing agencies that charge candidates an advance fee of any kind. Official communication about your application will only come from emails ending in ‘@netradyne.com’ or ‘@us-greenhouse-mail.io’.\n\nPlease review and apply to our available job openings at Netradyne.com/company/careers. For more information on avoiding and reporting scams, please visit the Federal Trade Commission's job scams website.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Web Developer (MEAN)",
    "job_id": "4281802991",
    "company_name": "Not Specified",
    "location": "India",
    "experience": "Fresher – 6 Month Experience",
    "salary": null,
    "key_skills": [
      "Full Stack Web Developer",
      "MEAN Stack",
      "MongoDB",
      "Express.js",
      "Angular 2",
      "Node.js",
      "SQL",
      "MySQL",
      "NoSQL",
      "JavaScript",
      "SVG",
      "HTML",
      "CSS",
      "AJAX"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281802991/",
    "posted_at": null,
    "job_description": "About the job\n\nFull Stack Web Developer (MEAN)\n\n\n\n\nSHIFT TIMING: Day Shift \n\nWORK MODEL: Work from Office\n\nEXPERIENCE: Fresher – 6 Month Experience\n\n \n\nRESPONSIBILITIES: \n\nDevelop and maintain web applications employing full MEAN stack (MongoDB, Express.js, Angular 2, Node.js).\nResponsible for writing server-side web application logic.\nExpertise in both SQL (MySQL) and NoSQL (MongoDB) databases to design and optimize efficient data retrieval and manipulation strategies.\nDesign customer-facing UI and backend services.\nDevelop high-performance applications using efficient reusable code.\nImplement security protocols, data protection, and storage solutions.\nDocumenting Node.js processes, including database schemas & reports.\nKeeping informed of advancements in the field of Node.js development.\nEnsure seamless application performance through expert deployment of builds, proactive server-side service management, and prompt troubleshooting of server-related issues. \n\n \n\nSKILL-SET REQUIREMENT: \n\nProven proficiency in Node.js, Angular 2, MySQL, and MongoDB.\nDevelopment experience with JavaScript, SVG, HTML, CSS, and AJAX.\nWeb stack, including protocols and web server optimization techniques.\nStrong analytical skills and problem-solving aptitude.\nCapable of building projects in Node.JS and related technologies.\nAble to create backend projects with Node.JS and related technologies.\nMust have a strong logical understanding.\nUser authentication and authorization between multiple systems, servers, and environments.\nIntegration of multiple data sources and databases into one system.\nFamiliarity with RESTful API design and implementation principles.\nExperience with cloud platforms (AWS, Azure), advanced front-end technologies (HTML5, CSS3, JavaScript frameworks), and version control systems (Git) is a plus.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior Python Developer",
    "job_id": "4279890508",
    "company_name": "AppGlide",
    "location": "Chennai",
    "experience": "1+ years",
    "salary": null,
    "key_skills": [
      "Python",
      "DevOps",
      "YAML",
      "AWS",
      "GCP",
      "Azure",
      "script design",
      "automation scripts"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279890508/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany\n\nAppGlide is a growth partner for fast growing software product companies globally. AppGlide leverages the latest technology and processes to enable SaaS companies to serve their customers better and grow faster. Based in Chennai, AppGlide is led by a team of IIT & IIM alumni.\n\n\n\n\nRole & Responsibility: \n\nWe are looking for a Junior Python Developer to join our customer's solutions engineering team. You will be working closely with customer to deploy solutions across global customer deployments.\n\n\n\n\nOur client is an industry leading AIOps platform designed to provide instant, real-time actionable insights for managing multi-domain network and application infrastructures. By bringing together multiple sources of data into one easy to use platform, IT teams can troubleshoot network issues faster, avoid downtime, reduce MTTR and improve efficiency.\n\n\n\n\nSkills:\n\n1+ years experience in python\n1+ years experience in DevOps\nBachelor’s degree or above in Computer Science / Information Technology\nYAML Expertise: Proficiency in YAML syntax and its usage for configuration and data serialization\nExposure to public cloud platforms such as AWS, GCP, and Azure\nHas a solid understanding and can demonstrate through daily tasks how the architecture, design, and data flow of the application they support for purposes of effective script design.\nCan read, develop, debug, and maintain simple to advanced automation scripts/ code Independently\n\n\n\n\nResponsibilities:\n\nBe a test expert on customer's operational analytics solution for networks, applications & security workflows;\nTake a hands-on role in the deployment of product to meet customer requirements;\nCollaborate with engineering team deployment plans for POC, and lead to completion of deployment;\nImprove the product features and quality through enhancement proposals and customer reviews.\n\n\n\n\nWhy you'll love AppGlide\n\nWe believe in a culture of mutual respect and ownership. We value employee’s work life balance and ensure you have ownership of your work streams. We invest in our employees training and development with structured learning plans.\n\n \n\nLocation\n\nThe role will be based in Chennai\n\n\n\n\n#Hiring #TechJobs #PythonJobs #DataJobs #NowHiring #JobOpening #JoinOurTeam #WeAreHiring #PythonDeveloper #PythonEngineer #PythonHiring #PythonProgrammer #DataEngineer #ETLJobs #GCPJobs #DataVisualization #OperationalAnalytics #NetworkAnalytics #CloudEngineer #DevOps #SiteReliabilityEngineering #AutomationEngineer #Ansible #Terraform #Kubernetes #Docker #CloudComputing",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Quantitative Developer",
    "job_id": "4279892160",
    "company_name": "Web5 Solutions",
    "location": "Gurgaon",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "Quantitative Developer",
      "Trading Algorithms",
      "Quantitative Analytics",
      "Quantitative Finance",
      "Back-testing",
      "Market Data",
      "Mathematics",
      "Statistics",
      "Python",
      "C++"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279892160/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nAt Web5 Solutions, we craft intelligent, scalable, and future-ready AI and blockchain solutions tailored to your business. Our AI-powered precision enhances efficiency, decision-making, and scalability with predictive analytics and intelligent automation. We specialize in secure, custom-built smart contracts, DeFi solutions, and tokenization frameworks for blockchain innovation. We deeply analyze your business goals and market dynamics to create high-impact solutions that integrate seamlessly. Every solution is designed, tested, and optimized for maximum security, efficiency, and adaptability to fuel growth.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Quantitative Developer, located in Gurgaon. The Quantitative Developer will be responsible for developing and implementing trading algorithms, conducting quantitative analytics, and performing quantitative finance tasks, including back-testing models and examining market data. Daily tasks also involve using advanced mathematics and statistics to create predictive models and support data-driven decisions.\n\n\n\n\nQualifications\n\nStrong skills in Trading and Quantitative Analytics\nExpertise in Quantitative Finance\nAdvanced understanding of Mathematics and Statistics\nSolid programming skills in relevant languages (e.g., Python, C++) and experience with financial modeling\nExcellent analytical and problem-solving abilities\nEffective communication skills to present findings and collaborate with cross-functional teams\nBachelor’s or Master’s degree in Finance, Mathematics, Statistics, Computer Science, or a related field\nExperience in the finance industry is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Quant Trading & Strategy Developer",
    "job_id": "4279868563",
    "company_name": "Dolat Capital",
    "location": "India",
    "experience": "Master’s degree",
    "salary": null,
    "key_skills": [
      "Quant Trading",
      "Strategy",
      "Derivatives",
      "Options",
      "ETFs",
      "PnL",
      "Sharpe ratios",
      "Trading Systems",
      "Low-latency",
      "High-throughput",
      "Algo Analysis",
      "Quant Analysis",
      "Python",
      "C++",
      "AI/ML",
      "Signal Detection",
      "Alpha Generation",
      "Market Prediction",
      "System Optimization",
      "Concurrent Programming",
      "TCP/UDP",
      "Network Protocols"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279868563/",
    "posted_at": null,
    "job_description": "About the job\n\n! ONLY APPLY ! If you have Master’s degree in Computer Science or Computational Finance from a U.S. university (mandatory)\n\n\n\n\nWho We Are\n\nAt Dolat Capital, we’re a team of traders, tech enthusiasts, and problem solvers driven by a passion for markets and innovation. We specialize in ultra-low latency market-making and active trading across Equities, Futures, and Options. With top-tier fill rates and cutting-edge technology, we thrive where finance meets engineering.\n\n\n\n\nResponsibilities\n\nQuant Trading & Strategy – Design and optimize high-performance strategies for derivatives, options, and ETFs. Monitor PnL and Sharpe ratios (6+), while actively identifying market inefficiencies in real time.\nTrading Systems Development – Build low-latency, high-throughput systems and simulation tools. Focus on fast execution, real-time risk, and performance tracking.\nAlgo & Quant Analysis – Use statistical methods and large-scale HFT data (Python/C++) to validate and refine strategies in live environments.\nAI/ML Integration – Develop AI/ML models for signal detection, alpha generation, and market prediction using large datasets.\nSystem & Network Optimization – Enhance system performance with deep expertise in concurrent programming, TCP/UDP, and network protocols.\nCollaboration & Mentorship – Work closely with traders, engineers, and data scientists. Represent Dolat in tech mentorship and campus events.\n\n\n\n\nQualifications\n\nEducation: B.Tech in Computer Science/IT and a Master’s degree in Computer Science or Computational Finance from a U.S. university (mandatory).\nStrong grasp of data structures, algorithms, and object-oriented programming (C++).\n1-2 years of experience.\nProficient in Python and C++, with hands-on experience in Linux systems programming.\nExperience with AI/ML frameworks such as TensorFlow, PyTorch, or Scikit-learn.\nFamiliarity with distributed systems and high-concurrency architectures.\nSolid understanding of network programming, including TCP/UDP protocols.\nExcellent analytical and problem-solving abilities, with a passion for technology-driven innovation in financial markets.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "WordPress Developer",
    "job_id": "4270175412",
    "company_name": "Not Specified",
    "location": "India",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "WordPress",
      "Elementor",
      "Theme Customization",
      "Website Maintenance",
      "CSS3",
      "JavaScript",
      "HTML5",
      "jQuery",
      "WooCommerce",
      "Website Speed Optimization"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4270175412/",
    "posted_at": null,
    "job_description": "About the job\n\nRoles & Responsibilities:\n\nWorking on full projects of WordPress website development, from scratch to finish. (Using Elementor).\n\nDelivering 100% responsive & perfect cross browser compatibility on projects.\n\nExpert knowledge about Elementor in WordPress.\n\nTheme Customization.\n\nDoing the website maintenance of existing WordPress clients & for new ones.\n\nCommunicating with client for changes in website, layout, bugs fixing and delivering the project.\n\nKnowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQuery.\n\nKnowledge of WooCommerce & Standard Features with customizations.\n\nWebsite Speed Optimization.\n\nExperience in creating multilingual websites.\n\n\n\n\nKey Requirements:\n\nEffectively meet deadlines and troubleshoot issues while handling multiple priorities.\n\nSelf-motivated with a high degree of initiative.\n\nAbility to get the job done in time with strong sense of urgency.\n\nStrong problem solving and analytical skills.\n\nDemonstrates ability to learn quickly within a continually changing, challenging environment.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "AI Fullstack Developer",
    "job_id": "4281802685",
    "company_name": "Proptelligence",
    "location": "Bengaluru",
    "experience": "Not Specified",
    "salary": null,
    "key_skills": [
      "AI Fullstack Developer",
      "Full-Stack Development",
      "Back-end Web Development",
      "Front-End Development",
      "CSS",
      "Software Development",
      "AI technologies"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281802685/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nProptelligence is an IIMK Alumni Startup Proptech Company focused on synthetic data to provide solutions for the Real Estate and Legal industries. Utilizing emerging and disruptive technologies such as AI, AR&VR, Blockchain, and IoT, Proptelligence aims to revolutionize these industries by offering innovative and efficient solutions.\n\n\n Role Description\n \n\nThis is a full-time hybrid role for an AI Fullstack Developer located in Bengaluru. The AI Fullstack Developer will be responsible for both back-end and front-end web development tasks. Regular duties include developing, testing, and deploying software, as well as collaborating with team members on a variety of projects. While working primarily in the office, some work from home is acceptable.\n\n\n Qualifications\n \nProficiency in Back-End Web Development and Full-Stack Development\nExperience in Front-End Development and working with Cascading Style Sheets (CSS)\nStrong Software Development skills\nExcellent problem-solving and analytical skills\nGood communication and teamwork abilities\nAbility to adapt to new technologies and frameworks\nExperience with AI technologies and frameworks is a plus\nBachelor's degree in Computer Science, Engineering, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Android Developer",
    "job_id": "4281597973",
    "company_name": null,
    "location": "India",
    "experience": "1 -2 Year Experience",
    "salary": null,
    "key_skills": [
      "Android development",
      "Java",
      "Kotlin",
      "Android APIs",
      "Eclipse",
      "Android SDK",
      "ADT",
      "OOPs concept",
      "JSON Parsing"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281597973/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are looking for an enthusiastic android developer with the potential to develop mobile applications.\n\nFreshers with JSON Parsing knowledge and good OOPs concept are Welcome\n\nstrong experience with native Android application development.\n\nProficient with Java and Kotlin languages and frameworks.\n\nKnowledge of Android APIs.\n\nExperience consuming web services and collaborating on API design.\n\nPassionate about mobile and tablet technology.\n\nHave good knowledge of Eclipse, Android SDK, ADT.\n\nStrong technical expertise on the Android device platform, exposure to custom UI Development.\n\n\n\n\nResponsibilities\n\nDesign and build advanced applications for the Android platform\n\nCollaborate with cross-functional teams to define, design, and ship new features\n\nWork with outside data sources and APIs\n\nUnit-test code for robustness, including edge cases, usability, and general reliability\n\nWork on bug fixing and improving application performance\n\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency\n\n\n\n\nEducational Background:\n\nB.Tech / BCA/ MCA in Computer science or IT with minimum 60 %.\n\nDiploma or Training in Computer Science or IT with minimum 60%.\n\n\n\n\nExperience: 1 -2 Year Experience\n\nLocation: Phase 8B, Mohali, Punjab, Work From office only",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Graph Database Developer",
    "job_id": "4282145485",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Graph Database",
      "Graph data modeling",
      "Cypher",
      "Gremlin",
      "SparQL",
      "Neo4j",
      "SQL",
      "RDBMS",
      "Python",
      "Spark",
      "PySpark",
      "Scala",
      "NiFi",
      "Hive",
      "NoSql DBs",
      "Network science concepts",
      "Graph algorithms"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282145485/",
    "posted_at": null,
    "job_description": "About the job\n\nRole and responsibilities\n\n\n Build Graph Database solutions leveraging large-scale datasets to solve various business use cases\n Design and build graph data models to support variety of use cases including knowledge graphs· Design and build graph database load processes to efficiently populate the graph database· Strong organizational skills, with the ability to work autonomously as well as in a team-based environment· Data pipeline framework development Technical skills requirementsThe candidate must demonstrate proficiency in,\n Solid understanding of graph data modeling, graph schema development, graph data design\n Graph data modeling (Experience with graph data models) and graph languages (Cypher, Gremlin, SparQL), exposure to various graph data modeling techniques)\n Candidate should have hands-on experience with Neo4j database and the Cypher query language\n Candidate should know basic network science concepts and graph algorithms\n Candidate should be able to write efficient & accurate Cypher queries to solve business problems\n Candidate should have a strong understanding of how graph data looks like and how it can be created from relational data\n Candidate should be able import data into Neo4j effectively and handle Neo4j database instances\n Fluency in complex SQL and experience with RDBMSs\n Project Experience in Python, Spark, PySpark, Scala, Python, NiFi, Hive, NoSql DBs\n Deep understanding of representing relational models using a graph data base for large clusters of nodes\n Relevant experience in general data base design with emphasis on graph storage models\n Should be able to write efficient & accurate Cypher queries to solve business problems\n Experience working on any Databricks would be added advantage\n Solid grounding in Agile methodologies\n Experience with git and other source control systems. Nice-to-have skills\n Neo4j Certified Developer Certification\n Design and build graph data models to support variety of use cases including knowledge graphs\n Strong delivery background across the delivery of high-value, business-facing technical projects in major organizations\n Experience of managing client delivery teams, ideally coming from a Data Engineering / Data Science environment.Qualifications\nB.Tech./M.Tech./MS or BCA/MCA degree from a reputed university",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "IoT Application Engineer",
    "job_id": "4279881423",
    "company_name": "Digital Reach Pvt. Ltd.",
    "location": "Ahmedabad, India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "IoT",
      "Embedded systems",
      "RTOS",
      "FreeRTOS",
      "Microcontrollers",
      "IDE",
      "I2C",
      "SPI",
      "Serial",
      "HAL",
      "C/C++",
      "assembly",
      "Oscilloscopes",
      "Logic analyzers",
      "Firmware"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279881423/",
    "posted_at": null,
    "job_description": "About the job\n\n \n\n🚀 We’re Hiring: IoT Application Engineer\n\n📍 Location: Ahmedabad, India\n\n 🏢 Company: Digital Reach Pvt. Ltd.\n\nAt Digital Reach Pvt. Ltd., we deliver advanced Power Utility SCADA Substation Automation Systems using proven PC-based control technology.\n\n Our solutions cover RTUs, FRTUs, I/O & fieldbus components, data communications, networking, automation software, control cabinet-free automation, and hardware for remote & feeder terminal units.\n\nWe are looking for an IoT Application Engineer with strong embedded systems expertise to help us build cutting-edge industrial IoT and automation solutions.\n\n\n\n\n\n\n\n🔹 What You’ll Be Doing\n\n· Design and develop real-time embedded software/firmware on RTOS-based platforms (FreeRTOS or similar).\n\n· Develop and integrate bootloaders for microcontroller platforms.\n\n· Work extensively with microcontrollers and related IDE toolchains.\n\n· Develop and optimize applications using I2C, SPI, Serial and other peripheral buses.\n\n· Implement and debug using HAL (Hardware Abstraction Layer).\n\n· Optimize performance on embedded platforms.\n\n· Program in C/C++ (assembly knowledge is a plus).\n\n· Use oscilloscopes, logic analyzers, and other hardware tools for debugging.\n\n· Conduct unit and functional testing for firmware releases.\n\n· Prepare and maintain technical documentation (software specs, design docs, release notes, test cases).\n\n\n\n\n\n\n\n🔹 What We’re Looking For\n\n· B.E./B.Tech in Electronics & Telecommunication, Electronics, Instrumentation, Mechatronics, or Electrical & Electronics.\n\n· Solid experience in RTOS-based application development.\n\n· Strong background in embedded software design, including low-level and high-level design.\n\n· Proven debugging and problem-solving skills for complex embedded systems.\n\n· Ability to analyze domain-specific requirements and adapt solutions accordingly.\n\n· Passion for innovation, ownership, and delivering high-quality, efficient solutions.\n\n· Familiarity with software development life cycle processes.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4282137059",
    "company_name": "Intigate Technologies",
    "location": "Noida",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Full Stack Development",
      "Front-End Development",
      "Back-End Web Development",
      "CSS",
      "Software Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282137855/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nOur Parent Organization, NEC Corporation, is a 25 billion Company with offices spread across the globe.\n\nNEC is a multinational provider of information technology (IT) services and products, headquartered in Tokyo Japan with 122 years of experience in evolution with technology and innovation. It is recognized as a ‘Top 50 Innovative Company’ globally\n\nNEC Corporation has established itself as a leader in the integration of IT and network technologies while promoting the brand statement of “Orchestrating a brighter world.”\n\nNEC enables businesses and communities to adapt to rapid changes taking place in both society and the market as it provides for the social values of safety, security, fairness and efficiency to promote a more sustainable world where everyone has the chance to reach their full potential.\n\nNEC Software Solutions (India) Private Limited! is based in Mumbai (Worli & Airoli) and Bangalore with an employee strength of 1500+.\n\nIt is one of the foremost providers of end-to-end IT services across various sectors.\n\nWe work with diverse industry verticals which include publishing, media, financial services, retail, healthcare and technology companies around the world. Our customers range from two-person startups to $bn listed companies.\n\nWe have more than 30 years of experience in providing end to end IT services across the globe and have earned a reputation for delighting our customers by consistently surpassing expectations and helping them deliver robust, market-ready software products that meet the highest standards of engineering and user experience.\n\nSupported by more than 1300 exceptionally talented manpower, we are a hub for offshore support and technology services\n\nJob Description\n\n\nInstall, configure and customise NECSWS products and solutions\nOwner/author of the implementation plan\nMain liaison channel with Client to manage the expectations for acceptance and implementation into a live environment, including agreeing acceptance criteria, overall strategy and approach. \nBecome product implementation expert on designated NECSWS products\nProduce Work Plans for customer (task by task prior plan of deployment work in each environment)\nProduce Site (Visit) Reports for customer (summary of work delivered in each environment after delivery of Work Plan)\nProvide consultancy to install and configure NECSWS solutions onto customers infrastructure/ hardware\nMaintain effective working relationships with customer and NECSWS colleagues\nEnsuring all strategies, targets and objectives related to implementation are understood by key stakeholders and the development team. \nActively involved in decision making regarding implementation planning. \nKey interface with Project manager to agree mutually acceptable decisions to resolve any issues\nLiaise with the NECSWS Project Manager to ensure implementation is to specified scope, and budgets and timescales are met. \nCarrying out implementation activities in accordance with the overall project plan. \nInternal Project-related activities as directed by the Project manager or Implementation Team manager, including supporting Development, Client Services, and QA activities. \nHands-on project-based deployment and configuration activities. \nRanging from on customer sites to within our own UK offices\nProblem solving skills called on to triage and help resolve any complications\nCan work as part of a delivery team, or work individually\nWorking in partnership with other partner companies, and customer IT services\nTargeted to achieve 75% or more billable project work\n\n\nQualifications\n\nGraduate\n\nAdditional Information",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter Software Engineer",
    "job_id": "4281589504",
    "company_name": "Digifish3",
    "location": "India",
    "experience": "2 to 5 years",
    "salary": null,
    "key_skills": [
      "Flutter",
      "Dart",
      "Mobile application development",
      "RESTful APIs",
      "Firebase",
      "State management"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4277523710/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: QAD Technical Consultant / Techno-Functional Consultant\n\nLocation: Goregaon, Mumbai (Work from Office)\n\nExperience: 2 – 4 years\n\nJob Description:\n\nWe are seeking a skilled and dynamic QAD Technical Consultant with a minimum of 2 years of experience to join our team. As a QAD Technical Consultant, you will play a vital role in the technical implementation and customization of QAD ERP solutions.\n\nResponsibilities:\n\n· Implement and customize QAD ERP solutions based on client requirements.\n\n· Develop and maintain technical documentation for customizations.\n\n· Collaborate with cross-functional teams to integrate QAD solutions with other enterprise systems.\n\n· Design and implement data interfaces and integration solutions.\n\n· Provide technical support for QAD applications, addressing issues and ensuring system stability.\n\n· Conduct troubleshooting and debugging of technical issues.\n\n· Write, modify, and maintain scripts and code to enhance QAD functionality.\n\n· Collaborate with development teams to create custom solutions.\n\n· Work closely with clients to understand technical requirements and challenges.\n\n· Collaborate with functional consultants to align technical solutions with business needs.\n\nQualifications:\n\n· Bachelor’s degree in information technology, Computer Science, or a related field.\n\n· 2-4 years of experience working with QAD ERP solutions.\n\n· Proficiency in programming languages such as Progress 4GL, Java, or others.\n\n· Strong understanding of QAD ERP architecture and modules.\n\n· Knowledge of database concepts and SQL.\n\n· Good Knowledge in Progress 4GL, CHUI, NETUI & QRF's\n\n· Experience QRF/Progress coding /Browse.\n\n \n\nPreferred Skills:\n\n· QAD certification or relevant certifications in ERP technologies.\n\n· Progress 4GL, CHUI, NETUI & QRF's\n\n· Experience with data migration and conversion processes.\n\n· Familiarity with web technologies (HTML, JavaScript, CSS).\n\n· Familiarity with linux environment.\n\n· QRF/Progress coding /Browse.\n\n· Effective communication skills with both technical and non-technical stakeholders.\n\n· Strong problem-solving and analytical skills.\n\nLocation – \n\n\n\n\nGoregaon, Mumbai\n\n\n\n\nMail your resumes at hr@alitersolutions.com",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Faculty",
    "job_id": "4265093065",
    "company_name": "ATOMS College of Media & Technology",
    "location": "Palakkad, Kerala",
    "experience": "Freshers & experienced candidates welcome",
    "salary": null,
    "key_skills": [
      "Fullstack Development",
      "Java",
      "PHP",
      "Python",
      "Pandas",
      "Power BI",
      "Tableau",
      "Data Visualization",
      "Statistics"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585953/",
    "posted_at": null,
    "job_description": "About the job\n\nAt Travel & Payments, we are looking to hire for one of our clients. While this seems like an outsourced work, but it is specialized because of two reasons:\n\nIt is in the same industry in which we do business consulting\nThe working will be the same like that of the client, based in South America & Singapore\n\n\n\n\nExperience required:\n\nMinimum 2 years\n\n\n\n\nMinimum Qualifications\n\n\n\n\n● Proficiency using Golang.\n\n● Adaptability to a constantly changing roadmap.\n\n● Demonstrated knowledge using AI tools.\n\n● Autonomy in tasks executions.\n\n● Demonstrated knowledge in unit testing\n\n● Ability to communicate complicated technical problems to both technical and business\n\naudiences.\n\n● Knowledge using SQL, Postgres\n\n● Willingness to learn new technologies and frameworks.\n\n● Entrepreneurship.\n\n● Security on OWASP.\n\n● Detail-oriented with a strategic mindset and the ability to think critically and creatively to\n\nsolve complex problems and drive business growth.\n\n● Fluency English.\n\n\n\n\nPreferred Qualifications\n\n● Experience in the payment industry.\n\n● Experience integrating Payment Service Providers.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "WordPress Developer",
    "job_id": "4279878548",
    "company_name": "ControlF5",
    "location": "Indore",
    "experience": "2 years",
    "salary": null,
    "key_skills": [
      "WordPress development",
      "Web Development",
      "Front-end development",
      "Back-end development",
      "Responsive web design",
      "eCommerce development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281593007/",
    "posted_at": null,
    "job_description": "About the job\n\nKey Responsibilities\n\n• Design, develop, and maintain robust data pipelines using Pandas and related Python libraries to process large datasets from Back Office, Accounts, and Operations units.\n\n• Architect and deploy full-stack web applications (Flask/Django-based) with features like automated reporting, email dispatch, and real-time dashboards.\n\n• Lead integration projects that consolidate siloed platforms and tools into a unified ecosystem, ensuring seamless data flow and optimized user experiences.\n\n• Collaborate on front-end design using HTML/CSS/JavaScript to create intuitive interfaces for internal users, with a focus on data visualization and accessibility.\n\n• Follow clean coding practices, maintain high test coverage, and conduct unit/integration testing to ensure reliability and maintainability.\n\n• Troubleshoot production issues, provide user training, and continuously optimize applications based on real-time feedback.\n\n\n\n\nTechnical Skillset \n\n• Expert-level Python proficiency with strong command of Pandas, NumPy, and other data processing tools • Back-end expertise using Flask, Django, or similar frameworks\n\n• Solid grasp of front-end technologies: HTML5, CSS3, JavaScript, Bootstrap (preferred)\n\n• Experience with RESTful APIs and webhooks for platform integration\n\n• Familiarity with VBA (Visual Basic for Applications) is a strong plus\n\n• Experience building interactive dashboards, data-driven workflows, and custom reporting tools\n\n• Strong debugging, version control (Git), and problem-solving skills\n\n• Working knowledge of SQL and relational databases is a bonus \n\n\n\n\nPreferred Qualifications\n\n• Bachelor's Degree in Computer Science, IT, or a related discipline\n\n• Minimum 2+ years of hands-on experience in Python application development, data manipulation, and system automation\n\n• Exposure to Agile methodologies, Jira, or related project management tools.\n\n\n\n\nThe natives of Mathura and Near Mathura will be given preference.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "SAP ABAP Developer",
    "job_id": "4281590372",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "SAP ABAP development",
      "Consulting",
      "Business Processes",
      "Master Data Management",
      "Integration skills",
      "Problem-solving",
      "Debugging"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585353/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\n\n\n\nCloud Clothing is a clothing startup that specializes in customized merchandise, including college, school, and corporate customized t-shirt and uniform orders. They are manufacturers of men's shirts, customized t-shirts, and bags, along with promotional product merchandise.\n\nRole Description\n\n\n\n\nThis is a full-time remote role for a Website Developer at Cloud Clothing. The Website Developer will be responsible for back-end and front-end web development, programming, web design, and overall web development tasks to ensure the functionality and visual appeal of the company's online platforms.\n\nQualifications\n\n\n\n\nBack-End Web Development and Programming skills\nFront-End Development and Web Design skills\nExperience in Web Development\nProficiency in creating responsive and user-friendly websites\nKnowledge of web programming\nAbility to collaborate with cross-functional teams\nStrong problem-solving skills\nBachelor's degree in Computer Science or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Go Backend Developer",
    "job_id": "4281585817",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Go programming language",
      "Backend development",
      "Unit tests",
      "Integration tests",
      "Debugging"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281594040/",
    "posted_at": null,
    "job_description": "About the job\n\nDesignation: Software Developer\n\nLocation: Bengaluru\n\n\n\n\nJob description:\n\n \n\n1. Strong experience with .NET Framework, C#, and Visual Studio.\n\n2. Experience with WinForms for Windows desktop application development.\n\n3. Knowledge of multi-threading or performance tuning.\n\n4. Knowledge of Object-Oriented Programming (OOP) principles.\n\n5. Can have knowledge of Android SDK and can create and publish APK files.\n\n6. Can handle audio driver using C#, Java and Android SDK.\n\n7. Develop and maintain Java desktop applications (using Swing/JavaFX) or Java backend services.\n\n8. Can Integrate applications with back-end services, databases, and APIs.\n\n9. Familiarity with REST APIs, JSON/XML, and web services.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "TDL Developer",
    "job_id": "4279877403",
    "company_name": "OTU India",
    "location": "Ahmedabad",
    "experience": null,
    "salary": null,
    "key_skills": [
      "TDL Developer",
      "Tally Definition Language (TDL)",
      "Tally.ERP 9",
      "software development",
      "programming concepts",
      "ERP implementation"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282138365/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are looking for a skilled and detail-oriented Automation Test Engineer with hands-on experience in Java or Python and Selenium. The ideal candidate will be responsible for designing and maintaining automation frameworks, writing test scripts, and ensuring high-quality product delivery through continuous testing.\n\nKey Responsibilities:\n\nDesign, develop, and maintain automated test scripts using Java or Python and Selenium WebDriver.\nCreate and manage reusable test frameworks for functional, regression, and integration testing.\nExecute test plans, identify bugs, and provide comprehensive test reports.\nCollaborate closely with developers, product managers, and QA team members to understand requirements and resolve issues.\nIntegrate automated tests with CI/CD pipelines using tools like Jenkins, Git, etc.\nMaintain documentation for test processes, tools, and cases.\nParticipate in code reviews and contribute to overall test strategy improvements.\nPerform root cause analysis for test failures and track defect resolution.\n\nRequired Skills:\n\n2 to 4 years of experience in automation testing.\nProficient in either Java or Python programming.\nStrong hands-on experience with Selenium WebDriver.\nFamiliarity with frameworks like TestNG, JUnit, PyTest, or similar.\nExperience with version control tools like Git.\nExposure to CI/CD tools like Jenkins, GitLab CI, or similar.\nUnderstanding of Agile/Scrum methodologies.\nGood problem-solving and analytical skills.\nExcellent communication and documentation skills.\n\nPreferred Skills (Good to Have):\n\nExperience with API testing tools like Postman, RestAssured, or SOAP UI.\nKnowledge of test management tools like JIRA, TestRail, or Zephyr.\nBasic knowledge of databases and SQL for backend validation.\nExposure to cloud platforms (AWS/Azure) is a plus.\n\nQualifications:\n\nBachelor's or Masters degree in Computer Science, Engineering, or a related field.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Oracle Cloud HCM Fast Formula Developer",
    "job_id": "4282138077",
    "company_name": "MyRemoteTeam, Inc",
    "location": "Bangalore",
    "experience": "3 Years to 5 Years",
    "salary": null,
    "key_skills": [
      "Oracle Cloud HCM",
      "Fast Formula",
      "Payroll",
      "Absence",
      "Benefits",
      "OTL",
      "Compensation",
      "Database items (DBIs)",
      "Context variables",
      "Input values"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279874861/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\n \n\nEduCerns Technologies Pvt. Ltd. is transforming taxation education through hands-on learning and industry-recognized certifications. We offer innovative business solutions to bridge the gap between education and practical application, ensuring that our users gain valuable industry skills. Located in Gwalior, we are committed to delivering impactful educational experiences to our learners.\n\n\n\n\n Role Description\n\n \n\nThis is a full-time on-site role for a React Frontend Developer based in Gwalior. The React Frontend Developer will be responsible for developing and implementing user interface components using React.js concepts and workflows such as Redux. The role includes designing and creating reusable components, working closely with back-end developers, and ensuring that the web applications are responsive and highly performant.\n\n\n\n\n Qualifications\n\n \\n\n\n \n\nStrong skills in Front-End Development and Responsive Web Design\nExperience with React.js, including state management using Redux\nProficiency in Back-End Web Development concepts\nUnderstanding of Web Development and Software Development principles\nExcellent problem-solving and debugging skills\nAbility to work on-site in Gwalior\nBachelor's degree in Computer Science, Information Technology, or related field\nExperience with version control systems like Git",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "QA Specialist (Tagging)",
    "job_id": "4281586743",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Tagging",
      "QA",
      "Adobe Analytics",
      "Adobe Launch",
      "Adobe Target",
      "Adobe Experience Platform",
      "Digital tracking",
      "Data accuracy",
      "Testing Automation"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282137059/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nIntigate Technologies is a leading global product development and digital transformation company, focused on redefining mobile experiences through transformative technology. Our team of over 150 passionate mobile experts collaborates to architect, design, and develop innovative solutions. We empower both disruptive startups and Fortune companies, bridging the gap between ideas and reality with cutting-edge technology. Our innovative work culture and forward-thinking approach has established us as one of the industry's most trusted and fastest-growing companies.\n\n Role Description\n \nThis is a full-time on-site role for a Full Stack Developer located in Noida. The Full Stack Developer will be responsible for both front-end and back-end web development tasks. Daily tasks include writing efficient code, testing, debugging, collaborating with design and product teams, and implementing new features. The role demands a solid understanding of software development and the ability to work in a fast-paced environment.\n\n Qualifications\n \n\nStrong skills in Back-End Web Development and Full-Stack Development\nProficiency in Front-End Development and Cascading Style Sheets (CSS)\nExperience in Software Development\nAbility to collaborate effectively with cross-functional teams\nExcellent problem-solving and analytical skills\nKnowledge of next-gen technologies is a plus\nBachelor's degree in Computer Science, Engineering, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Dotnet Developer",
    "job_id": "4281586759",
    "company_name": "Triangle Mind Technologies Private Limited",
    "location": "Lucknow",
    "experience": "2",
    "salary": null,
    "key_skills": [
      "Dotnet Developer",
      ".NET Core",
      "ASP.NET MVC",
      "Object-Oriented Programming (OOP)",
      "Software Development",
      "Databases"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281589504/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout Digifish3\n\nDigifish3 is a dynamic and innovative digital solutions company specializing in cutting-edge mobile and web applications. We are committed to delivering high-quality digital products that enhance user experience and business efficiency.\n\n\n\n\nJob Description\n\nWe are looking for a Flutter Software Engineer with 2 to 5 years of experience to join our talented team. The ideal candidate should have a strong understanding of Flutter development and mobile application architecture, with a passion for building seamless and scalable applications.\n\n\n\n\nKey Responsibilities:\n\nDevelop, test, and maintain high-performance Flutter applications for iOS and Android platforms.\nCollaborate with UI/UX designers to implement visually appealing and user-friendly interfaces.\nOptimize applications for performance, scalability, and responsiveness.\nWrite clean, maintainable, and efficient code following best practices and coding standards.\nDebug and resolve technical issues and application bugs.\nIntegrate third-party APIs and services as required.\nWork closely with cross-functional teams, including product managers and backend developers.\nStay updated with the latest Flutter advancements and best practices.\n\n\n\n\nRequired Skills & Qualifications:\n\n2 to 5 years of experience in Flutter app development.\nStrong understanding of Dart programming language.\nHands-on experience with RESTful APIs, Firebase, and third-party libraries.\nProficiency in state management solutions like Provider, Riverpod, Bloc, or GetX.\nExperience with Git version control and CI/CD pipelines.\nSolid understanding of mobile UI/UX principles and guidelines for both iOS and Android.\nKnowledge of native development (Kotlin, Swift) is a plus.\nStrong analytical and problem-solving skills.\nExcellent communication and teamwork skills.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Website Developer Intern",
    "job_id": "4281589230",
    "company_name": null,
    "location": "Kozhikode, Kerala",
    "experience": "Intern",
    "salary": null,
    "key_skills": [
      "Website Developer",
      "WordPress",
      "Shopify",
      "HTML",
      "CSS",
      "JavaScript",
      "PHP",
      "Responsive design",
      "SEO"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4265093065/",
    "posted_at": null,
    "job_description": "About the job\n\n💻 We’re Hiring | Software Faculty – 2 Vacancies\n\n 📍 Location: ATOMS College of Media & Technology, Near Stadium Stand, Palakkad, Kerala\n\n\n\n\nAbout the Role\n\n ATOMS College is expanding its technical education wing and is looking for skilled and enthusiastic Software Faculty members to join our team. If you're passionate about coding, data, and mentoring future tech professionals — we’d love to hear from you!\n\n\n\n\n👨‍🏫 Position: Software Faculty (2 Vacancies)\n\n\n\n\n📚 Qualification:\n\n • Any UG / PG \n\n • Proficiency in:\n\n – Fullstack Development\n\n – Java, PHP, Python (with Pandas)\n\n – Power BI / Tableau\n\n – Data Visualization, Statistics, and more\n\n • Ability to stay updated with the latest tech trends\n\n\n\n\n📝 Responsibilities:\n\n • Conduct training sessions in software development subjects\n\n • Ensure timely syllabus delivery and assignment evaluation\n\n • Guide students in projects and conduct assessments\n\n • Stay engaged with evolving industry requirements\n\n\n\n\n✅ What We’re Looking For:\n\n • Strong passion for teaching & mentoring\n\n • Quick learner with a tech-savvy mindset\n\n • Excellent communication & interpersonal skills\n\n • Good time management and multitasking ability\n\n\n\n\n🌐 Languages Required:\n\n English / Malayalam / Tamil\n\n\n\n\n🕘 Working Hours:\n\n 9:00 AM – 5:00 PM (Monday to Saturday)\n\n\n\n\n💼 Experience:\n\n Freshers & experienced candidates welcome\n\n • Attractive salary for experienced candidates\n\n • Performance-based hike after 6 months for freshers\n\n\n\n\n📞 Apply Now\n\n Contact: Shika Linto (HR Manager)\n\n 📱 9745531999 | 8086531999\n\n 📧 atomspalakkad@gmail.com\n\n 🌐 www.atomscollege.com",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "iOS Developer",
    "job_id": "4279880094",
    "company_name": "Catseye Systems & Solutions Pvt. Ltd.",
    "location": "Maharashtra, India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "iOS Developer",
      "Mobile Application Development",
      "iOS Development",
      "Software Development",
      "mobile technologies"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279878548/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nControlF5 is a full-service web and mobile app development agency driven by innovation, creativity, and performance. Based on a bold startup idea, we have evolved into a trusted digital partner for brands worldwide. We specialize in high-performance digital solutions, including WordPress websites, Shopify stores, and mobile apps. Recognized by Clutch and The Manifest, we have delivered over 4000 digital projects, making us long-term tech partners for global startups and growing brands.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a WordPress Developer with 2 years of experience located in Indore. The WordPress Developer will be responsible for developing, maintaining, and optimizing WordPress websites. Day-to-day tasks include implementing responsive designs, coding front-end interfaces, and managing back-end integrations. The role also involves troubleshooting and enhancing website performance, ensuring a seamless user experience.\n\n\n\n\nQualifications\n\nProficiency in Web Development, including back-end and front-end development\nExperience in responsive web design and web design principles\nStrong skills in WordPress development and customization\nKnowledge of web development best practices and coding standards\nExcellent problem-solving skills and attention to detail\nAbility to work collaboratively with a team\nExperience in eCommerce development is a plus\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter Developer",
    "job_id": "4279873690",
    "company_name": "NPST",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Flutter Developer",
      "Flutter",
      "Dart",
      "Scalable apps",
      "flutter plugins",
      "native (iOS/Android)"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281590372/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nWe suggest you enter details here.\n\n\n Role Description\n \n\nThis is an on-site full-time role for a SAP ABAP Developer located in India. The SAP ABAP Developer will be responsible for designing, coding, and testing ABAP programs. Daily tasks include working closely with business process owners to identify and address gaps in existing SAP functionality, developing and integrating new features, and providing technical support and troubleshooting. The role also involves creating technical specifications and documentation to ensure smooth implementation and maintenance of SAP systems.\n\n\n Qualifications\n \nStrong Analytical Skills to assess and solve complex issues effectively\nExperience in Consulting to provide expert advice and solutions\nKnowledge of Business Processes to align SAP solutions with business needs\nMaster Data Management skills to maintain and optimize key data\nIntegration skills to ensure seamless connectivity between SAP modules and other systems\nExcellent problem-solving and debugging skills\nStrong written and verbal communication skills\nBachelor's degree in Computer Science, Information Technology, or related field\nPrevious experience in SAP ABAP development is preferred",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "QAD Technical Consultant / Techno-Functional Consultant",
    "job_id": "4277523710",
    "company_name": null,
    "location": "Goregaon, Mumbai",
    "experience": "2 – 4 years",
    "salary": null,
    "key_skills": [
      "QAD ERP",
      "Technical Consultant",
      "Techno-Functional Consultant",
      "Progress 4GL",
      "Java",
      "ERP implementation",
      "Data interfaces",
      "Integration solutions"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585817/",
    "posted_at": null,
    "job_description": "About the job\n\nScope of work involves designing, developing, and maintaining scalable and efficient backend systems using the Go programming language. Resource will participate in code reviews, write unit tests and integration tests, and debug issues to ensure high-quality code. He/ She will also collaborate with cross-functional teams to ensure solutions meet business goals and user needs, and optimize the performance of backend systems for scalability and efficiency.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Golang Developer",
    "job_id": "4281585953",
    "company_name": null,
    "location": "India",
    "experience": "Minimum 2 years",
    "salary": null,
    "key_skills": [
      "Golang",
      "AI tools",
      "Unit testing",
      "SQL",
      "Postgres",
      "OWASP",
      "Golang",
      "Payment industry",
      "Payment Service Providers"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279877403/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nOTU India is a 4 years old HR tech start up. Having our own job portal, Skill platform and HRMS solutions. \n\n\n\n\n\n\n\nRole Description\n\nThis is a full-time, on-site role for a TDL Developer, located in Ahmedabad. The TDL Developer will be responsible for developing and maintaining Tally Definition Language (TDL) scripts, understanding the functional requirements of Tally. ERP 9, customizing Tally ERP 9 software as per the requirement of the company. Majority it will be a role to integrate the HRMS of OTU with Tally and its implementation.\n\n\n\n\nQualifications\n\nProficiency in Tally Definition Language (TDL), including script development and customization\nUnderstanding of Tally.ERP 9 functionalities and features\nExperience with software development and programming concepts\nStrong problem-solving and analytical skills\nExcellent written and verbal communication skills\nAbility to work independently and manage multiple tasks\nPrior experience in ERP implementation and support is a plus\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4281593007",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Python",
      "Pandas",
      "NumPy",
      "Flask",
      "Django",
      "HTML",
      "CSS",
      "JavaScript",
      "Bootstrap",
      "RESTful APIs",
      "webhooks",
      "VBA",
      "Data visualization"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282138077/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout Us\n\nMyRemoteTeam, Inc is a fast-growing distributed workforce enabler, helping companies scale with top global talent. We empower businesses by providing world-class software engineers, operations support, and infrastructure to help them grow faster and better.\n\n\n\n\nJob Title:  Oracle Cloud HCM Fast Formula Developer\n\nExperience: 3 Years to 5 Years\n\nWork Location: Affintrix Office, Bangalore\n\n\n\n\n\n\n\nJob Summary:\n\nWe are looking for an experienced Oracle Cloud HCM Fast Formula Developer who can design, develop, and maintain Fast Formulas across various HCM modules like Payroll, Absence, Benefits, OTL, and Compensation.\n\n\n\n\n\n\n\n\n\n\n\n\n\nKey Responsibilities:\n\nDevelop and manage Fast Formulas in Oracle HCM Cloud\nWrite complex logic and calculations for:\nPayroll rules\nLeave/absence plans\nBenefits eligibility\nCompensation policies\nTroubleshoot and fix formula-related issues\nUse tools like Formula Results, Messages, and Logging for testing and debugging\nWork with database items (DBIs), context variables, and input values in formulas\nCollaborate with technical and functional teams during implementations\n\nRequirements:\n\nStrong hands-on experience with Oracle Cloud HCM Fast Formulas\nGood understanding of HCM modules: Payroll, OTL, Absence, Benefits, etc.\nExperience in Oracle HCM Cloud implementation or support projects\nAbility to work with cross-functional teams",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Website Developer",
    "job_id": "4281585353",
    "company_name": "Cloud Clothing",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Website Developer",
      "Back-End Web Development",
      "Programming",
      "Front-End Development",
      "Web Design",
      "Responsive websites",
      "Web programming"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281536878/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: Graduate Apprentice Developer\n\n \n\nJob Objective:\n\n \n\nWe are seeking enthusiastic and motivated individuals to join our team as 'Graduate Apprentice Developers'. This unique opportunity offers hands-on training on real-time projects for a duration of 3 to 5 months. During the apprenticeship, you will receive comprehensive mentorship and guidance to develop your skills and kick-start your career in software development. Upon successful completion of the apprenticeship, you will be promoted to the role of 'Associate Software Developer'.\n\n \n\nRequirements/Qualifications:\n\n \n\n- B.Tech (CSE,IT,ECE,EEE), UG (Bsc. Computers) & PG MCA & MSC with Minimum 60% \n\n- Basic understanding of programming concepts and principles.\n\n- Strong problem-solving skills and attention to detail.\n\n- Excellent communication and interpersonal skills.\n\n- Ability to work independently and in a team environment.\n\n- Eagerness to learn and grow in a fast-paced, dynamic environment.\n\n \n\nResponsibilities:\n\n \n\n1. Complete a comprehensive curriculum on full-stack development through a dedicated Learning Management System (LMS) provided by the company.\n\n2. Gain a solid understanding of front-end development technologies (e.g., HTML, CSS, JavaScript frameworks like React or Angular).\n\n3. Learn back-end development concepts and languages relevant to the company's projects (e.g., Python, Java, React).\n\n4. Work on real-time software development projects alongside senior developers.\n\n5. Collaborate with senior developers to define project scope, break down tasks, and develop implementation strategies.\n\n6. Preparation for the assessment test which needs to be written after completion of the Apprentice period.\n\n \n\nPreferred Skills/Qualifications:\n\n \n\n- Good knowledge of programming languages such as Java or Python and one any Front end technology\n\n- Fundamental skills in web development technologies.\n\n- Previous internship or project experience in software development is a plus.\n\n \n\nCompensation:\n\n \n\nThe First month comes under unpaid period, as company have to observe the candidate's performance. From second month onwards the candidates will receive a monthly stipend of 13,000 INR during the apprentice period. Upon promotion to the role of Associate Software Developer, they will be offered a competitive salary ranging from 2,50,000 INR to 3,50,000 INR annually, based on their performance and contributions to the team.\n\n \n\nNote: After completion of the Apprentice period, the candidates have to clear the assessment test, then only they will be converted as Associate Software Developer.\n\n \n\nApplication Process:\n\n \n\nInterested candidates are encouraged to submit their resumes along with a cover letter highlighting their motivation and suitability for the position. Shortlisted candidates will be contacted for further interviews.\n\n \n\nRound 1 - Aptitude Test & Technical Test \n\n \n\nRound 2 - Technical Face to Face\n\n \n\nRound 3 - Technical Face to Face\n\n \n\nRound 4 - Managerial Face to Face\n\n \n\nRound 5 - CEO Round",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Developer",
    "job_id": "4281594040",
    "company_name": null,
    "location": "Bengaluru",
    "experience": null,
    "salary": null,
    "key_skills": [
      ".NET Framework",
      "C#",
      "Visual Studio",
      "WinForms",
      "multi-threading",
      "performance tuning",
      "Object-Oriented Programming (OOP)",
      "Android SDK",
      "Java",
      "desktop applications",
      "backend services",
      "REST APIs",
      "JSON/XML",
      "web services"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281586743/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Overview:\n\nWe are seeking a meticulous and detail-oriented QA Specialist with expertise in tagging to join our team. The successful candidate will play a crucial role in ensuring the accuracy and reliability of our digital tracking implementations. If you have a keen eye for detail, a passion for data accuracy, and a strong understanding of tagging technologies, we want to hear from you. We leverage Adobe ecosystem (Adobe Analytics, Adobe Launch, Adobe Target, Adobe Experience Platform).\n\nResponsibilities:\n\nTagging QA:\nConduct comprehensive quality assurance testing on digital tracking implementations, ensuring tags are firing correctly, and data is accurately captured.\nDocumentation:\nCreate and maintain detailed documentation of tagging requirements, standards, and testing procedures.\nCollaboration:\nWork closely with development teams, product managers, and digital analysts to understand tagging requirements and business objectives.\nIssue Resolution:\nIdentify and troubleshoot tagging issues promptly. Collaborate with development teams to resolve any discrepancies or bugs in tracking implementations.\nTesting Automation:\nExplore and implement automated testing tools and scripts to streamline tagging QA processes.\nPerformance Monitoring:\nMonitor and analyze tag performance and data accuracy over time. Provide insights and recommendations for improvements.\nStay Updated:\nStay abreast of industry trends, best practices, and emerging technologies related to digital tagging and analytics.\n\nRequirements:\n\nProven experience in Quality Assurance, with a focus on Adobe Analytics tagging and tracking implementations (dot com and mobile app).\nAble to pull Adobe Analytics Workspace reports to validate feature tags. \nFamiliarity with Adobe Target. \nFamiliarity with HTML, JavaScript, and other web technologies.\nStrong analytical and problem-solving skills.\nExcellent communication and collaboration skills.\nDetail-oriented and able to manage multiple tasks in a fast-paced environment.\nExperience with testing automation tools is a plus.\n\nPreferred Qualification (Automation):\n\n· Hands-on experience with PyTest, BDD framework, Appium, Python.\n\n· Experience working with Android emulators and iOS simulators.\n\n· Experience working with any cloud platform like SauceLabs, BrowserStack, or any equivalent tools.\n\n· Experience working with CICD tools like GitLabs, or any equivalent tools.\n\n· Experience working in Agile environments.\n\n· Expertise in cloud platforms like Jenkins, Azure, and GitLab, and experience integrating CI/CD pipelines.\n\n\n\n\nEducation and Experience:\n\nBachelor’s degree in computer science, Information Technology, or a related field.\n2-4 years of experience in QA, with a focus on tagging for digital analytics within Adobe ecosystem.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Automation Test Engineer",
    "job_id": "4282138365",
    "company_name": null,
    "location": "India",
    "experience": "2 to 4 years",
    "salary": null,
    "key_skills": [
      "Automation Testing",
      "Java",
      "Python",
      "Selenium WebDriver",
      "Test frameworks",
      "TestNG",
      "JUnit",
      "PyTest",
      "Git",
      "CI/CD",
      "Jenkins",
      "GitLab CI",
      "Agile/Scrum"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281586759/",
    "posted_at": null,
    "job_description": "About the job\n\nPlease APPLY only if you can come for interview.\n\n\n\n\nCompany Description\n\nTriangle Mind Technologies Private Limited is an India-based IT company with expertise in ERP, PeopleSoft, Oracle Apps, web designing, and web-applications. Our services include IT Training, Web Solutions, and Software Solutions tailored to meet clients' unique needs. We are committed to delivering value through customized IT services and solutions.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Dotnet Developer, located in Lucknow. The Dotnet Developer will be responsible for developing, configuring, and maintaining software applications using .NET technologies. Day-to-day tasks include writing clean, scalable code, collaborating with team members to design and implement software solutions, troubleshooting and debugging applications, and participating in code reviews. The developer will also be involved in creating and managing databases, ensuring performance, quality, and responsiveness of applications.\n\n\n\n\nQualifications\n\nStrong skills in Object-Oriented Programming (OOP) and Software Development\nProficiency in .NET Core and Programming\nExperience with ASP.NET MVC\nExcellent problem-solving and analytical abilities\nStrong teamwork and communication skills\nAbility to work on-site in Lucknow\nExperience in developing and maintaining enterprise-level applications is a plus\nBachelor's degree in Computer Science, Engineering, or related field\n\n\n\n\nLocation: Lucknow\n\nExperience: 2-3 years\n\nMail: ajay@trianglemind.in, trianglemindtechnology@gmail.com\n\nAddress: 5/183 A, First Floor, Vipul Khand, Near Dayal Pardise, Lucknow.\n\nVisit Us: www.trianglemind.in\n\nWhatsApp: +919648111197, 9335818839",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "React Frontend Developer",
    "job_id": "4279874861",
    "company_name": "EduCerns Technologies Pvt. Ltd.",
    "location": "Gwalior",
    "experience": null,
    "salary": null,
    "key_skills": [
      "React.js",
      "Redux",
      "Front-End Development",
      "Responsive Web Design",
      "Back-End Web Development",
      "Web Development",
      "Software Development",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281589230/",
    "posted_at": null,
    "job_description": "About the job\n\nJob description\n\n\n\n\nWe’re looking for a passionate Website Developer Intern with skills in WordPress and Shopify to join our team.Responsibilities:\n\n\n\n\nDevelop, customize, and maintain websites using WordPress and Shopify.\nImplement responsive designs and ensure website compatibility across devices.\nTroubleshoot and resolve website issues.\nCollaborate with the design and marketing teams for seamless integration of features.\nOptimize websites for performance and SEO best practices.\n\n\n\n\nQualifications\n\n\n\n\nBasic knowledge of WordPress and Shopify development.\nFamiliarity with HTML, CSS, JavaScript, and PHP (preferred).\nUnderstanding of responsive design principles.\nStrong problem-solving skills and attention to detail.\nAbility to work on-site in Kozhikode, Kerala.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Graduate Apprentice Developer",
    "job_id": "4281536878",
    "company_name": null,
    "location": "India",
    "experience": "3 to 5 months",
    "salary": null,
    "key_skills": [
      "full-stack development",
      "front-end development",
      "HTML",
      "CSS",
      "JavaScript",
      "React",
      "Angular",
      "back-end development",
      "Python",
      "Java"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279880094/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nCatseye Systems & Solutions Pvt. Ltd. is both a technology product and services organization and a business understanding group. With a customer and business-centric approach, Catseye helps clients address their business challenges by providing best-in-class advice on managing their operations. The company is dedicated to protecting customer business data and managing data availability worldwide. Catseye's non-disruptive approach ensures significant improvements in efficiency, performance, and cost while helping businesses adapt to continuous changes.\n\n Role Description\n \nThis is a full-time, on-site role for an iOS Developer located in Maharashtra, India. The iOS Developer will be responsible for developing and maintaining mobile applications, specifically for iOS platforms. Daily tasks will include software development, troubleshooting, and collaborating with cross-functional teams to enhance mobile application performance and user experience.\n\n Qualifications\n \n\nMobile Application Development and Mobile Applications skills\niOS Development and iOS skills\nSoftware Development skills\nStrong problem-solving and analytical abilities\nExcellent communication and collaboration skills\nBachelor's degree in Computer Science, Information Technology, or a related field\nExperience with the latest mobile technologies and development tools",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4279873690/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nAbout the Job \n\n \n\nWho we are and what do we do \n\n \n\nIndia has witnessed a journey of Innovation in Digital Payments and today it leads the world with over 45% of the Global digital transaction volume. At NPST, we believe that our decade long journey has carved an opportunity for building future roadmap for the world to follow.\n\nWe are determined to contribute immensely to nation’s growth story with our vision “to provide digital technology across financial value chain” and our mission to create leadership position in digital payment space.\n\nFounded in 2013, NPST is a leading fintech firm in India, part of the Make in India initiative and listed on BSE and National Stock Exchange. We specialize in Digital Payments operating as Technology Service Provider to Regulated entities and providing Payment Platform to Industry – empowered by payment processing engine, Financial Super app, Risk Intelligence engine and digital merchant solution.\n\nWhile we drive 3% of global digital transaction volume for over 100+ clients, we aim to increase our market share by 5X in next five years through innovation and industry first initiatives.\n\n \n\nWhat will you do \n\n \n\nWe are augmenting our team and actively looking for a Flutter Developer who can add his skills & experience in strengthening our current team. \n\n\n\n\nJob responsibilities:\n\n\n\n\nDesign and Build scalable apps using Flutter and Dart. \nHave knowledge on generating flutter plugins to interact with native (iOS/Android) libraries. \nHave worked with Flutter app with different Architectures, Architectural design. \nExperience with Android SDK, Kotlin` \nUse Flutter to build cross platform mobile apps for Android, IOS and Web. This should include from making responsive UIs to efficiently query data and mange states in an optimized manner. \nTo build custom Flutter Packages. \nTranslate and build the designs and Wireframes into high-quality responsive UI code. \nWrite efficient queries for core Data. \nFirebase: Should have experience with Cloud Firestore, Push Notifications, Cloud Functions and Analytics. \nCreating and implementing API of Firebase Firestore \nShould have some basic knowledge of core language of native Android and iOS. \nGit: To manage and collaborate in different projects with the rest of the team. \n\n \n\nWhat are we looking for: \n\n \n\nPerson coming from Strong knowledge & experience in Flutter. \nDeep knowledge and experience of iOS or android development with flutter \nExperience of Firebase and other deployment cycles \nStrong educational background, preferably in the fields of computer science or engineering. \nProven working experience in same. \nStrong technical background, with understanding or hands-on experience in software development and web technologies. \nExperience in mobile application development. \nGood communication skills. Entrepreneurial skills, ability to observe, innovate and own your work. \nDetail-oriented and organized with strong time management skills. \nInfluencing skills and the ability to create positive working relationships with team members at all levels. \nExcellent communication and interpersonal skills. \nA collaborative approach and work with perfection as a group effort to achieve organization goal. \n\n \n\n \n\nEducation Qualification - Bachelor's degree \n\nExperience – 3-5 years. \n\nIndustry - IT/Software/BFSI/ Banking /Fintech \n\nWork arrangement – 5 days working from office. \n\nLocation – Bengaluru/ Mumbai/ Noida \n\n \n\nWhat do we offer: \n\n \n\nAn organization where we strongly believe in one organization, one goal. \nA fun workplace which compels us to challenge ourselves and aim higher. \nA team that strongly believes in collaboration and celebrating success together. \nBenefits that resonate ‘We Care’. \n\n \n\nIf this opportunity excites you, we invite you to apply and contribute to our success story. If your resume is shortlisted, you will hear back from us.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Zoho Developer",
    "job_id": "4279870699",
    "company_name": "Miral Enterprise",
    "location": "India",
    "experience": "minimum 1 year",
    "salary": null,
    "key_skills": [
      "Zoho Creator",
      "Deluge scripting",
      "Zoho CRM",
      "Zoho Books",
      "Zoho People",
      "API integration"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279870699/",
    "posted_at": null,
    "job_description": "About the job\n\n📌 About the Role\n\nMiral Enterprise is looking for a skilled Zoho Developer to help us build and manage a fully integrated system using Zoho One applications. You will work closely with our leadership team to implement solutions in Zoho Creator, CRM, Books, People, Payroll, and Inventory, focusing on custom app development and automation.\n\n🛠 Responsibilities\n\nDevelop custom apps using Zoho Creator (forms, workflows, reports, dashboards)\n\nSet up and customize Zoho CRM, including lead/deal modules, workflows, and automations\n\nImplement inventory tracking, purchase requisition, and gate pass flows via Zoho Creator\n\nIntegrate Zoho Creator with Zoho CRM, Books, and People using Deluge scripting and APIs\n\nConfigure automations like email alerts, PDF templates, and status updates\n\nBuild custom reports and dashboards for management\n\nParticipate in system testing, training, and go-live support.\n\n✅ Must-Have Skills\n\nExperience with Zoho Creator (minimum 1 year)\n\nStrong knowledge of Deluge scripting\n\nHands-on with Zoho CRM, Books, People, Payroll\n\nAPI integration experience between Zoho apps\n\nClear understanding of business workflows (inventory, sales, HR, etc.)\n\nExcellent communication and documentation skills\n\n\n💡 Good to Have\n\nZoho Certification (Creator/CRM)\n\nExperience with Zoho Flow, Zoho Sign, or Zoho Analytics\n\nUI/UX skills to enhance Creator apps\n\nAbility to train internal staff on using the platform\n\n\n🎯 About Miral Enterprise\n\nWe’re a growing industrial company working across electrification, fabrication, and construction verticals. We are digitizing our operations through Zoho and building an integrated ERP-like system to scale with efficiency. You will be part of a tech transformation journey from the ground up.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Zoho Developer",
    "job_id": "4281585309",
    "company_name": "KG CRM Solutions LLP",
    "location": "India",
    "experience": "over 7 years",
    "salary": null,
    "key_skills": [
      "Zoho CRM customization",
      "Zoho API integration",
      "CRM migration",
      "Zoho Creator",
      "Zoho Mail",
      "Zoho Analytics",
      "Zoho Sign",
      "Zoho Forms",
      "Zoho Campaigns"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585309/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nKG CRM Solutions LLP is a top-rated firm in Zoho One and WordPress on Upwork and an authorized Zoho One partner in India. With over 7 years of experience, we specialize in customizing Zoho CRM, Creator, Mails, Analytics, Sign, Forms, and Campaigns systems to streamline workflow processes and optimize technology for various industries. We provide services such as CRM migrations, data integration, business process automation, and essential staff training.\n\n\n Role Description\n \n\nThis is a full-time on-site role for a Zoho Developer located in Mohpa. The Zoho Developer will be responsible for customizing Zoho applications, integrating Zoho CRM with external productivity tools, migrating CRM from other platforms to Zoho, and developing business reports and automation processes. The individual will also be responsible for database preparation, data analysis, and scrubbing, field mapping, and data import tasks.\n\n\n Qualifications\n \nExperience in Zoho CRM customization, including creating and managing modules and permissions.\nProficiency in Zoho API integration and connecting Zoho CRM with external productivity tools such as Twilio, RingCentral, WhatsApp, Zapier, Google Suite, and MailChimp.\nSkills in CRM migration from platforms such as Salesforce, ActiveCampaign, HubSpot, Infusionsoft, and LinkedIn.\nStrong data analysis skills, including database preparation, data gathering, field mapping, and data import from various sources like Excel, CSV, XML, and MySQL.\nExcellent problem-solving abilities and the capacity to work independently.\nStrong communication skills for gathering requirements and conducting essential staff training.\nExperience with business process automation and creating business reports and invoices within Zoho.\nBachelor's degree in Computer Science, Information Technology, or related field is preferred.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "DevOps Engineer",
    "job_id": "4281587152",
    "company_name": "Cache Labs",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Infrastructure as Code (IaC)",
      "Software Development",
      "Continuous Integration",
      "Continuous Deployment (CI/CD)",
      "System Administration",
      "Linux"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281587152/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nAt Cache Labs, we redefine innovation by solving real-world problems that transform industries and impact lives. Founded by EB1A awardee Saiman Shetty, Cache Labs is built on a foundation of bold ideas, backed by innovation and precision, aimed at creating a lasting legacy. We pioneer advancements through brands like Smart Green Card, Crazy Creators Capital, WordCraft AI, and PRoximity, addressing underserved industries with scalable, purpose-driven solutions. Our core values include being innovation-centric, purpose-driven, empowering, and customer-centric, all in pursuit of excellence.\n\n\n Role Description\n \n\nThis is a full-time hybrid role for a DevOps Engineer located in New Delhi, with some work-from-home flexibility. The DevOps Engineer will be responsible for managing and automating infrastructure, developing software solutions, ensuring seamless continuous integration and deployment processes, and performing system administration primarily on Linux systems. This role will involve close collaboration with various teams to ensure efficient and resilient systems operations.\n\n\n Qualifications\n \nExperience with Infrastructure as Code (IaC)\nProficiency in Software Development\nSkills in Continuous Integration and Continuous Deployment (CI/CD)\nSystem Administration expertise\nStrong knowledge of Linux systems\nExcellent problem-solving and analytical skills\nAbility to work independently and as part of a team\nBachelor's degree in Computer Science or a related field\nExperience in cloud platforms like AWS or Azure is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "WordPress & Shopify Developer",
    "job_id": "4281152701",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "WordPress",
      "Shopify",
      "HTML",
      "CSS",
      "JavaScript",
      "PHP"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281152701/",
    "posted_at": null,
    "job_description": "About the job\n\nAs a WordPress & Shopify Developer, you will be responsible for developing and maintaining our e-commerce and content-driven websites on WordPress and Shopify platforms. You’ll work closely with our design and marketing teams to create engaging, user-friendly, and visually appealing websites that align with our brand and business goals.\n\n \n\n \n\nResponsibilities:\n\n \n\nWebsite Development: Build, customize, and manage websites using WordPress and Shopify.\nTheme Customization: Customize and configure themes to create unique, branded layouts for websites.\nE-commerce Integration: Set up e-commerce functionalities, payment gateways, and plugins/extensions for enhanced performance.\nContent Updates: Add and update content, images, and other website elements as needed.\nTroubleshooting & Maintenance: Diagnose and resolve website performance, functionality, and appearance issues.\nSEO Optimization: Ensure websites are optimized for search engines with the latest SEO practices.\nCollaboration: Work with designers and other team members to align site design with brand standards and optimize user experience.\n\n \n\n \n\nRequirements:\n\n \n\nEducational Background: Bachelor’s degree in Computer Science, Information Technology, or a related field (or relevant courses).\nTechnical Skills: Basic knowledge of HTML, CSS, JavaScript, and PHP.\nPlatform Knowledge: Familiarity with WordPress and Shopify platforms.\nProblem-Solving Skills: Ability to troubleshoot and identify issues with web applications.\n\n \n\n \n\nLocation: Rohini, Delhi (On-Site)\n\nWorking days: 5 days in a week",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Deployment & Support Engineer",
    "job_id": "4282126350",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "C++",
      "PostgreSQL",
      "Windows",
      "Linux",
      "Excel",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282126350/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Overview:\n\nWe are looking for a proactive and technically skilled Software Deployment & Support Engineer to join our team. This role involves building, deploying, testing, and supporting our application across customer environments. The ideal candidate will have a solid foundation in C++ and basic database knowledge, along with excellent communication and troubleshooting skills.\n\nKey Responsibilities:\n\nDebug and troubleshoot issues in our C++ application.\n Manage cross-platform deployments (Windows/Linux). \nPerform data handling tasks involving Excel sheets integrated with the application.\nConduct functional testing and create structured reports based on test results.\nCollaborate with internal teams to ensure deployment readiness.\nTravel to customer locations to deploy and support the application on-site.\nMaintain and manage code versions using Git.\n\nRequired Qualifications & Skills:\n\nProficiency in debugging and working with C++ code.\nBasic working knowledge of PostgreSQL or similar relational databases.\nHands-on experience with both Windows and Linux operating systems.\nHands-on experience with Excel for application-driven data handling.\nExperience with Git version control.\nWillingness and ability to travel to client sites for on-premise deployment and support.\nStrong analytical and problem-solving skills.\nOutstanding verbal and written communication skills.\n\nPreferred Qualifications (Bonus):\n\nExperience with the Qt framework for UI and application development.\nPrior experience in customer-facing roles or application support.\nFamiliarity with scripting languages for automation tasks.\nExperience in writing user guides or technical documentation.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "AI/ML Developer",
    "job_id": "4281580915",
    "company_name": null,
    "location": "India",
    "experience": "1-4 years",
    "salary": null,
    "key_skills": [
      "Python",
      "R",
      "Java",
      "TensorFlow",
      "Keras",
      "PyTorch",
      "AWS",
      "Azure",
      "Google Cloud"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281580915/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Location :- Lucknow\n\nJob Experience :- 1-4 years\n\nRole Description\n\nThis is a full-time on-site role for an AI/ML Developer located in Lucknow. The AI/ML Developer will be responsible for designing, developing, and implementing machine learning models and algorithms. They will collaborate with cross-functional teams to integrate AI solutions into existing systems, perform data analysis, and ensure model performance and accuracy. Additionally, the role involves staying updated with the latest advancements in AI/ML technologies and methodologies to continually improve the solutions provided.\n\n\n\n\nQualifications\n\nStrong programming skills in languages such as Python, R, and Java\nProficiency in machine learning frameworks and libraries like TensorFlow, Keras, and PyTorch\nExperience with data preprocessing, feature engineering, and data visualization tools\nKnowledge of AI/ML algorithms, including supervised, unsupervised, and reinforcement learning\nStrong analytical and problem-solving skills with attention to detail\nAbility to work collaboratively in a team environment\nExcellent written and verbal communication skills\nBachelor's or Master's degree in Computer Science, Data Science, or a related field\nExperience in deploying machine learning models in production environments is a plus\nUnderstanding of cloud platforms such as AWS, Azure, or Google Cloud is beneficial",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java Developer",
    "job_id": "4279872815",
    "company_name": "NPST",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "JAVA EE",
      "IMPS/UPI",
      "Fintech"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279872815/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout the Job \n\n\n\n\nWho we are and what do we do \n\n\n\n\nNPST is a fintech company bridging the banking and fintech worlds with its product suite of technology and payments, for over 10 years. We provide software and digital payment solutions to the BFSI Industry as a Technology service provider. We function as a Technology Service Provider (TSP) and a Third-Party Aggregator Provider (TPAP), catering to stakeholders across the financial value chain, including banks, merchant aggregators, merchants, and consumers. \n\nWe got listed targeting SME IPO in Aug – 2021 on the NSE Emerge platform with a market cap of 2000 Cr (as of Mar’24) and became NPCI- an approved Merchant Payment Service Provider, acquiring merchants and facilitating payment. NPST has a marquee clientele having 10 Banks and 30+ PAPG and Merchants. \n\nWe believe, Technology drives generations making lives simpler and efficient and aim to change lives and build financially inclusive societies. \n\n \n\nWhat will you do\n\n\n\n\nWe are looking for Java Developers with experience in building high-performing, scalable, enterprise-grade applications for Banking/Fintech domain specifically IMPS/UPI. \n\nYou will be part of a talented software team. Roles and responsibilities include managing JAVA/ JAVA EE application development while providing expertise in full software development lifecycle, from concept and design to testing.\n\n\n\n\nJob responsibilities: \n\n\n\n\nHands-on experience in design and defining architecture of complex web-based applications.\nBuilding distributed application using Core JAVA, Spring, Spring boot.\nExperience in ORM frameworks such as Hibernate/JPA.\nWorking experience with SQL and NoSQL databases such as MySQL, PostgreSQL, Oracle, MongoDB/Cassandra.\nHands-on experience on Microservices, REST.\nContinuous Integration tools like Jenkins, GitHub.\nKnowledge of Cloud such as Amazon Web Services.\nHands-on knowledge of build tools like Maven, Gradle.\nExperience working with Git, Junit, Mockito, JIRA and similar tools.\nExperience on Apache Spark & other Machine Learning tools will be added advantage.\n\n \n\nWhat are we looking for: \n\n\n\n\nHands on experience inn Spring, Spring Boot, Hibernate, RDBMS, NoSQL, multithreading, Java, REST, xml parsers, Web Services, MySQL, Oracle, Cassandra, MongoDB\nEntrepreneurial skills, ability to observe, innovate and own your work. \nDetail-oriented and organized with strong time management skills. \nInfluencing skills and the ability to create positive working relationships with team members at all levels. \nExcellent communication and interpersonal skills. \nA collaborative approach and work with perfection as a group effort to achieve organization goal.\n\n \n\nEducation Qualification - Btech/BCA/MCA/MTech\n\nExperience – 4-7 years.\n\nIndustry - IT/Software/BFSI/ Banking /Fintech \n\nWork arrangement – 5 days working from office\n\nLocation – Noida\n\n \n\nWhat do we offer: \n\nAn organization where we strongly believe in one organization, one goal. \nA fun workplace which compels us to challenge ourselves and aim higher. \nA team that strongly believes in collaboration and celebrating success together. \nBenefits that resonate ‘We Care’. \n\n \n\nIf this opportunity excites you, we invite you to apply and contribute to our success story. If your resume is shortlisted, you will hear back from us.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Intern",
    "job_id": "4281558371",
    "company_name": "Beat22",
    "location": "India",
    "experience": "Internship",
    "salary": null,
    "key_skills": [
      "JavaScript",
      "TypeScript",
      "Angular",
      "Node.js",
      "Express",
      "MongoDB",
      "Redis",
      "Docker",
      "AWS",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281558371/",
    "posted_at": null,
    "job_description": "About the job\n\nFull Stack Intern Job Description\n\n\n\n\n📍 Location: Chandigarh (Onsite/Remote)\n\n🕒 Internship\n\n🌐 Platform: https://Beat22.com\n\n\n\n\nAbout Beat22\n\nBeat22 is a SaaS-enabled B2B marketplace for Asian musicians, organizing the fragmented beats and sounds industry. We offer cutting-edge tech infrastructure that helps music and sound producers market, sell, and license their original beats and sounds directly to singers and artists. With a community of 50,000+ musicians and seed funding secured, we’re scaling fast to become the go-to music tech platform in Asia.\n\n\n\n\nTech Stack\n\nJavaScript • TypeScript • Angular • Node.js (Express) • MongoDB • Redis • Docker • AWS • Git • Python\n\n\n\n\nRole Overview\n\nWe’re seeking a motivated Full Stack Intern to join our engineering team and work on real-world projects. You’ll help design and build both frontend (Angular) and backend (Node.js/Express) features, collaborate with experienced developers, and get hands-on exposure to our complete development process—including cloud, deployment, and caching technologies. This role is ideal for those looking to learn modern web development practices in a fast-paced startup environment.\n\n\n\n\nKey Responsibilities\n\n\n\n\nFrontend (Angular)\n\nAssist in building responsive user interfaces using Angular and TypeScript.\nIntegrate frontend components with backend REST APIs.\nHelp maintain and refactor UI code for better readability and performance.\n\nBackend (Node.js/Express + MongoDB + Redis)\n\nDevelop simple REST APIs and business logic using Node.js and Express.\nUse MongoDB for data storage and Redis for caching where applicable.\nAssist in writing authentication and validation logic.\nLearn to structure backend code and follow best practices.\n\nCloud & DevOps\n\nContainerize web applications using Docker.\nSupport deployment and integration with AWS services.\nUse Git for version control and collaboration.\n\nCollaboration & Learning\n\nWork closely with product, design, and senior engineers.\nParticipate in code reviews and team meetings.\nDocument your code and share learnings with the team.\nExposure to Python in tooling, scripting, or integration tasks.\n\n\n\n\nRequirements\nFamiliarity with JavaScript and TypeScript.\nExposure to Angular (university/personal projects or coursework).\nBasic understanding of Node.js and Express.\nAwareness of MongoDB or any NoSQL database.\nEagerness to learn Docker, AWS, Redis, Git, and Python.\nGood communication skills and willingness to learn.\n\n\n\n\nBonus\nAny hands-on projects using Angular and Express/MongoDB.\nExperience writing RESTful APIs or using AWS.\nInterest or background in music technology/audio processing.\n\n\n\n\nWhy Join Beat22?\nBuild features that empower thousands of musicians.\nLearn modern full stack development (including cloud and DevOps) from experienced mentors.\nBe part of a collaborative and fast-growing startup.\nPotential for a full-time offer after internship.\nWork on something fun and impactful in music tech!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Shopify Developer",
    "job_id": "4279979893",
    "company_name": null,
    "location": "India",
    "experience": "1-3 years",
    "salary": null,
    "key_skills": [
      "Shopify development",
      "Shopify Liquid",
      "JavaScript",
      "HTML",
      "CSS",
      "jQuery",
      "Shopify API",
      "SEO"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279979893/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are seeking an experienced Shopify Developer with a strong background in building, customizing, and optimizing Shopify stores. The ideal candidate will have 1-3 years of hands-on experience in Shopify development, including theme customization, app integrations, performance optimization, and backend functionality using Liquid, JavaScript, and APIs.\n\n\n\n\nKey Responsibilities:\n\nDevelop, customize, and maintain Shopify stores based on business requirements.\nOptimize website performance for better speed and SEO.\nWork with Shopify Liquid template language for theme modifications and customizations.\nDevelop and integrate third-party Shopify apps and APIs.\nTroubleshoot and debug Shopify-related issues and implement fixes.\nEnsure the website is mobile-friendly and responsive.\nImplement UI/UX best practices for an enhanced user experience.\nCollaborate with designers, marketers, and other developers to improve store functionality.\nStay updated with the latest Shopify features, apps, and best practices.\n\n\n\n\nRequired Skills & Qualifications:\n\n1-3 years of experience in Shopify development.\nStrong proficiency in Shopify Liquid, JavaScript, HTML, CSS, and jQuery.\nExperience with Shopify API, custom app development, and third-party app integrations.\nStrong knowledge of Shopify Plus, payment gateways, and checkout customizations (if applicable).\nUnderstanding of SEO best practices and performance optimization for Shopify stores.\nFamiliarity with version control tools like Git.\nExperience in Headless Commerce using Shopify APIs (preferred but not mandatory).\nAbility to work independently and meet project deadlines.\nExperience with React.js, Vue.js, or other frontend frameworks.\nKnowledge of Shopify Hydrogen and GraphQL.\nUnderstanding of Dropshipping & Print-on-Demand (POD) models.\nPrevious experience working with Agile methodologies",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Engineer",
    "job_id": "4279481192",
    "company_name": "Zoyride",
    "location": "India",
    "experience": "2+ Yrs",
    "salary": null,
    "key_skills": [
      "Full-Stack Development",
      "Front-End Development",
      "CSS",
      "Software Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279481192/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nZoyride is a leading SAAS-based end-to-end transport management solution designed for both corporate clients and fleet owners. Our platform offers features like real-time vehicle tracking, automated ride scheduling, route optimization, and mobile apps for all roles to streamline operational complexities and boost efficiency. With a cost-effective, scalable, and plug-and-play system, Zoyride seamlessly integrates into existing systems with minimal setup. Our solution improves employee transportation services, enhances safety, and provides data-driven insights to drive smarter business decisions.\n\nRole Description\n\nThis is a full-time on-site role for a Full Stack Engineer located in Dehradun. The Full Stack Engineer will be responsible for developing and maintaining both front-end and back-end components of our transport management platform. Daily tasks include writing clean, scalable code, optimizing web applications for performance, troubleshooting and debugging software issues, and collaborating with cross-functional teams to define, design, and ship new features.\n\nQualifications\n\n2+ Yrs of experience\nBack-End Web Development and Full-Stack Development skills\nFront-End Development and expertise in Cascading Style Sheets (CSS)\nSoftware Development experience\nStrong problem-solving and analytical skills\nExcellent written and verbal communication skills\nAbility to work effectively in a collaborative team environment\nBachelor's degree in Computer Science, Information Technology, or a related field\nExperience with SAAS and transport management solutions is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter dev",
    "job_id": "4185285126",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": "Around 3000 Rs.",
    "key_skills": [
      "Flutter",
      "Notifications",
      "Play Store"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4185285126/",
    "posted_at": null,
    "job_description": "About the job\n\n1. Flutter dev\n2 2 weeks work\n3. Salary : Around 3000 Rs.\n4. Must have good knowledge and hands on Notifications and Flutter \n5. Push to Play Store.\n6. Meetings according to Indian Time\n7. Has good internet and Computer.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Salesforce Support Developer",
    "job_id": "4279866742",
    "company_name": null,
    "location": "India",
    "experience": "2–4 years",
    "salary": null,
    "key_skills": [
      "Salesforce",
      "Apex",
      "Lightning",
      "Visualforce",
      "Lightning Components",
      "SOQL",
      "Salesforce APIs",
      "Git",
      "Change Sets",
      "ANT"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279866742/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Summary:\n\nWe are looking for a proactive and detail-oriented Salesforce Support Developer to help\nmaintain, troubleshoot, and enhance our Salesforce ecosystem.\n The ideal candidate will have strong technical skills in Apex and Lightning, along with a passion for solving problems and improving user experience. \nThis role is critical in ensuring platform stability and delivering minor enhancements aligned with business goals.\n\nKey Responsibilities:\n\nProvide daily support and maintenance of the Salesforce platform.\nDiagnose and resolve issues related to configurations, flows, and integrations.\nImplement minor enhancements (custom objects, fields, flows, validation rules).\nCollaborate with business users and cross-functional teams to optimize system usage.\nMaintain clear and up-to-date documentation of customizations and processes.\n\nRequired Skills and Qualifications:\n\n2–4 years of experience in Salesforce development and/or support.\nStrong command of Apex, Visualforce, Lightning Components, and SOQL.\nFamiliarity with Salesforce APIs and configuration tools.\nExperience with Git and deployment tools (Change Sets, ANT).\nExcellent troubleshooting and communication skills.\n\nPreferred Qualifications:\n\nSalesforce Platform Developer I certification.\nExperience with Sales Cloud or Service Cloud.\nKnowledge of Salesforce DX, CI/CD pipelines, and Agile methodologies.\nUnderstanding of data migration tools and strategies.\n\nWhat We Offer:\n\nCompetitive salary and benefits package.\nOpportunity to work with a talented team and cutting-edge technologies.\nA supportive and inclusive work environment.\nProfessional development opportunities.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "PHP Laravel Developer",
    "job_id": "4282118508",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "PHP",
      "Laravel",
      "MySQL",
      "PostgreSQL",
      "REST APIs",
      "HTML",
      "CSS",
      "JavaScript",
      "AJAX",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282118508/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description:\n\nWe are looking for a passionate and skilled PHP Laravel Developer to join our development team. You will be responsible for building and maintaining modern web applications using the Laravel framework, ensuring high performance, security, and scalability.\n\n\n\n\n🛠️ Key Responsibilities\n\n:Develop, test, and maintain high-quality web applications using PHP and Laravel\n\n.\n\n\nCollaborate with frontend developers, designers, and product managers to deliver robust solutions\n\n.\n\n\nWrite clean, well-documented, and efficient code following best practices\n\n.\n\n\nWork with databases like MySQL or PostgreSQL and write optimized queries\n\n.\n\n\nIntegrate third-party APIs, payment gateways, and RESTful services\n\n.\n\n\nPerform unit testing and support code deployment to staging/production environments\n\n.\n\n\nTroubleshoot and debug applications as needed\n\n.\n\n\nParticipate in code reviews, sprint planning, and other Agile processes\n\n.\n\n\n🧠 Required Skills & Qualifications\n\n:Strong knowledge of PHP (OOP) and the Laravel framework\n\n.\n\n\nExperience with MySQL, REST APIs, HTML, CSS, JavaScript, and AJAX\n\n.\n\n\nFamiliarity with version control tools like Git\n\n.\n\n\nUnderstanding of MVC architecture and software development principles\n\n.\n\n\nExperience with authentication, authorization, and security best practices\n\n.\n\n\nGood problem-solving skills and attention to detail\n\n.\n\n\nExcellent communication and teamwork abilities\n\n.\n\n\n💡 Nice to Have (Optional)\n\n:Experience with Vue.js, React, or other JS frameworks\n\n.\n\n\nKnowledge of Docker, CI/CD pipelines, or cloud services (e.g., AWS)\n\n.\n\n\nUnderstanding of Laravel Livewire, Inertia.js, or Nova\n\n.\n\n\nFamiliarity with unit testing frameworks like PHPUnit\n\n.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Automation Test Engineer",
    "job_id": "4279867295",
    "company_name": "Medkart Pharmacy Pvt Ltd",
    "location": "India",
    "experience": "2–3 yrs",
    "salary": null,
    "key_skills": [
      "Java",
      "Python",
      "JavaScript",
      "API Testing",
      "Postman",
      "Git",
      "HTML",
      "CSS",
      "DOM"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279867295/",
    "posted_at": null,
    "job_description": "About the job\n\n🚀 We're Hiring Automation Test Engineer\n\n\n\n\n📍 Location: Makarba, Ahmedabad | \n\n🏥 Company: Medkart Pharmacy Pvt Ltd\n\n\n\n\nWe’re looking for a skilled Automation Test Engineer (2–3 yrs exp.) to help us build reliable, scalable healthcare tech.\n\n\n\n\nMust-Have Skills\n\n✔️ Java/Python/JavaScript for test scripting\n\n✔️ API Testing (Postman)\n\n✔️ Version Control (Git)\n\n✔️ Knowledge of HTML/CSS/DOM\n\n✔️ Experience with at least one test framework\n\n✔️ Strong analytical and bug-hunting skills\n\n\n\n\n🔧 Your Role: Build & run automation test suites, ensure quality across web, mobile & API platforms, and collaborate with devs & QA teams.\n\n\n\n\nFor more details or to apply, please reply to this mail namira.s@medkart.in or contact us at 9327282923",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Data Engineer",
    "job_id": "4279861963",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Terraform",
      "Kubernetes",
      "Azure EKS",
      "CI/CD",
      "Python",
      "SQL",
      "Scala",
      "Java",
      "PowerShell",
      "Spark",
      "Kafka",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279861963/",
    "posted_at": null,
    "job_description": "About the job\n\n Experience supporting cross-functional teams, especially front-end/UI and data science groups is a plus. Hands-on experience with Terraform, Kubernetes (Azure EKS), CI/CD, and cloud automation. Strong expertise in ETL/ELT design, performance tuning, and pipeline monitoring. Solid command of Python, SQL, and optionally Scala, Java, or PowerShell. Familiarity with big data tools (e.g., Spark, Kafka), version control (Git), and testing frameworks for data pipelines. Excellent communication skills and the ability to explain technical concepts to diverse stakeholders. Azure (P1) Terraform (P1) Kubernates (P1) ETL/ELT (P1) Python (P1) SQL (P1) Scala / Java / Powershell (P2) Spark / Kafka (P1) CI/CD Pipelines (P1",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter Developer (Navigation + Web Scraping)",
    "job_id": "4281556670",
    "company_name": "Walkup Wagon Pvt Ltd",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Flutter",
      "Navigation apps",
      "Web scraping",
      "Google Maps API",
      "OpenStreetMap",
      "Puppeteer",
      "Selenium",
      "BeautifulSoup"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281556670/",
    "posted_at": null,
    "job_description": "About the job\n\nInternship Opportunity: Flutter Developer (Navigation + Web Scraping)\n\n\n\n\nLocation: Remote \n\nType: Internship → PPO (performance based)\n\nDuration: 2 months unpaid → PPO\n\nOpenings: 8 positions\n\nCompany: Walkup Wagon Pvt Ltd \n\n\n\n\nAbout the Role\n\nAre you a passionate Flutter developer eager to work on real-world navigation apps and web scraping challenges? We’re offering an exciting 2-month unpaid internship followed by PPO where you’ll help build the tech backbone of our hyperlocal delivery system.\n\n\n\n\nAfter the internship, top performers will be offered paid roles based on contribution, ownership, and impact.\n\n\n\n\nWhat You’ll Work On\n\n\n\n\n• Building Flutter apps with Point A to Point B navigation and driver selection\n\n• Integrating Google Maps API, OpenStreetMap, and live tracking\n\n• Developing web scraping scripts to extract data from online sources\n\n• Learning how to build scalable systems for real-time logistics\n\n\n\n\n\n\n\nWho Should Apply\n\n\n\n\n• Students, fresh grads, or self-taught devs with solid Flutter fundamentals\n\n• Experience (or strong interest) in navigation apps and geolocation\n\n• Familiarity with web scraping tools like Puppeteer, Selenium, or BeautifulSoup\n\n• Bonus: Projects involving maps, delivery apps, or scraping dashboards\n\n\n\n\n\n\n\nWhat You Get\n\n\n\n\n• Hands-on experience building a real product with social impact\n\n• Mentorship from experienced engineers and startup founders\n\n• Performance-based conversion to paid role after 2 months\n\n• Certificate + Letter of Recommendation for all contributors",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "OpenText Developer",
    "job_id": "4281549565",
    "company_name": "SoftSol Technologies",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "OpenText Content Suite",
      "OpenText Extended ECM",
      "OpenText Archive Server",
      "Java",
      "JavaScript",
      "SQL"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281549565/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nSoftSol Technologies delivers IT products and solutions that empower businesses toward greater efficiency, innovation, and cost savings. Customers who have outsourced critical IT initiatives to SoftSol include Cisco, Genentech, Superior Court of California, US Department of Defense, and CalPERS, among many other leaders in industry and government. Founded in 1993 and headquartered in Fremont, CA, SoftSol offers extensive services such as Enterprise Software Modernization, Custom Software Development, innovative test automation through STiC, SalesForce Dot Com Development, and Cloud Computing Services.\n\n\n Role Description\n \n\nThis is a full-time on-site role for an OpenText Developer located in Hyderabad. The OpenText Developer will be responsible for designing, developing, and maintaining OpenText applications. Daily tasks include analyzing requirements, creating technical specifications, coding, debugging, and deploying solutions. Furthermore, the role involves collaborating with cross-functional teams to ensure the successful implementation of projects.\n\n\n Qualifications\n \nProficiency in OpenText Content Suite, OpenText Extended ECM, and OpenText Archive Server\nExperience in Java, JavaScript, and SQL for backend development\nAbility to conduct requirement analysis and create technical specifications\nExperience with coding, debugging, and deploying applications\nGood communication skills and the ability to collaborate with cross-functional teams\nPrior experience in project management and Agile methodologies is a plus\nRelevant certifications in OpenText technologies are advantageous\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "PHP Laravel Developer",
    "job_id": "4281549310",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "PHP",
      "Laravel",
      "Back-End Web Development",
      "Object-Oriented Programming (OOP)",
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281549310/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nWe suggest you enter details here.\n\n\n\n\nRole Description\n\nThis is a f on-site role for a PHP Laravel Developer located in Delhi, India. The PHP Developer will be responsible for back-end web development tasks using PHP, creating and maintaining databases, developing server-side logic, and ensuring high performance and responsiveness to requests from the front-end. The role also includes working closely with front-end developers to integrate user-facing elements with server-side logic, troubleshooting and fixing bugs, and continuously optimizing the application for scalability and efficiency.\n\n\n\n\nQualifications\n\nExpertise in Back-End Web Development, Object-Oriented Programming (OOP), and general Programming skills\nProficiency in Front-End Development including HTML, CSS, and JavaScript\nWell-versed in Software Development practices and methodologies\nStrong problem-solving skills and ability to troubleshoot software issues\nExcellent written and verbal communication skills\nAbility to work collaboratively in a team environment on-site in Delhi, India\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior Software Implementation Engineer",
    "job_id": "4281543703",
    "company_name": "Hectae Analytics",
    "location": "India",
    "experience": "freshers",
    "salary": null,
    "key_skills": [
      "Freshworks",
      "Freshdesk",
      "Freshservice",
      "Freshsales",
      "ITSM",
      "CRM"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281543703/",
    "posted_at": null,
    "job_description": "About the job\n\nJunior Software Implementation Engineer – Freshworks Software \n\nLocation: Perungudi, Chennai (Work from Office) \n\nDepartment: Implementation Engineers \n\n\n\n\nAbout Us \n\n\n\n\nAt Hectae Analytics, we specialize in software implementation for Freshworks products like Freshdesk, Freshservice, and Freshsales. As a Platinum Implementation Partner for Freshworks, we work directly with global clients to understand their business requirements and tailor Freshworks solutions to fit their operational needs. We work at the intersection of technology, business processes, and customer success. \n\n\n\n\nAbout the role: \n\nThere is a 3-month probationary period designed for individuals interested in building a career in software implementation. This is a hybrid role that blends business analysis with technical configuration. Post the 3 months probation, we will be considering the engineers who demonstrate consistent performance and cultural alignment for full time as Junior Implementation Engineers at Hectae Analytics. Post-confirmation, you will be part of our client-facing implementation team, handling real-world customizations and project rollouts. \n\n\n\n\nYou will be trained in: \n\nCore modules of Freshworks products (Freshdesk, Freshservice, etc) \nUnderstanding client requirements and business workflows \nConfiguring and customizing Freshworks tools \nBasics of ITSM/CRM, automation, and third-party integrations \nHands-on workshops, shadowing of implementation engineers \nUnderstanding of how businesses work and function \nStipend will be provided for the course of 3 months. \n\n\n\n\nEvaluation Criteria \n\nEngineers will be continuously assessed on: \n\nConceptual understanding (via assignments and assessments) \nCommunication skills (written & verbal) \nWillingness and ability to learn quickly \nActive participation in workshops \nOwnership and problem-solving mindset \n\n\n\n\nWho Can Apply:\n\nGraduates / final-year students in Computer Science, IT, or related fields \nStrong interest in SaaS, product configuration, and client-facing roles \nWilling to work from office full-time in Chennai 5 days a week",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Web Developer",
    "job_id": "4279861662",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "PHP",
      "Python",
      "Node.js",
      "WordPress",
      "Shopify",
      "Joomla"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279861662/",
    "posted_at": null,
    "job_description": "About the job\n\nKey Responsibilities\n\nConsult with clients to determine website requirements, goals, timelines, and budgets.\nDesign, code, and implement responsive websites or web applications according to client specifications.\nDevelop and maintain both front-end (HTML, CSS, JavaScript) and, where necessary, back-end (PHP, Python, Node.js, etc.) components.\nOptimize sites for speed, SEO, cross-browser compatibility, and mobile responsiveness.\nGuide clients on domain registration, hosting, content management, and ongoing site maintenance.\nResolve website issues, bugs, or performance problems in a timely manner.\nProvide regular updates and clear communication throughout the project lifecycle.\nStay updated with web trends to offer modern solutions.\n\n\n\n\nRequired Skills and Qualifications\n\nProficiency in core web technologies: HTML, CSS, JavaScript. Familiarity with at least one backend language (PHP, Python, Node.js, etc.).\nExperience with popular content management systems (e.g., WordPress, Shopify, Joomla).\nAbility to manage multiple projects independently and meet deadlines.\nExcellent written and verbal communication skills for direct client interactions.\nStrong problem-solving skills and adaptability in a fast-paced environment.\nPortfolio showcasing completed web projects for various clients.\nKnowledge of basic graphic design is a plus.\n\n\n\n\nTypical Freelancer Deliverables\n\nClear project proposal/quotation.\nWireframes or design mockups.\nFull website build delivered within agreed scope.\nDocumentation and basic training for client use.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Bubble.io Developer",
    "job_id": "4279864195",
    "company_name": null,
    "location": "India",
    "experience": "Minimum 2 years",
    "salary": null,
    "key_skills": [
      "Bubble.io",
      "API integrations",
      "UI/UX design",
      "database management"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279864195/",
    "posted_at": null,
    "job_description": "About the job\n\nPosition: Bubble.io Developer\n\nLocation: Mohali, Punjab ( Local candidates are preferred )\n\nExperience: Minimum 2 years\n\nJob Type: Full-time (On-site)\n\n\n\n\nKey Responsibilities:\n\n- Develop responsive web applications using Bubble.io\n\n- Design and manage workflows, databases, and API integrations\n\n- Collaborate with cross-functional teams to implement new features\n\n- Perform thorough testing to ensure optimal performance and user experience\n\n\n\n\nRequirements:\n\n-Minimum 2 years of hands-on experience with Bubble.io (portfolio is a plus)\n\n-Strong understanding of workflows, UI/UX design, and database management\n\n-Experience with third-party API integrations\n\n-Excellent problem-solving skills and effective communication abilities\n\n\n\n\nBenefits\n\n-Salaries are at par with industry standards\n\n-5-day working week\n\n-Flexible office timings\n\n-Health insurance (covering you and your family)\n\n-24 days of paid leave and 10 national holidays\n\n-EPF deduction and employer contribution",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Python Developer",
    "job_id": "4281543968",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Python",
      "Back-End Development",
      "Full Stack Development",
      "Software Development",
      "Object-Oriented Programming (OOP)",
      "Databases",
      "Django",
      "Flask"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281543968/",
    "posted_at": null,
    "job_description": "About the job\n\nRole Description\n\nThis is a full-time on-site role for a Python Developer located in Chennai. The Python Developer will be responsible for designing and implementing server-side applications, developing and maintaining back-end components, optimizing applications for maximum speed and scalability, and managing databases. Daily tasks will also include troubleshooting issues, collaborating with front-end developers, and ensuring data security and integrity.\n\n\n\n\nQualifications\n\nStrong skills in Back-End and Full Stack Development and Software Development\nProficiency in Object-Oriented Programming (OOP) and general Programming\nExperience with Databases and data management\nExcellent problem-solving abilities and attention to detail\nStrong teamwork and communication skills\nExperience in Python frameworks like Django or Flask is preferred\nBachelor's degree in Computer Science, Engineering, or a related field\nExcellent communication in English is preferred",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter Developer",
    "job_id": "3969031553",
    "company_name": "Autosync",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Flutter",
      "Mobile applications",
      "Back-End Web Development",
      "Object-Oriented Programming (OOP)",
      "version control systems"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/3969031553/",
    "posted_at": null,
    "job_description": "About the job\n\nJob description\n\n\n\n\nCompany Description\n\nAutosync is a company located in the Mumbai that specializes in providing smart home solutions. Our product allows users to transform their existing homes into smart homes without modifying any appliances. With our technology, users can control their connected devices with a single tap on their phone or through voice commands using their voice assistant. Our solution also enables wireless control of home appliances, including the ability to adjust the intensity of fans and dimmable lights.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Flutter Developer at Autosync. As a Flutter Developer, you will be responsible for developing and maintaining mobile applications using the Flutter framework. Your day-to-day tasks will include designing, coding, testing, and debugging mobile applications, collaborating with cross-functional teams on software design and development, and implementing new features and enhancements to existing applications. The role requires strong problem-solving skills, attention to detail, and the ability to work effectively in a team environment.\n\n\n\n\nQualifications\n\nComputer Science and Software Development skills\nProficiency in Flutter development\nExperience in Back-End Web Development\nStrong programming skills\nKnowledge of Object-Oriented Programming (OOP) principles\nExperience with version control systems\nExcellent problem-solving skills\nAbility to work effectively in a team environment\nBachelor's degree in Computer Science or related field\nExperience with mobile app development is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Backend Developer",
    "job_id": "4281538163",
    "company_name": null,
    "location": "India",
    "experience": "1–2 Years",
    "salary": null,
    "key_skills": [
      "Node.js",
      "Express.js",
      "Python",
      "REST API",
      "SQL",
      "NoSQL",
      "Git",
      "Microservices",
      "Docker",
      "AWS",
      "GCP",
      "CI/CD"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281538163/",
    "posted_at": null,
    "job_description": "About the job\n\n🚀 We're Hiring: Backend Developer \n\n 📍 Location: Gurugram (Offline Interview)\n\n 💼 Industry: FinTech / Payments\n\n 🧠 Experience: 1–2 Years\n\n 📅 Work Days: Mon–Sat | 🕐 Full-Time \n\n\n\n\nWe're on the lookout for a Backend Developer who's passionate about building impactful products in the FinTech space! If you're skilled in Node.js and love solving real-world problems, we want you on our team.\n\n\n\n\n🔧 What You’ll Do\n\nBuild and maintain scalable backend services (Node.js + Express.js)\nWrite clean, efficient, and well-documented code\nOptimize database queries (SQL & NoSQL)\nCollaborate with frontend teams to integrate APIs\nParticipate in code reviews, debugging, and agile sprints\nContribute to API and technical documentation\n\n\n\n\n✅ What You Bring\n\n1+ years of experience in backend development\nStrong Node.js, Python, and REST API skills\nBasic understanding of databases, Git, and software development principles\nExposure to backend frameworks (Express.js/DJango/Flask)\n\n\n\n\n🌟 Bonus Skills\n\nMicroservices, Docker, AWS/GCP, CI/CD pipelines, Testing frameworks\n\n\n\n\n🚀 Why Join Us?\n\nWork closely with experienced engineers & mentors\nOpportunity to grow in a fast-paced startup\nSupportive, collaborative environment\n\n\n\n\n🎯 You Are\n\nA problem solver with strong attention to detail\nEager to learn and take ownership\nA clear communicator and team player\n\n\n\n\n📩 Drop your CV at:\n\n 📧 amisha@zfunds.in\n\n 📱 7428851659\n\n\n\n\nLet's build the future of FinTech together.\n\n #hiring #backenddeveloper #nodejs #fintechjobs #techcareers #tech #fintech #workwithus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Front-End Web Developer",
    "job_id": "4281545550",
    "company_name": "Sustainability Economics",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "React",
      "HTML",
      "CSS",
      "Typescript",
      "APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281545550/",
    "posted_at": null,
    "job_description": "About the job\n\nLocation: \n\nBengaluru, Karnataka (Onsite) \n\n \n\nAbout the Company:  \n\nSustainability Economics is a global start-up targeting the markets of US, Japan, EU, UK, Canada and Singapore. As a pioneer, our focus is on the Lifecycle Management of E2E Net-Zero transitions while leveraging our automation-first approach. We offer our collaborative services at an international level and counsel our clients on transition solutions and decarbonisation strategies. With our team of professionals who have extensive domain and technical knowledge, we are committed to making long-term efforts to fulfil this vision through our technical innovation, client services, expertise, and capability expansion. \n\n \n\nRole Summary:  \n\nWe are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming. Responsibilities will include translation of the UI/UX design to actual code that will produce visual elements of the application. You will be responsible for the full product lifecycle including development, implementation, testing, deployment, and post-deployment monitoring. \n\n \n\nKey Tasks & Accountability:  \n\nDevelop, optimize, and maintain React based components and applications for our platform. \nBuild web applications with web development best practices. \nConvert UI/UX designs into responsive HTML, CSS, and Typescript code. \nCollaborate with backend developers to integrate APIs and database services. \nGather and refine specifications and requirements based on technical requirements or UX design. \nDebug and resolve issues, ensuring optimal performance. \nWrite clean, scalable, reusable, and well-documented code. \n\n \n\n \n\nEducation and Experience:  \n\nDomain expertise and qualifications include, but are not limited to: \nMinimum of 2 years’ experience working as a front-end developer. \nBachelor’s/ Master’s degree in computer science, information technology, or a similar field. \nMinimum 2 year of relevant work experience as a web developer, UI developer, JavaScript expert or front-end engineer. \nSound knowledge in HTML and CSS. \nFamiliar with UI layouts, SASS, Bootstrap, testing and the CSS GRID system. \nProficient with JavaScript frameworks such as React, Next. \nBasic knowledge on AWS cloud. \n\n \n\nSkills:  \n\nThe candidate should be an expert in React, Redux, Next JS etc. \nHave strong experience in API Integration and Typescript. \nBe thorough with CSS library such as bootstrap, material UI. \nBasic experience working with Chart.js and Mapbox. \n\n \n\nPersonal Attributes:  \n\nA team player with good interpersonal skills and problem-solving abilities. \nA self-motivator and a collaborative team player. \nExcellent time management skills and the ability to assume leadership roles when necessary. \nAgile, action oriented and a quick learner. \nOut of box thinker. \n\n \n\nBenefits at Sustainability Economics:  \n\nA flat hierarchy. \nESOPs. \nGroup Medical Coverage. \n30 days of Leave. \nA gender-neutral parental, marriage, and compassionate leave policy. \n\n \n\nAnd above all, if you have a passion to work, join us in our pursuit for sustainability!",
    "source": "linkedin",
    "relevance_score": "high"
  }
]