{
  "AI Post Generator": [
    {
      "url": "https://www.linkedin.com/jobs/view/4275922794/?eBP=BUDGET_EXHAUSTED_JOB&refId=rWA6YoMuArZC6BkGNQmrjw%3D%3D&trackingId=vfLxTj1SmHEPq4hVvihOVg%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Software Engineer",
      "company": "Flipkart",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  About Cleartrip (Flipkart Group) Launched in July 2006, Cleartrip India Pvt Ltd. has emerged as India’s fastest-growing online travel technology company. In April 2021, Flipkart acquired 100% of Cleartrip’s shareholding, and subsequently Adani Enterprises acquired a significant minority stake in Cleartrip in October 2021. With an aggressive plan to emerge as a leading innovator in the industry, Cleartrip is on its way to building a differentiated value proposition for its customers looking for end-to-end travel solutions. With industry-first offerings such as ‘EzCancel, Flexifly, and TravelSafe’, Cleartrip has a clear vision to disrupt the OTA segment. Combining intuitive products with a customer-centric approach and a wide selection of flights and hotels, Cleartrip brings a unique selling point to market, offering convenience, choice, competitive prices, and exclusive content to its customers. Become a Cleartripper today!About The Role & Team The Software Development Engineer's core responsibilities include working on highly-maintainable and unit tested software components/systems that address real-world problems. You will be working in a fast-paced and agile work environment delivering quality solutions that have immediate business impact.What you’ll do:You will assume complete ownership of the projects you deliver while collaborating with technical and non-technical stakeholders on all elements of the development process. You are expected to demonstrate good learnability and adopt technologies that help build large scale, performant, reliable and sustainable systems.What you’ll need:Minimum 1 year experience• Strong with analytical and problem-solving skills• Good understanding of data structures & algorithms with space & time complexities• Good with Java programming language with knowledge on design patterns• Preferably experience in building applications using java spring boot framework...",
      "requirements": "skills• Good understanding of data structures & algorithms with space & time complexities• Good with Java programming language with knowledge on design patterns• Preferably experience in building applications using java spring boot framework...",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4275591952/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=rWA6YoMuArZC6BkGNQmrjw%3D%3D&trackingId=yShTnFXkAqaqaEe5Brg1%2Bw%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Software Engineer",
      "company": "Tesla",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  What You’ll Do Work with engineers across many functional areas and deliver value to internal and external stakeholders. Design and develop new modules on the home-grown internal employee facing application. Develop scalable solutions using tools like Angular, C#/.Net, MySQL and other open stack frameworks. Know your app! Seek to understand all aspects, business and technical, of the applications on which you work so you can be most effective. Contribute towards the timely completion of development tasks and small projects while applying company standards. Continually learn and apply relevant software development practices, patterns, tools, and technologies. Increase efficiency, reduce waste wherever and whenever possible.What You’ll Bring 3+ years in web application development, including implementing Application Programming Interfaces (APIs), Object-Oriented Programming and Design (OOP&D), and Object-Relational Mapping (ORM). Experience in frontend development using tools such as JavaScript, Angular, and React. Experience in backend development using tools such as C# or Go. Experience with relational databases, SQL, and NoSQL. Knowledge of Agile Development methodologies. Experience with distributed source control using tools such as Git.",
      "requirements": "",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4277796263/?eBP=CwEAAAGYeh9VWhQeYOyIoFnS0X3IPKL9qTf-nPmkgzrpfsN2oGkK85VIjX0JCc9Sr9fnEjtXGdnmSwle--RR61OAjGHqf9CjbSgDUtNsI41BaGExTjFxRqZN5pr9K4m7waCYNnOUQuGEfWisDLhsy3ZcJntr4d_Wdi7TD4q01uDrJALvIi7NRqy8C24WB9OVvgy1Dg2wUpVV4yQzErzP7C_kjVYJLZPzZLndlS_OL1GjjD0SpkMV3qcET3QdEFp-rjY0NtrYK2nwTPjlfWZbRkbn2iexV6V-VqiqIvb37MiIgy_12xMFwI3h7U2vbp1bU6XeE68tR7DrIv1IpgPxYZQ90jH2qZ7WvgfXMy_f1v--8q2fYlXwEi-2QBs_eENo5ap1kDpvm2llDPGfhf9DX2L3ibwPPiCLeUTQzqp8PX6cR897wCUXbomy3e2zwpEmk6ZJ-4Hu_bpKiWCVxo7p5roYHsQEJENZov5SPMlzutMT01r7F3RHk3N2FGmuTJjgekMtzaSbcw2bfoPfavjNOSIRjA&refId=rWA6YoMuArZC6BkGNQmrjw%3D%3D&trackingId=jEbZMqq9%2BtONwAnBkLaXiw%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Python Developer",
      "company": "FPL Technologies",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  Job Title: Python DeveloperLocation: Pune (Aundh) - Work From OfficeAbout FPL Technologies:Credit cards haven't changed much for over half a century so our team of seasoned bankers, technologists, and designers set out to redefine the credit card for you - the consumer. The result is OneCard - a credit card reimagined for the mobile generation. OneCard is India's best metal credit card built with full-stack tech. It is backed by the principles of simplicity, transparency, and giving back control to the user.Check out OneCard App (Best credit card app) : www.getonecard.appLocation: Pune (Aundh) - Work From OfficeOpportunity: Join our engineering team as a Python Developer and help build responsive web applications that drive our business.Experience: 1- 4 years of work experience as a Python DeveloperWhat you'll do:      Write effective, scalable codeDevelop back-end components to improve responsiveness and overall performanceIntegrate user-facing elements into applicationsTest and debug programsImprove functionality of existing systemsImplement security and data protection solutionsAssess and prioritize feature requestsCoordinate with internal teams to understand user requirements and provide technical solutions\nWhat you require to have:      Expertise in at least one popular Python framework (like Django, Flask)Knowledge of object-relational mapping (ORM)Familiarity with front-end technologies (like JavaScript and HTML5)Database knowledge (e.g., MySQL, PostgreSQL)Good problem-solving skillsBSc in Computer Science, Engineering, or a relevant field\nFPL Technologies is an Equal Employment Opportunity employer. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, gender ,disability.",
      "requirements": "requirements and provide technical solutions\nWhat you require to have:      Expertise in at least one popular Python framework (like Django, Flask)Knowledge of object-relational mapping (ORM)Familiarity with front-end technologies (like JavaScript and HTML5)Database knowledge (e.g., MySQL, PostgreSQL)Good problem-solving skillsBSc in Computer Science, Engineering, or a relevant field\nFPL Technologies is an Equal Employment Opportunity employer. We do not discriminate based on race, religion, col",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4270746348/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=rWA6YoMuArZC6BkGNQmrjw%3D%3D&trackingId=Qohg4Xd%2FV6FtUrNeT1zqOw%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Generative AI Developer",
      "company": "Capgemini",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  Choosing Capgemini means choosing a company where you will be empowered to shape your career in the way you’d like, where you’ll be supported and inspired by a collaborative community of colleagues around the world, and where you’ll be able to reimagine what’s possible. Join us and help the world’s leading organizations unlock the value of technology and build a more sustainable, more inclusive world.Your Role      Develop and implement Generative AI / AI solutions on Google Cloud PlatformWork with cross-functional teams to design and deliver AI-powered products and servicesWork on developing, versioning and executing Python codeDeploy models as endpoints in Dev EnvironmentSolid understanding of pythonDeep learning frameworks such as TensorFlow, PyTorch, or JAXNatural language processing (NLP) and machine learning (ML)Cloud storage, compute engine, VertexAI, Cloud Function, Pub/Sub, Vertex AI etcGenerative AI support in Vertex, specifically handson experience with Generative AI models like Gemini, vertex Search etc\nYour Profile      Experience in Generative AI development with Google Cloud PlatformExperience in delivering an AI solution on VertexAI platformExperience in developing and deploying AI Solutions with ML\nWhat You’ll Love About Working Here      You can shape your career with us. We offer a range of career paths and internal opportunities within Capgemini group. You will also get personalized career guidance from our leaders.You will get comprehensive wellness benefits including health checks, telemedicine, insurance with top-ups, elder care, partner coverage or new parent support via flexible work.You will have the opportunity to learn on one of the industry's largest digital learning platforms, with access to 250,000+ courses and numerous certifications\nAbout CapgeminiCapgemini is a global business and technology transformation partner, helping organizations to accelerate their d...",
      "requirements": "",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4277947285/?eBP=BUDGET_EXHAUSTED_JOB&refId=rWA6YoMuArZC6BkGNQmrjw%3D%3D&trackingId=GSENsFSLqYig5eF%2FVS%2F7tA%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "(13) AI/ML & Python Developers",
      "company": "Vizh AI Solutions",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  Job descriptionWe’re hiring!At Vizh AI, AI-powered recruitment automation platform, we’re assembling a high-impact AI engineering team in India for an exciting project launching soon. This is your opportunity to get in early and grow with us as we hire in batches for this large-scale initiative.Who Should Apply:We’re looking for individuals who:      Have hands-on experience or strong knowledge in Python, AI/ML, NLP, or Data EngineeringAre passionate about solving real-world problems using AIAre ready to commit to shadow training with our senior engineers to up skill and align with client needsCan work remotely from anywhere in India and align with U.S. time zones as neededAI/ML Engineers and Python Developers (Fresher to 4+ years experience)Open to Remote and India-based talentWilling to undergo shadow training with our experienced resourcesEager to work on real-time international projects in AIRight Now we are offering 5k INR stipend for the first 3 months\nHow to Apply:Take our pre-screening round here → https://portal.vizh.ai/portal/candidates/roles/cd54696d-2004-4a7c-abb9-3ca97b884e9a      Sign up using your personal Gmail accountYou’ll be asked to complete a KYC verification (optional, but highly recommended for faster processing)\n📢 We’re hiring in batches, so early applicants get priority!📋 Note on Application Process:We receive thousands of applications, and to ensure fair and efficient shortlisting, we use an AI-based screening system to evaluate candidates quickly and objectively.❗️We will not be conducting phone interviews initially. Only candidates who pass our screening and internal training review will be invited to the final-round interaction.Qualification:Bachelor’s or Master’s degree in Computer Science, Data Science, Engineering, or related fieldsOR proven hands-on experience in Python and AI/ML projects (personal or professional)Strong analytical thinking and willingness to...",
      "requirements": "",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    }
  ],
  "Faculty Performance Monitor": [
    {
      "url": "https://www.linkedin.com/jobs/view/4279201349/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=BpzflJ30uX%2FMjeF24D9tPQ%3D%3D&trackingId=8hFG6U36BuyoueoeQHxJ9g%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Robotics & AI Faculty",
      "company": "StemUp",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  🚨 We're Hiring! | 2 Faculty Positions – Robotics & AI Department 📍 Location: Bangalore 🕒 Experience: 8+ Years🔍 Eligibility Criteria📌 Ph.D. / M.Tech in Robotics 📌 Minimum 8+ years of experience 📌 Strong research background with a flair for Artificial Intelligence (AI)🎯 Responsibilities✅ Deliver lectures and practical sessions in Robotics & AI ✅ Guide students in academic projects and research ✅ Publish in reputed journals ✅ Collaborate with industry and R&D teams ✅ Contribute to curriculum and innovation",
      "requirements": "",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4280071264/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=BpzflJ30uX%2FMjeF24D9tPQ%3D%3D&trackingId=fiVPSH%2FSZsnc3RzuyPNPKQ%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "(13) Assistant Professor",
      "company": "Chandigarh Group of Colleges, Landran, Punjab",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  About the jobPosition: Assistant Professor – CSELocation: CGC Landran, Mohali, PunjabType: Full-time | On-siteInstitution: Chandigarh Group of Colleges (CGC), LandranAbout Us:Chandigarh Group of Colleges (CGC), established in 2001, is a leading institution in professional education with over 13,000 students and 34+ programs. Known for academic excellence, research, and placements, CGC offers a vibrant teaching and learning environment.Role DescriptionThis is a full-time, on-site role for an Assistant Professor in Computer Science Engineering located in the Mohali district. The Assistant Professor will be responsible for developing and delivering high-quality coursework, mentoring students, conducting research, and participating in academic committees. Additional duties include curriculum development, student assessments, and contributing to the continuous improvement of the department's academic programs.Eligibility Criteria:Qualification:      M.Tech in CSE (Mandatory)Ph.D. in CSE (preferred or as per UGC/AICTE norms)\nExperience:      Minimum 0–3 years of teaching or industry experience (freshers with strong academic background can also apply)\nSkills:      Excellent communication and presentation skillsResearch aptitude and interest in publicationTechnically sound with proficiency in relevant tools and programming languages\nCompensation:As per norms and experience. Salary is negotiable for deserving candidates.How to Apply:Interested candidates can share their updated CV to vidhu.hr@cgc.edu.in with the subject line \"Application for Assistant Professor – CSE\"",
      "requirements": "Skills:      Excellent communication and presentation skillsResearch aptitude and interest in publicationTechnically sound with proficiency in relevant tools and programming languages\nCompensation:As per norms and experience. Salary is negotiable for deserving candidates.How to Apply:Interested candidates can share their updated CV to vidhu.hr@cgc.edu.in with the subject line \"Application for Assistant Professor – CSE\"",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4265221797/?eBP=CwEAAAGYeh9U4ejPWSrTCvP1kuUgE3Wf99v77EO9mQMAX18wVWIkzDQaMXuz-l7iKgtb4bEvVRHR79sWwK5sSXcye_hK1q_9wqFZVQhhgolNE3PM20jwuJOFoBVJRKe9UQLFNn00DtyS83aJwAHhyCWf39k0WGBAG-ti4KmfqDPsHZgmESAVmIfNGhbZWzKx_FsUg6f-BdyxQmtoORGhBWw7jE79GZZRV-m1AS9YTivjr37fx7ITPJ4jc-anKdPJTTycQaqNcF2fVkSwo1CzIvbj8cQtxQ2DudOicjtZZpsnooglIS9Y7VlPbEFuY-ZvuBqPDrXwb7t-QyWBf3-BoKa1jdhYfa4H4mpPNpE2qWW7GiDK9b19OgjDvetJU5Xtf6oXOIyeOVnD4OjkAnOfbttLqYhbRMZekBz9VNWUEE6DUI3DCMfRnFo296jY0JgR6upKkeQerrioTxaRtkqXU_W8mXrO37Tw9Jxn9zN5YLVh&refId=BpzflJ30uX%2FMjeF24D9tPQ%3D%3D&trackingId=Qvtd%2FB1xfi9uGY27GQR%2FXg%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Faculty – AI Tools & Applications for High Schoolers",
      "company": "PW (PhysicsWallah)",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  🌟 Job Opportunity at PhysicsWallah 🌟Position: Faculty – AI Tools & Applications for High SchoolersLocation: Full-time | Bangalore (Studio-based + Online Delivery)Mode: In-studio Recording & Online TeachingDemo Video Submission: Mandatory for ShortlistingAbout the ProgramWe're launching an innovative and engaging AI Tools & Applications course tailored for high school students (Grades 10–12). This program introduces learners to the power of AI through hands-on experiences with tools like ChatGPT, Gemini, Canva, Suno.ai, and Google Teachable Machine—no coding experience required!Role OverviewWe are looking for an enthusiastic and student-centric AI Tools Faculty to lead this foundational AI course. The ideal candidate should have experience with generative AI tools, a passion for education, and the ability to translate technical concepts into relatable, real-world applications.Key Responsibilit      iesDeliver 18 instructor-led sessions (3 hours each) combining teaching, interaction, and doubt resolution.Teach use cases of tools such as ChatGPT, Gemini, Canva, Teachable Machine, and Suno.ai.Simplify core AI concepts (e.g., Machine Learning, NLP, Classification) using analogies and visual aids.Guide students in using AI tools for tasks like:Text summarization and doubt clarificationFlashcard and storyboard creationAI-powered music and visual content generationNo-code web/app creationEncourage responsible AI use, touching upon ethics, bias, and misinformation.Assess and provide feedback on student capstone projects.Maintain high engagement and curiosity throughout the sessions.Share weekly updates and reports with the program coordinat\nor.Required Qualificat      ionsBachelor’s degree in Computer Science, Education, Design, or related field (or equivalent experience).Prior teaching, mentoring, or facilitation experience—preferably with teens or in an edtech setup.Hands-on expertise with generati...",
      "requirements": "",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4280108769/?eBP=BUDGET_EXHAUSTED_JOB&refId=BpzflJ30uX%2FMjeF24D9tPQ%3D%3D&trackingId=gHr4CTWEqDADnAFYY3PYNw%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "(13) Faculty/Trainer",
      "company": "K.R. Mangalam University",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  Job Title: Faculty/Trainer - DSA (Data Structures and Algorithms)Location: K.R. Mangalam University, Sohna, Gurugram, HaryanaEmployment Type: Full-TimeDepartment: School of Engineering and TechnologyExperience Required: Minimum 3 years (including at least 1 year teaching/training experience)About K.R. Mangalam UniversityK.R. Mangalam University is an innovation-driven, multidisciplinary institution committed to excellence in education, research, and student outcomes. We are looking for a full-time DSA Trainer to strengthen our computer science and engineering programs by preparing students for competitive programming, technical interviews, and core algorithmic thinking.Position OverviewWe are seeking a committed and knowledgeable DSA Trainer with strong teaching and mentoring abilities to train undergraduate engineering students in core programming, problem solving, and algorithm design. The ideal candidate should have experience in both academia and the tech industry, and should be passionate about developing industry-ready talent.Key Responsibilities      Design and deliver structured training in Data Structures and Algorithms using C++, Java, or PythonTeach foundational and advanced concepts such as:Arrays, Linked Lists, Stacks, Queues, Trees, GraphsSorting and Searching AlgorithmsRecursion, Backtracking, Dynamic Programming, Greedy AlgorithmsHashing, Heaps, Tries, Segment Trees, and Disjoint SetsConduct live coding sessions, problem-solving workshops, and algorithm walkthroughsGuide students on platforms such as LeetCode, HackerRank, CodeChef, Codeforces, and GeeksforGeeksMentor students preparing for internships, placements, and product company interviewsEvaluate performance through weekly contests, quizzes, and mock interviewsCollaborate with academic teams to integrate DSA into regular courseworkMotivate students to take part in hackathons, programming competitions, and open-source co...",
      "requirements": "",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4247989961/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=BpzflJ30uX%2FMjeF24D9tPQ%3D%3D&trackingId=CCLcUB1Kft8RzrrOeGVffg%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Computer Science Lecturer for College/University",
      "company": "Vivekananda Pu College",
      "location": "",
      "description": "About the job\n            \n\n                  \n      \n    \n\n  \n      This job is sourced from a job board.\n      Learn More\n  \n\n            \n                \n                  The role of Computer Science Lecturer for College/University is vital in shaping the future of aspiring tech professionals. By fostering a collaborative learning environment, you will contribute significantly to the academic and personal growth of students, while also driving innovation within the department. This position offers a unique opportunity to engage with a diverse group of learners and collaborate with fellow educators to enhance curriculum development and teaching methodologies.As a key member of our academic team, you will:      Design and deliver engaging lectures and practical sessions that inspire students and enhance their understanding of computer science concepts.Develop and update course materials to ensure alignment with industry standards and emerging technologies.Assess student performance through various evaluation methods, providing constructive feedback to support their academic journey.Mentor students in their academic and career aspirations, fostering a supportive and inclusive learning environment.Collaborate with faculty members to enhance interdisciplinary learning opportunities and promote innovative teaching practices.Participate in departmental meetings and contribute to strategic planning initiatives aimed at improving educational outcomes.Engage in research activities that contribute to the advancement of knowledge in the field of computer science.Stay current with technological advancements and integrate relevant tools and resources into the curriculum.Facilitate workshops and seminars that encourage student engagement and professional development.Promote a culture of academic integrity and uphold the institution's values in all interactions with students and colleagues.\nTo excel in this role, candidates should possess the following qualifications and skill...",
      "requirements": "qualifications and skill...",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    }
  ],
  "Employee Management System": [
    {
      "url": "https://www.linkedin.com/jobs/view/4238704831/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=4KIeQ%2Fot0vu1mGy%2BanBF3Q%3D%3D&trackingId=6hspG7QaE3cNcR%2F3YvzdGQ%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Frontend Software Engineer",
      "company": "Tesla",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  Position DescriptionYou will be working with fellow software engineers focused on building out Tesla's internal tools that facilitate process management of the design, permitting, and installation of energy products and systems. This team is focused on building a stable and scalable platform that can be extended and configured for all Tesla Energy and Vehicle products that are sold and supported today, and any that will be introduced in the future. The goal of this role and team is to enable our internal employees with ways to track, standardize, automate, and ultimately optimize all steps taken on an energy installation job from start to finish.ResponsibilitiesDesign, develop and support applications and systems under the team’s scopeWrite clean, maintainable, performant, and well-tested code to implement new features and fix bugsWrite unit tests, integration tests, and work with QA to coordinate timely regression for new featuresMonitor live system metrics, respond to alerts, and troubleshoot production issuesInvestigate and understand existing system technical functionality and propose technical improvementsCollaborate with Product, Design, and Business stakeholders to plan and prioritize new feature developmentCommunicate changes in project estimates, dependencies, and blockers with affected stakeholders quicklyOwn feature development and projects through design, development, testing, and release to productionUnderstand and improve the scalability, maintainability, availability, and visibility of applicationsDocument newly implemented technologies and application functionalityRequirementsDegree in Computer Science or related field, or equivalent experienceSolid understanding of fundamental web technologies such as HTTP, REST, AJAX and JSON. Strong proficiency in HTML, CSS and JavaScript / ES6, including DOM manipulation and the JS object modelSolid understanding of database principles, p...",
      "requirements": "RequirementsDegree in Computer Science or related field, or equivalent experienceSolid understanding of fundamental web technologies such as HTTP, REST, AJAX and JSON. Strong proficiency in HTML, CSS and JavaScript / ES6, including DOM manipulation and the JS object modelSolid understanding of database principles, p...",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4275922794/?eBP=BUDGET_EXHAUSTED_JOB&refId=4KIeQ%2Fot0vu1mGy%2BanBF3Q%3D%3D&trackingId=p8WQbreQVEpIvnhdLPOXxA%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Software Engineer",
      "company": "Flipkart",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  About Cleartrip (Flipkart Group) Launched in July 2006, Cleartrip India Pvt Ltd. has emerged as India’s fastest-growing online travel technology company. In April 2021, Flipkart acquired 100% of Cleartrip’s shareholding, and subsequently Adani Enterprises acquired a significant minority stake in Cleartrip in October 2021. With an aggressive plan to emerge as a leading innovator in the industry, Cleartrip is on its way to building a differentiated value proposition for its customers looking for end-to-end travel solutions. With industry-first offerings such as ‘EzCancel, Flexifly, and TravelSafe’, Cleartrip has a clear vision to disrupt the OTA segment. Combining intuitive products with a customer-centric approach and a wide selection of flights and hotels, Cleartrip brings a unique selling point to market, offering convenience, choice, competitive prices, and exclusive content to its customers. Become a Cleartripper today!About The Role & Team The Software Development Engineer's core responsibilities include working on highly-maintainable and unit tested software components/systems that address real-world problems. You will be working in a fast-paced and agile work environment delivering quality solutions that have immediate business impact.What you’ll do:You will assume complete ownership of the projects you deliver while collaborating with technical and non-technical stakeholders on all elements of the development process. You are expected to demonstrate good learnability and adopt technologies that help build large scale, performant, reliable and sustainable systems.What you’ll need:Minimum 1 year experience• Strong with analytical and problem-solving skills• Good understanding of data structures & algorithms with space & time complexities• Good with Java programming language with knowledge on design patterns• Preferably experience in building applications using java spring boot framework...",
      "requirements": "skills• Good understanding of data structures & algorithms with space & time complexities• Good with Java programming language with knowledge on design patterns• Preferably experience in building applications using java spring boot framework...",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4280122402/?eBP=BUDGET_EXHAUSTED_JOB&refId=4KIeQ%2Fot0vu1mGy%2BanBF3Q%3D%3D&trackingId=BVk32YPhG1I9vkpoGxlVsA%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "(13) Software Development Engineer",
      "company": "Airtel Payments Bank",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  About Us:Airtel Payments Bank, India's first payments bank is a completely digital and paperless bank. The bank aims to take basic banking services to the doorstep of every Indian by leveraging Airtel's vast retail network in a quick and efficient manner. At Airtel Payments Bank, we’re transforming the way banking operates in the country. Our core business is banking and we’ve set out to serve each unbanked and underserved Indian. Our products and technology aim to take basic banking services to the doorstep of every Indian. We are a fun-loving, energetic and fast growing company that breathes innovation. We encourage our people to push boundaries and evolve from skilled professionals of today to risk-taking entrepreneurs of tomorrow. We hire people from every realm and offer them opportunities that encourage individual and professional growth. We are always looking for people who are thinkers & doers; people with passion, curiosity & conviction; people who are eager to break away from conventional roles and do 'jobs never done before’.Purpose of the Job: The Developer will be part of a cross-functional Scrum team responsible for designing, developing, and testing diverse features of Airtel Payments Bank agile stream. Payments bank values software engineers who are motivated, creative, passionate and positive. You must be comfortable working closely with others and have solid communication skills. Software engineers who learn quickly and have strong technical skills will thrive at Airtel Payments Bank. You must have considerable experience with object oriented programming and should be familiar with design patterns, data structures, database and other staples of practical software development. Key Deliverables :  Research, design, implement and managing software programs.  Test and evaluate new programs  Identify the areas for modification in existing programs and subsequently developing ...",
      "requirements": "skills. Software engineers who learn quickly and have strong technical skills will thrive at Airtel Payments Bank. You must have considerable experience with object oriented programming and should be familiar with design patterns, data structures, database and other staples of practical software development. Key Deliverables :  Research, design, implement and managing software programs.  Test and evaluate new programs  Identify the areas for modification in existing programs and subsequently",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4274637638/?eBP=BUDGET_EXHAUSTED_JOB&refId=4KIeQ%2Fot0vu1mGy%2BanBF3Q%3D%3D&trackingId=PhS6%2FELHdO9rhP%2Bev6VuVQ%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "(13) Software Engineer",
      "company": "PayPal",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  The CompanyPayPal has been revolutionizing commerce globally for more than 25 years. Creating innovative experiences that make moving money, selling, and shopping simple, personalized, and secure, PayPal empowers consumers and businesses in approximately 200 markets to join and thrive in the global economy.We operate a global, two-sided network at scale that connects hundreds of millions of merchants and consumers. We help merchants and consumers connect, transact, and complete payments, whether they are online or in person. PayPal is more than a connection to third-party payment networks. We provide proprietary payment solutions accepted by merchants that enable the completion of payments on our platform on behalf of our customers.We offer our customers the flexibility to use their accounts to purchase and receive payments for goods and services, as well as the ability to transfer and withdraw funds. We enable consumers to exchange funds more safely with merchants using a variety of funding sources, which may include a bank account, a PayPal or Venmo account balance, PayPal and Venmo branded credit products, a credit card, a debit card, certain cryptocurrencies, or other stored value products such as gift cards, and eligible credit card rewards. Our PayPal, Venmo, and Xoom products also make it safer and simpler for friends and family to transfer funds to each other. We offer merchants an end-to-end payments solution that provides authorization and settlement capabilities, as well as instant access to funds and payouts. We also help merchants connect with their customers, process exchanges and returns, and manage risk. We enable consumers to engage in cross-border shopping and merchants to extend their global reach while reducing the complexity and friction involved in enabling cross-border trade.Our beliefs are the foundation for how we conduct business every day. We live each day guided b...",
      "requirements": "",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "url": "https://www.linkedin.com/jobs/view/4275612089/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=4KIeQ%2Fot0vu1mGy%2BanBF3Q%3D%3D&trackingId=6WNbmEZI6n5sJP8qqxTCrQ%3D%3D&trk=flagship3_search_srp_jobs",
      "title": "Software Engineer",
      "company": "HSBC",
      "location": "",
      "description": "About the job\n            \n\n            \n                \n                  Job DescriptionSome careers shine brighter than others.If you’re looking for a career that will help you stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC is one of the largest banking and financial services organisations in the world, with operations in 64 countries and territories. We aim to be where the growth is, enabling businesses to thrive and economies to prosper, and, ultimately, helping people to fulfil their hopes and realise their ambitions.We are currently seeking an experienced professional to join our team in the role of Software EngineerIn this role, you will:      Work as Android Developer in Mobile Platform under Enabler Value streamWork on the core android native capabilities of mobile platformWork with global stake holders – engineering, delivery teams, QAs\nRequirementsTo be successful in this role, you should meet the following requirements:      OOPS, Design PatternsCoding in Android, KotlinJIRA Engineering Graduate / MCAExperience in Android , Kotlin mobile app developmentExperience in the: mobile, or tablet digital development Experience in DevOps, AgileGood communication skills and analytical skillsExperience in trouble shooting , production issues, defect fixing\nYou’ll achieve more when you join HSBC.www.hsbc.com/careersHSBC is committed to building a culture where all employees are valued, respected and opinions count. We take pride in providing a workplace that fosters continuous professional development, flexible working and opportunities to grow within an inclusive and diverse environment. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement, which is available on our website.Issued by – HSBC Software Development I...",
      "requirements": "requirements:      OOPS, Design PatternsCoding in Android, KotlinJIRA Engineering Graduate / MCAExperience in Android , Kotlin mobile app developmentExperience in the: mobile, or tablet digital development Experience in DevOps, AgileGood communication skills and analytical skillsExperience in trouble shooting , production issues, defect fixing\nYou’ll achieve more when you join HSBC.www.hsbc.com/careersHSBC is committed to building a culture where all employees are valued, respected and opinions",
      "posted_date": "",
      "job_type": "",
      "experience_level": ""
    }
  ]
}