[
  {
    "title": "Flutter Developer",
    "job_id": "3964990778",
    "company_name": null,
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Flutter",
      "Dart",
      "Computer Science",
      "Programming",
      "Back-End Web Development",
      "Software Development",
      "Object-Oriented Programming (OOP)"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/3964990778/",
    "posted_at": null,
    "job_description": "About the job\n\n\n\n\nRole Description\n\n \n\nThis is a full-time on-site role for a Flutter Developer located in Tenkasi. The Flutter Developer will be responsible for designing, developing, and maintaining mobile applications using the Flutter framework. Day-to-day tasks include writing clean and efficient code, debugging and troubleshooting issues, collaborating with cross-functional teams, and staying up-to-date with the latest industry trends. The role also involves integrating back-end services and ensuring the performance, quality, and responsiveness of applications.\n\n\n\n\n Qualifications\n\n \n\nStrong Computer Science and Programming skills\nProficiency in Back-End Web Development and Software Development\nExperience with Object-Oriented Programming (OOP)\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a team environment\nBachelor's degree in Computer Science, Software Engineering, or related field\nExperience with Flutter framework and mobile application development is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "WordPress Developer",
    "job_id": "4281871633",
    "company_name": "Objectways",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "WordPress",
      "Back-End Web Development",
      "Web Development",
      "Front-End Development",
      "Responsive Web Design",
      "Web Design"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281871633/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \n\nAt Objectways, we are a boutique firm dedicated to solving pressing problems in Big Data analytics, Machine Learning, Artificial Intelligence, and IoT analytics. We focus on customer-centric solutions by prescribing the best services and architecture tailored to specific needs. Our advantages include a simple engagement model, state-of-the-art innovation, automated infrastructure, a well-architected framework ensuring operational excellence, and built-in warranty support for peace of mind.\n\n\n Role Description\n \n\nWe are seeking a full-time WordPress Developer for a hybrid role based in Bengaluru, with some work-from-home flexibility. The WordPress Developer will be responsible for developing and maintaining WordPress websites, ensuring responsiveness and compatibility across devices, and implementing web design concepts. The role also involves back-end and front-end web development tasks as well as collaborating with design and development teams to enhance website functionality and user experience.\n\n\n Qualifications\n \n\n\nProficiency in Back-End Web Development and Web Development\nSkills in Front-End Development and Responsive Web Design\nExperience in Web Design\nKnowledge of WordPress architecture and ecosystem\nExcellent problem-solving and troubleshooting skills\nAbility to work independently and in a team setting\nBachelor's degree in Computer Science, Information Technology, or a related field\nExperience working in a hybrid work environment is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Solution Engineer",
    "job_id": "4281855685",
    "company_name": "Mable AI",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "AI",
      "Data",
      "AdTech"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281855685/",
    "posted_at": null,
    "job_description": "About the job\n\nWho We Are:\n\nMable AI helps D2C brands create optimised AI training datasets for targeting algorithms on platforms like Meta, Google Ads, TikTok, Pinterest, and Google Analytics—boosting ad profitability through cleaner, higher-quality event data.\n\n\n\n\nWith a fast-growing customer base, we’re looking for a Solution Engineer to ensure that every client setup runs at peak performance—spotting issues early, maintaining top-tier event quality, and helping us continuously improve our platform’s tracking capabilities.\n\n\n\n\nWhat You’ll Do\n\nMonitor & Maintain – Keep a close eye on customer event counts, data flow, and event quality across supported Ad platforms, proactively catching inconsistencies before they become problems.\n\nInvestigate & Troubleshoot – Dive into customer setups to diagnose issues, respond to technical support tickets, and ensure that tracking pipelines are accurate and reliable.\n\nCollaborate & Communicate – Work directly with customers to clarify technical needs, and with our dev team to create clear, actionable development support tickets.\n\nDefine & Improve – Establish requirements for monitoring, testing, and QA processes; suggest enhancements to product features based on findings.\n\nProactive Checks – Review manual tracking setups with context and attention to detail, ensuring events are firing exactly as intended.\n\nReport & Recommend – Document and share insights with the product team to help shape the next generation of our AdTech solutions.\n\n\n\n\nWhat We’re Looking For\n\nOrganised & Analytical – Highly detail-oriented, structured, and persistent in chasing down inconsistencies.\nCustomer-Friendly Communicator – Comfortable speaking directly with customers and translating technical concepts clearly.\nExceptional Communication – Ability to communicate in clear, neutral, and professional English, both spoken and written, for global client interactions.\nProblem Solver – Ability to investigate issues independently and suggest practical solutions.\nLight Tech Background – Experience in software development, data analytics, or tracking setups.\nAdTech Familiarity – Understanding of event tracking on Meta, Google Ads, TikTok, Pinterest, and Google Analytics.\nBonus Points – German language skills.\n\n\n\n\nWhy Join Mable AI\n\nImpact at Scale – Directly influence the quality of our customers’ advertising performance.\nFast & Agile – No red tape—your insights go straight into product improvements.\nSkill Growth – Exposure to advanced AdTech setups, cross-platform tracking, and analytics strategies.\nSupportive Culture – Work with a team that values conscientiousness, thoroughness, and curiosity.\nCompetitive Package – Salary between INR 12-20 lacs per year, plus other benefits such as health insurance.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "PHP Developer",
    "job_id": "4281854660",
    "company_name": null,
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "PHP",
      "Laravel",
      "CodeIgniter",
      "Back-End Web Development",
      "Object-Oriented Programming (OOP)",
      "Front-End Development",
      "Software Development",
      "Programming"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281854660/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nWe suggest you enter details here.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a PHP Developer located in Noida. The PHP/Laravel Developer will be responsible for back-end web development, object-oriented programming (OOP), and working on various software development projects. Day-to-day tasks will include developing and maintaining website features, optimizing databases, and integrating front-end elements with server-side logic. The role requires collaboration with the front-end development team to ensure features are implemented as per specifications.\n\n\n\n\nQualifications\n\n\n\n\nBack-End Web Development and Object-Oriented Programming (OOP) skills\nKnowledge and experience in Front-End Development\nSoftware Development and general Programming skills\nExcellent problem-solving and analytical skills\nExperience with PHP frameworks such as Laravel or CodeIgniter\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Engineer Intern – Career AI Platform",
    "job_id": "4281511283",
    "company_name": "Fastcurve",
    "location": "India",
    "experience": "0-1 year",
    "salary": null,
    "key_skills": [
      "React",
      "Tailwind CSS",
      "FastAPI",
      "Python",
      "PostgreSQL",
      "APIs",
      "AI"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281851283/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: Engineer Intern – Career AI Platform\n\n Location: Noida / Remote (Hybrid options available)\n\n Duration: 3 to 6 Months Internship\n\n Stipend: As per performance and capability\n\n\n\n\nAbout Fastcurve\n\nFastcurve is a product and engineering company building innovative SaaS platforms and AI-driven solutions for global clients. Our latest initiative, the Career AI Platform, leverages cutting-edge technology to empower job seekers, recruiters, and organizations with intelligent career and hiring solutions.\n\n\n\n\nRole Overview\n\n We are looking for an Engineer Intern passionate about building modern, scalable web applications and APIs. You will work closely with our engineering team to develop, test, and optimize features for the Career AI Platform using React, Tailwind CSS, FastAPI, Python, and PostgreSQL (RDBMS).\n\n\n\n\nKey Responsibilities\n\nDevelop and maintain frontend components using React and Tailwind CSS\nBuild and enhance backend APIs using FastAPI and Python\nWork with PostgreSQL for database design, queries, and optimizations\nCollaborate with senior engineers to deliver features\nWrite clean, maintainable, and well-documented code\nParticipate in code reviews, testing, and debugging to ensure high-quality deliverables\nResearch and integrate AI-driven components where relevant to platform features\n\n\n\n\nRequirements\n\nBasic to intermediate knowledge of React, Tailwind CSS, FastAPI, Python, and PostgreSQL\nUnderstanding of REST APIs and web application architecture\nStrong problem-solving and debugging skills\nAbility to work in a fast-paced, collaborative environment\nGood communication skills and eagerness to learn\n\n\n\n\nGood to Have\n\nKnowledge of AI/ML concepts or libraries (e.g., OpenAI API, Hugging Face)\nFamiliarity with Git and version control workflows\nExposure to cloud platforms (AWS)\nExposure to deployment CI/CD\n\n\n\n\nWhat You’ll Gain\n\nHands-on experience in building a real-world AI-driven SaaS platform\nMentorship from experienced engineers and product leaders\nOpportunity to work on scalable, production-grade systems\nPotential for full-time placement based on performance",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior DevOps Engineer",
    "job_id": "4281843897",
    "company_name": "Bipolar Factory",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "DevOps",
      "CI/CD",
      "Infrastructure as Code",
      "Terraform",
      "CloudFormation",
      "Docker",
      "Kubernetes",
      "Prometheus",
      "Grafana",
      "ELK Stack",
      "AWS",
      "Azure",
      "GCP",
      "ArgoCD",
      "GitHub Copilot",
      "Cursor AI",
      "Dynatrace Davis AI",
      "PagerDuty AIOps",
      "CloudZero",
      "Snyk"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281843897/",
    "posted_at": null,
    "job_description": "About the job\n\nAt Bipolar Factory, we build futuristic tech with speed, soul, and scale. As a fast-growing product and AI-focused startup, we are passionate about automation, intelligent infrastructure, and driving innovation at every layer. We're looking for a Junior DevOps Engineer who thrives in dynamic environments and is excited to drive the backbone of high-performing, scalable systems.\n\n\n\n\nWhat You’ll Do\n\nDesign, implement, and maintain CI/CD pipelines for automated testing and deployment.\nIntegrate development workflows with DevOps pipelines to ensure seamless feature delivery.\nUse Infrastructure as Code (IaC) tools (Terraform, CloudFormation) to automate infra provisioning.\nDeploy and manage containerized applications using Docker and Kubernetes.\nBuild monitoring and alerting systems with tools like Prometheus, Grafana, and ELK Stack.\nAdminister cloud infrastructure across AWS, Azure, or GCP – compute, storage, networking, and security.\nTroubleshoot and optimize Kubernetes clusters (Pods, Nodes, Services, Networking, Security).\nIntegrate Kubernetes deployments into CI/CD flows (ArgoCD, etc.).\nParticipate in incident response, root cause analysis, and system reliability improvements.\nImplement AI-driven DevOps enhancements using tools like: \n\n -GitHub Copilot, Cursor AI – for intelligent coding and scripting\n\n -Prometheus with anomaly detection, \n\n -Dynatrace Davis AI, PagerDuty AIOps – for smart monitoring and alerts\n\n -CloudZero – for cloud cost optimization\n\n -Snyk – for AI-powered security scanning\n\n -Slack/MS Teams-integrated bots – for automated DevOps workflows\n\nAutomate recurring tasks across SDLC to reduce manual effort.\nMaintain documentation of infrastructure, pipelines, and best practices.\nCollaborate with development, QA, and product teams on goals and deliverables.\n\n\n\n\n\n\n\nYou Should Have\n\n1–2 years of hands-on experience in DevOps or Cloud Engineering roles.\nProficiency in CI/CD concepts and tools (Jenkins, GitHub Actions, GitLab CI, etc.).\nExperience with Docker and Kubernetes (deployment, networking, security, services).\nStrong understanding of Linux systems and shell scripting.\nExposure to cloud platforms like AWS, Azure, or GCP.\nFamiliarity with Infrastructure as Code (Terraform, CloudFormation).\nEagerness to work with AI/ML tools to enhance DevOps efficiency.\nA learning mindset, problem-solving attitude, and willingness to dive into new tech.\n\n\n\n\n\n\n\nWhy Join Bipolar Factory?\n\nBe part of a team building cutting-edge AI and cloud-native products.\nFlat hierarchy, fast feedback loops, and real ownership.\nOpportunities to grow across DevOps, SRE, and Cloud Architecture roles.\nFlexible work setup and a culture that values experimentation and innovation.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "WordPress Developer",
    "job_id": "4280214439",
    "company_name": null,
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "WordPress",
      "Front-End Development",
      "Back-End Web Development",
      "Responsive Web Design",
      "Web Design",
      "Web Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280214439/",
    "posted_at": null,
    "job_description": "About the job\n\nRemote \n\n Role Description\n \nThis is a full-time remote role for a WordPress Developer. The WordPress Developer will be responsible for designing, implementing, and managing websites using the WordPress content management system. Day-to-day tasks include developing front-end and back-end website architecture, ensuring the responsiveness of applications, and working closely with web designers to create attractive and user-friendly websites according to client specifications.\n\n Qualifications\n \n\nExperience in Front-End Development and Back-End Web Development\nStrong skills in Responsive Web Design and Web Design\nProficiency in Web Development specifically within the WordPress platform\nAbility to work collaboratively with design teams and other stakeholders\nExcellent problem-solving skills and attention to detail\nStrong understanding of industry trends and content management systems\nRelevant certifications in web development or similar fields are a plus\nBachelor's degree in Computer Science, Information Technology, or a related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter Software Engineer",
    "job_id": "4281589504",
    "company_name": "Digifish3",
    "location": "India",
    "experience": "2-5 years",
    "salary": null,
    "key_skills": [
      "Flutter",
      "Dart",
      "RESTful APIs",
      "Firebase",
      "mobile application development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281589504/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout Digifish3\n\nDigifish3 is a dynamic and innovative digital solutions company specializing in cutting-edge mobile and web applications. We are committed to delivering high-quality digital products that enhance user experience and business efficiency.\n\n\n\n\nJob Description\n\nWe are looking for a Flutter Software Engineer with 2 to 5 years of experience to join our talented team. The ideal candidate should have a strong understanding of Flutter development and mobile application architecture, with a passion for building seamless and scalable applications.\n\n\n\n\nKey Responsibilities:\n\nDevelop, test, and maintain high-performance Flutter applications for iOS and Android platforms.\nCollaborate with UI/UX designers to implement visually appealing and user-friendly interfaces.\nOptimize applications for performance, scalability, and responsiveness.\nWrite clean, maintainable, and efficient code following best practices and coding standards.\nDebug and resolve technical issues and application bugs.\nIntegrate third-party APIs and services as required.\nWork closely with cross-functional teams, including product managers and backend developers.\nStay updated with the latest Flutter advancements and best practices.\n\n\n\n\nRequired Skills & Qualifications:\n\n2 to 5 years of experience in Flutter app development.\nStrong understanding of Dart programming language.\nHands-on experience with RESTful APIs, Firebase, and third-party libraries.\nProficiency in state management solutions like Provider, Riverpod, Bloc, or GetX.\nExperience with Git version control and CI/CD pipelines.\nSolid understanding of mobile UI/UX principles and guidelines for both iOS and Android.\nKnowledge of native development (Kotlin, Swift) is a plus.\nStrong analytical and problem-solving skills.\nExcellent communication and teamwork skills.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Faculty",
    "job_id": "4265093065",
    "company_name": "ATOMS College of Media & Technology",
    "location": "India",
    "experience": "freshers",
    "salary": null,
    "key_skills": [
      "Fullstack Development",
      "Java",
      "PHP",
      "Python",
      "Pandas",
      "Power BI",
      "Tableau",
      "Data Visualization",
      "Statistics"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4265093065/",
    "posted_at": null,
    "job_description": "About the job\n\n💻 We’re Hiring | Software Faculty – 2 Vacancies\n\n 📍 Location: ATOMS College of Media & Technology, Near Stadium Stand, Palakkad, Kerala\n\n\n\n\nAbout the Role\n\n ATOMS College is expanding its technical education wing and is looking for skilled and enthusiastic Software Faculty members to join our team. If you're passionate about coding, data, and mentoring future tech professionals — we’d love to hear from you!\n\n\n\n\n👨‍🏫 Position: Software Faculty (2 Vacancies)\n\n\n\n\n📚 Qualification:\n\n • Any UG / PG \n\n • Proficiency in:\n\n – Fullstack Development\n\n – Java, PHP, Python (with Pandas)\n\n – Power BI / Tableau\n\n – Data Visualization, Statistics, and more\n\n • Ability to stay updated with the latest tech trends\n\n\n\n\n📝 Responsibilities:\n\n • Conduct training sessions in software development subjects\n\n • Ensure timely syllabus delivery and assignment evaluation\n\n • Guide students in projects and conduct assessments\n\n • Stay engaged with evolving industry requirements\n\n\n\n\n✅ What We’re Looking For:\n\n • Strong passion for teaching & mentoring\n\n • Quick learner with a tech-savvy mindset\n\n • Excellent communication & interpersonal skills\n\n • Good time management and multitasking ability\n\n\n\n\n🌐 Languages Required:\n\n English / Malayalam / Tamil\n\n\n\n\n🕘 Working Hours:\n\n 9:00 AM – 5:00 PM (Monday to Saturday)\n\n\n\n\n💼 Experience:\n\n Freshers & experienced candidates welcome\n\n • Attractive salary for experienced candidates\n\n • Performance-based hike after 6 months for freshers\n\n\n\n\n📞 Apply Now\n\n Contact: Shika Linto (HR Manager)\n\n 📱 9745531999 | 8086531999\n\n 📧 atomspalakkad@gmail.com\n\n 🌐 www.atomscollege.com",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Flutter Developer",
    "job_id": "4279873690",
    "company_name": "NPST",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Flutter",
      "Dart",
      "iOS",
      "Android"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279873690/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout the Job \n\n \n\nWho we are and what do we do \n\n \n\nIndia has witnessed a journey of Innovation in Digital Payments and today it leads the world with over 45% of the Global digital transaction volume. At NPST, we believe that our decade long journey has carved an opportunity for building future roadmap for the world to follow.\n\nWe are determined to contribute immensely to nation’s growth story with our vision “to provide digital technology across financial value chain” and our mission to create leadership position in digital payment space.\n\nFounded in 2013, NPST is a leading fintech firm in India, part of the Make in India initiative and listed on BSE and National Stock Exchange. We specialize in Digital Payments operating as Technology Service Provider to Regulated entities and providing Payment Platform to Industry – empowered by payment processing engine, Financial Super app, Risk Intelligence engine and digital merchant solution.\n\nWhile we drive 3% of global digital transaction volume for over 100+ clients, we aim to increase our market share by 5X in next five years through innovation and industry first initiatives.\n\n \n\nWhat will you do \n\n \n\nWe are augmenting our team and actively looking for a Flutter Developer who can add his skills & experience in strengthening our current team. \n\n\n\n\nJob responsibilities:\n\n\n\n\nDesign and Build scalable apps using Flutter and Dart. \nHave knowledge on generating flutter plugins to interact with native (iOS/Android) libraries. \nHave worked with Flutter app with different Architectures, Architectural design. \nExperience with Android SDK, Kotlin` \nUse Flutter to build cross platform mobile apps for Android, IOS and Web. This should include from making responsive UIs to efficiently query data and mange states in an optimized manner. \nTo build custom Flutter Packages. \nTranslate and build the designs and Wireframes into high-quality responsive UI code. \nWrite efficient queries for core Data. \nFirebase: Should have experience with Cloud Firestore, Push Notifications, Cloud Functions and Analytics. \nCreating and implementing API of Firebase Firestore \nShould have some basic knowledge of core language of native Android and iOS. \nGit: To manage and collaborate in different projects with the rest of the team. \n\n \n\nWhat are we looking for: \n\n \n\nPerson coming from Strong knowledge & experience in Flutter. \nDeep knowledge and experience of iOS or android development with flutter \nExperience of Firebase and other deployment cycles \nStrong educational background, preferably in the fields of computer science or engineering. \nProven working experience in same. \nStrong technical background, with understanding or hands-on experience in software development and web technologies. \nExperience in mobile application development. \nGood communication skills. Entrepreneurial skills, ability to observe, innovate and own your work. \nDetail-oriented and organized with strong time management skills. \nInfluencing skills and the ability to create positive working relationships with team members at all levels. \nExcellent communication and interpersonal skills. \nA collaborative approach and work with perfection as a group effort to achieve organization goal. \n\n \n\n \n\nEducation Qualification - Bachelor's degree \n\nExperience – 3-5 years. \n\nIndustry - IT/Software/BFSI/ Banking /Fintech \n\nWork arrangement – 5 days working from office. \n\nLocation – Bengaluru/ Mumbai/ Noida \n\n \n\nWhat do we offer: \n\n \n\nAn organization where we strongly believe in one organization, one goal. \nA fun workplace which compels us to challenge ourselves and aim higher. \nA team that strongly believes in collaboration and celebrating success together. \nBenefits that resonate ‘We Care’. \n\n \n\nIf this opportunity excites you, we invite you to apply and contribute to our success story. If your resume is shortlisted, you will hear back from us.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer",
    "job_id": "4282132350",
    "company_name": "Kline and Company",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Data Engineer",
      "Data Scientist",
      "API",
      "database schemas",
      "stored procedures",
      "data pipelines",
      "analytic functions",
      "Software Engineer"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282132350/",
    "posted_at": null,
    "job_description": "About the job\n\nHere at Kline our data capabilities have grown exponentially over the last four years. Having gone through a rapid digitization process and becoming a cloud-native corporation, we are looking for top talent to take our most important data product to the next level. So, if you are a keen Data Engineer Architect, Scientist (or a combination of the three), have a curious mindset and are interested in working in the Beauty and Consumer market research space then please reach out for an informal chat.\n\nWhat does life in Kline look like? We offer a rewarding and inclusive culture where each colleague can grow, thrive, express ideas and support our mission for innovating Kline and Company’s data solutions. You will be an instrumental team member in the build and implementation of a new and improved end-to-end solution for Kline’s most integral data product, Kline PRO.\n\nHere is a little more about the role. The role will be varied, solving new problems from:\n\nManaging big data from multiple sources using API procedures \nImplementing fit for purpose database schemas in Kline’s cloud-based architecture\nCreating stored procedures that execute advanced analytic and database cleaning functions\nBuilding effective, automated data pipelines that process huge amounts of data\n\nNow here is the official job description: Kline and Company is currently seeking a Software Engineer to join its Kline PRO Centre of Excellence, part of the wider Beauty and Wellbeing business vertical. A successful candidate will profoundly collaborate across the organization, with technical product experts in the Digital Innovation team, our key Technology partners and Beauty domain subject matter experts globally. In this role you will be directly supporting Kline PRO’s product manager, as well as engaging with business development professionals, insights analysts, and consultants. Supporting external client requests is part of this role’s responsibilities, and while not formally client facing, occasional direct client interaction may be necessary.\n\nPlease apply if you have 2 to 3 years of similar job experience. A degree in Computing, Mathematics or Science based subject would be preferred, alternatively experienced professionals with proven success in the realm of Data Science and Engineering should also apply. \n\n\n\n\nDay-to-Day activities and goals:\n\nDeveloping and maintaining SQL (and NoSQL) databases in Azure, including schema design, stored procedures and data integrity\nAutomating ETL processes with Azure tools\nData cleaning and testing, both in maintaining SQL databases and preparing data for analysis in Azure Databricks and other software products\nWorking with in-house and third-party data providers to build rich data sources\nScripting programming code for live software products, both from a functional and design angle\nDesigning fit for purpose data architecture that enables effective data processing and seamless analysis\nWorking with the data science team to develop advanced analytical algorithms\nCollaborating with the Kline PRO product owner to facilitate client queries and data requests\n\n\n\n\nEssential Skills:\n\nMinimum experience of 2 years in developing and supporting Stored Procedures \nMinimum experience of 1 year with Azure SQL Databases \nMinimum experience of 2 years in scripting functional or procedural programming\nMinimum experience of 1 year working with Microsoft Azure or other similar full stack technology\nMinimum experience of 1 year using data science coding language, such as Python or R \nExcellent English verbal and written communication skills\n\n\n\n\nAdditional Skills:\n\nExperience with any of the following is a plus:\n\nSSIS, SSAS, Multidimensional Cubes, DAX or MDX\nDatabricks, Power BI, Azure Data Factory or Azure Analysis Services\nJava Script framework, ideally Angular\nExperience in API development\n\n\n\n\nKline and Company offers a world-class international work environment; a dynamic, multi-cultural team and collegial work atmosphere; everyday, practical use of English and valuable work experience with a well-established consulting and market research firm; and a competitive compensation and benefits package in a supportive work environment.\n\nEqual Opportunity Employer",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Node.js and Angular Developer",
    "job_id": "4279870951",
    "company_name": "NPST",
    "location": "India",
    "experience": "3-6 years",
    "salary": null,
    "key_skills": [
      "Node.js",
      "Angular",
      "Web Applications",
      "Fintech"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279870951/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout the Job\n\n\n\n\nWho we are and what do we do\n\n\n\n\nIndia has witnessed a journey of Innovation in Digital Payments and today it leads the world with over 45% of the Global digital transaction volume. At NPST, we believe that our decade long journey has carved an opportunity for building future roadmap for the world to follow.\n\nWe are determined to contribute immensely to nation’s growth story with our vision “to provide digital technology across financial value chain” and our mission to create leadership position in digital payment space.\n\nFounded in 2013, NPST is a leading fintech firm in India, part of the Make in India initiative and listed on BSE and National Stock Exchange. We specialize in Digital Payments operating as Technology Service Provider to Regulated entities and providing Payment Platform to Industry – empowered by payment processing engine, Financial Super app, Risk Intelligence engine and digital merchant solution.\n\nWhile we drive 3% of global digital transaction volume for over 100+ clients, we aim to increase our market share by 5X in next five years through innovation and industry first initiatives.\n\n\n\n\nWhat will you do \n\n\n\n\nWe are seeking an experienced Node.js and Angular Developer to join our dynamic team. The ideal candidate should have 3 to 6 years of hands-on experience in developing web applications using Node.js and Angular. You will be responsible for designing, implementing, and maintaining web applications that deliver exceptional user experiences.\n\n \n\nJob responsibilities:\n\nDevelop, maintain, and optimize web applications using Node.js and Angular.\nCollaborate with cross-functional teams including front-end developers, designers, and product managers to deliver high-quality software solutions.\nWrite clean, modular, and maintainable code adhering to coding standards and best practices.\nImplement responsive design principles to ensure a seamless user experience across various devices and screen sizes.\nPerform code reviews, identify and resolve technical issues, and provide constructive feedback to team members.\nCollaborate with backend developers to integrate RESTful APIs and other web services.\nTroubleshoot and debug software defects and performance issues.\nStay up to date with the latest web development trends, technologies, and best practices.\nParticipate in the planning and estimation of development tasks.\nContribute to the documentation of software architecture, designs, and coding standards.\n\n \n\nWhat are we looking for:\n\n\n\n\n· Strong proficiency in JavaScript/TypeScript, HTML, and CSS.\n\n· Experience with Angular 2+ (Angular 6 preferred) and a deep understanding of Angular concepts such as components, services, modules, and routing.\n\n· Proficiency with Node.js and its ecosystem, including Express.js.\n\n· Knowledge of RESTful API design and integration.\n\n· Experience with version control systems, such as Git.\n\n· Familiarity with front-end build tools and package managers like npm and webpack.\n\n· Experience with responsive web design and CSS frameworks (e.g., Bootstrap).\n\n· Strong problem-solving skills and attention to detail.\n\n· Experience with database systems (e.g., MongoDB, MySQL) is a plus.\n\n· Entrepreneurial skills, ability to observe, innovate and own your work.\n\n· Detail-oriented and organized with strong time management skills. \n\n· Influencing skills and the ability to create positive working relationships with team members at all levels. \n\n· Excellent communication and interpersonal skills.\n\n· Collaborative approach and work with perfection as a group effort to achieve organization goal.\n\n \n\nEducation Qualification - Bachelor’s degree in computer science, Information Technology, or a related field. \n\nTotal / Relevant Experience – 3 to 6 years\n\nIndustry - IT/Software/BFSI/ Banking /Fintech\n\nWork arrangement – 5 days working from office\n\nLocation – Noida\n\n \n\nWhat do we offer:\n\n· An organization where we strongly believe in one organization, one goal.\n\n· A fun workplace which compels us to challenge ourselves and aim higher.\n\n· A team that strongly believes in collaboration and celebrating success together.\n\n· Benefits that resonate ‘We Care’.\n\nIf this opportunity excites you, we invite you to apply and contribute to our success story. If your resume is shortlisted, you will hear back from us.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "React.js Frontend Developer",
    "job_id": "4281581477",
    "company_name": "Delta4 Infotech Pvt. Ltd.",
    "location": "India",
    "experience": "freshers",
    "salary": null,
    "key_skills": [
      "React.js",
      "Frontend",
      "JavaScript",
      "HTML",
      "CSS",
      "Tailwind CSS",
      "APIs",
      "Next.js"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281581477/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are Delta4 Infotech Pvt. Ltd., the team behind YourGPT – a next-gen AI platform.\n\nWe are looking for a Fresher React.js Frontend Developer with strong fundamentals and a passion for building fast, scalable, and modern web applications. If you have worked on projects using React.js and are confident in your frontend skills, we’d love to have you on our team.\n\nResponsibilities\n\n\nBuild responsive, interactive web applications using React.js. \nIntegrate APIs to fetch and display dynamic data effectively. \nWrite clean, efficient, and maintainable code using JavaScript, HTML, and CSS (or Tailwind CSS). \nCollaborate with the team to deliver high-quality, performant applications. \nContinuously learn and adopt modern frontend best practices and tools. \n\n\nRequirements\n\n\nGood knowledge of React.js — components, props, state, hooks, and lifecycle methods. \nStrong understanding of JavaScript, HTML, and Tailwind CSS. \nExperience working with REST APIs. \nAbility to debug, test, and optimize React applications. \nWillingness to learn and work in a collaborative environment. \n\n\nGood To Have\n\n\nExperience with Next.js. \nFamiliarity with Tailwind CSS or other CSS-in-JS libraries. \nUnderstanding of responsive design principles. \n\n\nWho Can Apply?\n\n\nFresh graduates with hands-on project experience in React.js. \nSelf-learners who have built personal or academic projects in React.js. \nDevelopers eager to work on real-world applications and grow their skills. \n\n\nHow To Apply\n\nWe care about what you’ve built, Please share:\n\n\nLinks to your projects (GitHub, CodeSandbox, personal website, etc.) \nYour portfolio (if available) \nAny relevant code samples or small applications you’ve created.\n\n\nSkills: javascript,rest apis,react.js,fresherjobs,react,tailwind css,frontend developer,css,frontend development,html",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Specialist (React)",
    "job_id": "4281874837",
    "company_name": "Z50",
    "location": "India",
    "experience": "2+ years",
    "salary": "₹65,000/month",
    "key_skills": [
      "React.js",
      "JavaScript",
      "HTML5",
      "CSS3",
      "Redux",
      "state management"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281874837/",
    "posted_at": null,
    "job_description": "About the job\n\nWe’re building a global iGaming ecosystem combining gambling, sports, news, and charity – and we need React talent to bring our vision to life.\n\n\n\n\n💻 Role: Frontend Specialist (React)\n\n📍 Location: Bangalore / Whitefield – On-site\n\n💰 Salary: ₹65,000/month (CTC) + growth opportunities\n\n\n\n\nWhat you’ll do:\n\n • Build high-performance, responsive React apps\n\n • Collaborate with backend & design teams\n\n • Optimize UI for speed and usability\n\n\n\n\nWhat we’re looking for:\n\n • 2+ years in React.js, JavaScript (ES6+), HTML5, CSS3\n\n • Experience with Redux/state management\n\n • Good eye for clean, user-friendly design\n\n\n\n\nWhy Z50?\n\n✅ Global-scale projects\n\n✅ Social impact at our core\n\n✅ Tea, snacks, and a supportive team culture 🍵\n\n\n\n\n📧 Apply: careers@z50.ca",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "QAD Technical Consultant / Techno-Functional Consultant",
    "job_id": "4277523710",
    "company_name": null,
    "location": "India",
    "experience": "2-4 years",
    "salary": null,
    "key_skills": [
      "QAD ERP",
      "Progress 4GL",
      "Java",
      "ERP implementation",
      "data interfaces",
      "integration solutions",
      "technical support"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4277523710/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: QAD Technical Consultant / Techno-Functional Consultant\n\nLocation: Goregaon, Mumbai (Work from Office)\n\nExperience: 2 – 4 years\n\nJob Description:\n\nWe are seeking a skilled and dynamic QAD Technical Consultant with a minimum of 2 years of experience to join our team. As a QAD Technical Consultant, you will play a vital role in the technical implementation and customization of QAD ERP solutions.\n\nResponsibilities:\n\n· Implement and customize QAD ERP solutions based on client requirements.\n\n· Develop and maintain technical documentation for customizations.\n\n· Collaborate with cross-functional teams to integrate QAD solutions with other enterprise systems.\n\n· Design and implement data interfaces and integration solutions.\n\n· Provide technical support for QAD applications, addressing issues and ensuring system stability.\n\n· Conduct troubleshooting and debugging of technical issues.\n\n· Write, modify, and maintain scripts and code to enhance QAD functionality.\n\n· Collaborate with development teams to create custom solutions.\n\n· Work closely with clients to understand technical requirements and challenges.\n\n· Collaborate with functional consultants to align technical solutions with business needs.\n\nQualifications:\n\n· Bachelor’s degree in information technology, Computer Science, or a related field.\n\n· 2-4 years of experience working with QAD ERP solutions.\n\n· Proficiency in programming languages such as Progress 4GL, Java, or others.\n\n· Strong understanding of QAD ERP architecture and modules.\n\n· Knowledge of database concepts and SQL.\n\n· Good Knowledge in Progress 4GL, CHUI, NETUI & QRF's\n\n· Experience QRF/Progress coding /Browse.\n\n \n\nPreferred Skills:\n\n· QAD certification or relevant certifications in ERP technologies.\n\n· Progress 4GL, CHUI, NETUI & QRF's\n\n· Experience with data migration and conversion processes.\n\n· Familiarity with web technologies (HTML, JavaScript, CSS).\n\n· Familiarity with linux environment.\n\n· QRF/Progress coding /Browse.\n\n· Effective communication skills with both technical and non-technical stakeholders.\n\n· Strong problem-solving and analytical skills.\n\nLocation – \n\n\n\n\nGoregaon, Mumbai\n\n\n\n\nMail your resumes at hr@alitersolutions.com",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Golang Developer",
    "job_id": "4281585953",
    "company_name": "Travel & Payments",
    "location": "India",
    "experience": "Minimum 2 years",
    "salary": null,
    "key_skills": [
      "Golang",
      "AI",
      "SQL",
      "Postgres",
      "unit testing",
      "OWASP",
      "Payment Service Providers"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585953/",
    "posted_at": null,
    "job_description": "About the job\n\nAt Travel & Payments, we are looking to hire for one of our clients. While this seems like an outsourced work, but it is specialized because of two reasons:\n\nIt is in the same industry in which we do business consulting\nThe working will be the same like that of the client, based in South America & Singapore\n\n\n\n\nExperience required:\n\nMinimum 2 years\n\n\n\n\nMinimum Qualifications\n\n\n\n\n● Proficiency using Golang.\n\n● Adaptability to a constantly changing roadmap.\n\n● Demonstrated knowledge using AI tools.\n\n● Autonomy in tasks executions.\n\n● Demonstrated knowledge in unit testing\n\n● Ability to communicate complicated technical problems to both technical and business\n\naudiences.\n\n● Knowledge using SQL, Postgres\n\n● Willingness to learn new technologies and frameworks.\n\n● Entrepreneurship.\n\n● Security on OWASP.\n\n● Detail-oriented with a strategic mindset and the ability to think critically and creatively to\n\nsolve complex problems and drive business growth.\n\n● Fluency English.\n\n\n\n\nPreferred Qualifications\n\n● Experience in the payment industry.\n\n● Experience integrating Payment Service Providers.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Backend Developer (Go)",
    "job_id": "4281585817",
    "company_name": null,
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Go",
      "backend systems",
      "unit tests",
      "integration tests",
      "scalability"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585817/",
    "posted_at": null,
    "job_description": "About the job\n\nScope of work involves designing, developing, and maintaining scalable and efficient backend systems using the Go programming language. Resource will participate in code reviews, write unit tests and integration tests, and debug issues to ensure high-quality code. He/ She will also collaborate with cross-functional teams to ensure solutions meet business goals and user needs, and optimize the performance of backend systems for scalability and efficiency.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Oracle Cloud HCM Fast Formula Developer",
    "job_id": "4282138077",
    "company_name": "MyRemoteTeam, Inc",
    "location": "India",
    "experience": "3-5 years",
    "salary": null,
    "key_skills": [
      "Oracle Cloud HCM",
      "Fast Formulas",
      "Payroll",
      "Absence",
      "Benefits",
      "OTL",
      "Compensation",
      "DBIs",
      "context variables",
      "input values"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282138077/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout Us\n\nMyRemoteTeam, Inc is a fast-growing distributed workforce enabler, helping companies scale with top global talent. We empower businesses by providing world-class software engineers, operations support, and infrastructure to help them grow faster and better.\n\n\n\n\nJob Title:  Oracle Cloud HCM Fast Formula Developer\n\nExperience: 3 Years to 5 Years\n\nWork Location: Affintrix Office, Bangalore\n\n\n\n\n\n\n\nJob Summary:\n\nWe are looking for an experienced Oracle Cloud HCM Fast Formula Developer who can design, develop, and maintain Fast Formulas across various HCM modules like Payroll, Absence, Benefits, OTL, and Compensation.\n\n\n\n\n\n\n\n\n\n\n\n\n\nKey Responsibilities:\n\nDevelop and manage Fast Formulas in Oracle HCM Cloud\nWrite complex logic and calculations for:\nPayroll rules\nLeave/absence plans\nBenefits eligibility\nCompensation policies\nTroubleshoot and fix formula-related issues\nUse tools like Formula Results, Messages, and Logging for testing and debugging\nWork with database items (DBIs), context variables, and input values in formulas\nCollaborate with technical and functional teams during implementations\n\nRequirements:\n\nStrong hands-on experience with Oracle Cloud HCM Fast Formulas\nGood understanding of HCM modules: Payroll, OTL, Absence, Benefits, etc.\nExperience in Oracle HCM Cloud implementation or support projects\nAbility to work with cross-functional teams",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Java Developer",
    "job_id": "4279872815",
    "company_name": "NPST",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "Java",
      "JAVA EE",
      "Fintech",
      "IMPS",
      "UPI",
      "software development lifecycle"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279872815/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout the Job \n\n\n\n\nWho we are and what do we do \n\n\n\n\nNPST is a fintech company bridging the banking and fintech worlds with its product suite of technology and payments, for over 10 years. We provide software and digital payment solutions to the BFSI Industry as a Technology service provider. We function as a Technology Service Provider (TSP) and a Third-Party Aggregator Provider (TPAP), catering to stakeholders across the financial value chain, including banks, merchant aggregators, merchants, and consumers. \n\nWe got listed targeting SME IPO in Aug – 2021 on the NSE Emerge platform with a market cap of 2000 Cr (as of Mar’24) and became NPCI- an approved Merchant Payment Service Provider, acquiring merchants and facilitating payment. NPST has a marquee clientele having 10 Banks and 30+ PAPG and Merchants. \n\nWe believe, Technology drives generations making lives simpler and efficient and aim to change lives and build financially inclusive societies. \n\n \n\nWhat will you do\n\n\n\n\nWe are looking for Java Developers with experience in building high-performing, scalable, enterprise-grade applications for Banking/Fintech domain specifically IMPS/UPI. \n\nYou will be part of a talented software team. Roles and responsibilities include managing JAVA/ JAVA EE application development while providing expertise in full software development lifecycle, from concept and design to testing.\n\n\n\n\nJob responsibilities: \n\n\n\n\nHands-on experience in design and defining architecture of complex web-based applications.\nBuilding distributed application using Core JAVA, Spring, Spring boot.\nExperience in ORM frameworks such as Hibernate/JPA.\nWorking experience with SQL and NoSQL databases such as MySQL, PostgreSQL, Oracle, MongoDB/Cassandra.\nHands-on experience on Microservices, REST.\nContinuous Integration tools like Jenkins, GitHub.\nKnowledge of Cloud such as Amazon Web Services.\nHands-on knowledge of build tools like Maven, Gradle.\nExperience working with Git, Junit, Mockito, JIRA and similar tools.\nExperience on Apache Spark & other Machine Learning tools will be added advantage.\n\n \n\nWhat are we looking for: \n\n\n\n\nHands on experience inn Spring, Spring Boot, Hibernate, RDBMS, NoSQL, multithreading, Java, REST, xml parsers, Web Services, MySQL, Oracle, Cassandra, MongoDB\nEntrepreneurial skills, ability to observe, innovate and own your work. \nDetail-oriented and organized with strong time management skills. \nInfluencing skills and the ability to create positive working relationships with team members at all levels. \nExcellent communication and interpersonal skills. \nA collaborative approach and work with perfection as a group effort to achieve organization goal.\n\n \n\nEducation Qualification - Btech/BCA/MCA/MTech\n\nExperience – 4-7 years.\n\nIndustry - IT/Software/BFSI/ Banking /Fintech \n\nWork arrangement – 5 days working from office\n\nLocation – Noida\n\n \n\nWhat do we offer: \n\nAn organization where we strongly believe in one organization, one goal. \nA fun workplace which compels us to challenge ourselves and aim higher. \nA team that strongly believes in collaboration and celebrating success together. \nBenefits that resonate ‘We Care’. \n\n \n\nIf this opportunity excites you, we invite you to apply and contribute to our success story. If your resume is shortlisted, you will hear back from us.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer",
    "job_id": "4281876287",
    "company_name": "Cydexsoft",
    "location": "India",
    "experience": "freshers",
    "salary": null,
    "key_skills": [
      "Software Engineer",
      "full stack development",
      "flutter",
      "Back-End Web Development",
      "Software Development",
      "Programming",
      "Object-Oriented Programming (OOP)"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281876287/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nCydexsoft is an innovative IT solutions company specializing in full stack web and mobile app development. We deliver scalable, high-quality digital solutions that empower businesses, enhance productivity, and drive growth. Our team blends technical expertise with creativity to transform ideas into impactful products.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Software Engineer. The Software Engineer will be responsible for developing, testing, and maintaining software applications. They will work on back-end web development, programming, and applying object-oriented programming (OOP) principles. The role requires collaboration with cross-functional teams to ensure high-quality software solutions.\n\n\n\n\nQualifications\n\nStrong understanding of Computer Science principles\nExperience in full stack development in flutter\nExperience in Back-End Web Development and Software Development\nProficient in Programming and Object-Oriented Programming (OOP)\nExcellent problem-solving and analytical skills\nAbility to collaborate in a team environment\nBachelor’s degree in Computer Science, Software Engineering, or related field.\nExperience with software development lifecycle and methodologies is a plus\nApplicable for freshers.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Shopify Developer Intern",
    "job_id": "4282327134",
    "company_name": null,
    "location": "India",
    "experience": "internship",
    "salary": null,
    "key_skills": [
      "Shopify Liquid",
      "HTML5",
      "CSS3",
      "Tailwind CSS",
      "JavaScript",
      "jQuery",
      "e-commerce"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282327134/",
    "posted_at": null,
    "job_description": "About the job\n\nPaid Internship | Remote | 4 months | Bonus trip based on performance\n\nWe’re building something fresh - a curated online marketplace gearing up for launch in the UK. Think culture, commerce, and code coming together to connect global makers with local customers. If you're a self-driven builder with clean code, a sharp mind, and serious hustle, we want you on the team. \n\n\n\n\nWho you are:\n\nFinal-year or recently graduated in CS, Web Dev, or E-comm?\n\n Ready to roll up your sleeves and actually build something that matters?\n\n This 4-month grind could be your glow-up era. Real work, real ownership, and if you bring the heat, there’s more on the table.\n\n\n\n\nWhat you'll do:\n\nYou’ll work side-by-side with the founder and core team to build, break, and scale a high-converting e-commerce platform. Expect to:\n\nCustomize and develop Shopify theme using Liquid\nBuild clean, responsive UIs with HTML5, CSS3 (Tailwind preferred)\nAdd interactive magic via JavaScript / jQuery\nCo-create new features and vendor onboarding flows\nWork on marketplace logic, search and filter structure\nDebug, iterate fast, and ship clean\nApply performance and UX best practices for global users\nGain hands-on exposure to real startup decision-making and product thinking\n\n\n\n\nTech stack you'll use: (Must Have)\n\nShopify Liquid - themes, collections, product pages\nHTML5/CSS3 - layout, styling, responsive design\nJavaScript / jQuery - dynamic content and user interactions\n\n\n\n\n💡 Bonus Add-ons: (Make You Stand Out)\n\nJSON, SASS, Git, API integration\nPerformance optimization tools\nTechnical SEO\nNode.js or Python (for backend features or automation)\nExperience with multi-vendor features or apps like Webkul\n\n\n\n\nWho should apply:\n\nGraduates or final-year students in Computer Science, Web Development, or E-commerce\nBootcamp learners or self-taught devs with real project experience\nBuilders who take initiative, love figuring things out, and don’t wait to be told what to do\n\n\n\n\nWhat you'll get:\n\nKick off at ₹5K - bring the fire, take ownership, and level up to ₹10K from Month 2, with room to grow as you do.\nReal Shopify product work - meaningful, hands-on experience\nDirect mentorship from the founder\nA sponsored short trip of your choice at the end (Yes, really. Crush it and the trip’s on us.) 🏕️\n\n\n\n\n💬 How to apply:\n\nSend the following to hello@gloobio.com with the subject: Shopify Internship Application – [Your Name]\n\nPlease include:\n\nYour GitHub, portfolio, or anything you’ve built\nYour resume\nA short note on why you’d be perfect for this role (keep it real, not formal)\n\n\n\n\nWe’re not looking for perfection. We’re looking for passion, proof of hustle, and people who love to build. Let’s make something world-class together.\n\n\n\n\n#ShopifyInternship #FrontendDeveloper #LiquidDeveloper #WebDevIntern #EcommerceDev #RemoteInternship #HustleMindset #StartupOpportunity #WebkulExperience",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "VBA Macros Developer",
    "job_id": "4281876742",
    "company_name": "biglanguage",
    "location": "India",
    "experience": "entry level",
    "salary": null,
    "key_skills": [
      "VBA",
      "Macros",
      "Microsoft Office",
      "MS Word",
      "automation",
      "template development",
      "Python",
      "shell scripts"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281876742/",
    "posted_at": null,
    "job_description": "About the job\n\nJob title: VBA Macros Developer\n\nLocation: Noida (Work from Office)\n\nShift: US Shift\n\nReports to: Director of Solution Architecture\n\n\n\n\nQualifications:\n\n\n\n\nDemonstrates strong proficiency in Microsoft Office Suite (especially MS Word)\nProven experience working as a Word Developer or in a similar role using VBA for macro development with a strong focus on automation, template development, and troubleshooting.\nDemonstrates excellent problem-solving and communication skills to collaborate and communicate with business users to optimize workflows and automate processes.\nDevelops, maintains and optimizes VBA applications and macros for automating Word document formatting and templating.\nStrong attention to detail, particularly when managing templates with large datasets or complex formatting\nProven ability to quickly adapt to evolving project needs and respond to feedback from stakeholders\n\n\n\n\nPreferred Qualifications:\n\n\n\n\nExperienced working in PDF data extraction into Word templates is a plus\nPrior experience within the localization industry (of any position/ localization workflow/ CAT tools) is a plus.\nExperienced in document composition automation including building, updating and releasing changes to templates is a plus.\nFamiliar with version control platform (Git) is a plus.\nProven knowledge or experience in scripting languages such as Python, shell scripts or similar scripting languages is a plus.\n\n\n\n\n\n\n\nThink global. Think BIG.\n\nVisit us: https://biglanguage.com\n\nLinkedin: https://www.linkedin.com/company/big-language-solutions/mycompany/",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Python Developer",
    "job_id": "4282170121",
    "company_name": "Artmac Soft",
    "location": "India",
    "experience": "0 - 1 Year",
    "salary": null,
    "key_skills": [
      "Python",
      "Object-Oriented Programming (OOP)",
      "AI Models",
      "HTML",
      "CSS",
      "JavaScript",
      "RESTful APIs",
      "Git",
      "MySQL",
      "PostgreSQL",
      "MongoDB",
      "AWS",
      "Azure",
      "GCP"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280976081/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 2-4 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software AI Engineer",
    "job_id": "4258070307",
    "company_name": "Netradyne",
    "location": "India",
    "experience": "2 to 3 years",
    "salary": null,
    "key_skills": [
      "AI",
      "Computer Vision",
      "Edge Computing",
      "Python",
      "System Optimization"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282170121/",
    "posted_at": null,
    "job_description": "About the job\n\nWho We Are\n\nArtmac Soft is a technology consulting and service-oriented IT company dedicated to providing innovative technology solutions and services to customers.\n\nJob Description\n\nJob Title : Python Developer (Freshers)\n\nJob Type  : Full Time\n\nExperience  : 0 - 1 Year\n\nLocation  : Hyderabad, Telangana\n\nResponsibilities\n\n\nStrong knowledge of Python programming. \nBasic understanding of OOP (Object-Oriented Programming) principles. \nStrong Knowledge on AI Models \nKnowledge of HTML, CSS, and JavaScript is an added advantage. \nGood understanding of RESTful APIs and JSON/XML. \nFamiliarity with version control systems like Git. \nBasic knowledge of databases (MySQL, PostgreSQL, MongoDB, etc.). \nStrong problem-solving skills and attention to detail. \nGood communication and interpersonal skills. \nCompleted a Python course or internship. \nKnowledge of cloud platforms like AWS, Azure, or GCP. \n\n\nQualifications\n\n\nBachelor's degree or equivalent combination of education and experience.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4258070307/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nNetradyne harnesses the power of Computer Vision and Edge Computing to revolutionize the modern-day transportation ecosystem. We are a leader in fleet safety solutions. With growth exceeding 4x year over year, our solution is quickly being recognized as a significant disruptive technology. Our team is growing, and we need forward-thinking, uncompromising, competitive team members to continue to facilitate our growth.\n\nAbout Us\n\nNetradyne, an innovator in fleet and road safety technologies, utilizes the potential of Artificial Intelligence and Edge Computing to transform the transportation ecosystem. By adopting Netradyne's vision-based technology, organizations have achieved remarkable results, such as a 50% reduction in road accidents and over 90% decrease in dist racted driving incidents, while also excelling in other performance indicators.\n\nWith its headquarters in Bangalore and San Diego, Netradyne’s Driver\n\n\nI assists organizations in enhancing safety, boosting driver retention, increasing profitability, and facilitating transparency\n\n\n\nJob Title: Software AI Engineer\n\nExperience: 2 to 3 years\n\nRole Overview\n\nAs a Software AI Engineer in the System Optimization team, you will contribute to developing scalable, efficient AI-powered solutions deployed on edge devices. This role involves working with a multidisciplinary team to enhance software performance, optimize resource usage, and streamline AI model integration into production environments.\n\nResponsibilities\n\n\nContribute to the development of tools and frameworks for performance measurement and system optimization.\nAssist in profiling and tuning AI models and software components for deployment on edge platforms (CPU/GPU/DSP).\nSupport algorithm integration for driver monitoring and driver assistance systems.\nHelp optimize data pipelines and logging/reporting mechanisms to support real-time analytics.\nCollaborate with senior engineers to identify bottlenecks and implement efficient code.\nSupport debugging and triaging of issues in production and test environments.\n\n\n\nRequired Skills\n\n\nE/B.Tech or M.E/M.Tech in Computer Science, Electronics, Electrical, or related fields.\n2–3 years of experience in software development, preferably in embedded or IoT environments.\nGood grasp of CS fundamentals including data structures, algorithms, and operating systems.\nProficiency in at least one programming language: C/C++, Python.\nBasic knowledge of system profiling, performance tuning, or resource optimization.\nFamiliarity with ML/CV concepts and frameworks such as OpenCV, TensorFlow, PyTorch, or ONNX is a plus.\nExposure to build systems (Make/CMake), version control (Git), and CI/CD tools like Jenkins.\n\n\n\nPreferred (Good To Have)\n\n\nFamiliarity with embedded/edge computing platforms such as NVIDIA Jetson, Qualcomm Snapdragon, etc.\nExposure to ML optimization tools like TensorRT, SNPE, or OpenVino.\nUnderstanding of containerization (Docker) and orchestration (Kubernetes) environments.\nHands-on experience with Linux-based development and debugging.\n\n\n\nWe are committed to an inclusive and diverse team. Netradyne is an equal-opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status, or any legally protected status.\n\nIf there is a match between your experiences/skills and the Company's needs, we will contact you directly.\n\nNetradyne is an equal-opportunity employer.\n\nApplicants only - Recruiting agencies do not contact.\n\nRecruitment Fraud Alert!\n\nThere has been an increase in fraud that targets job seekers. Scammers may present themselves to job seekers as Netradyne employees or recruiters. Please be aware that Netradyne does not request sensitive personal data from applicants via text/instant message or any unsecured method; does not promise any advance payment for work equipment set-up and does not use recruitment or job-sourcing agencies that charge candidates an advance fee of any kind. Official communication about your application will only come from emails ending in ‘@netradyne.com’ or ‘@us-greenhouse-mail.io’.\n\nPlease review and apply to our available job openings at Netradyne.com/company/careers. For more information on avoiding and reporting scams, please visit the Federal Trade Commission's job scams website.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Junior Python Developer",
    "job_id": "4279890508",
    "company_name": "AppGlide",
    "location": "India",
    "experience": "1+ years",
    "salary": null,
    "key_skills": [
      "Python",
      "DevOps",
      "YAML",
      "AWS",
      "GCP",
      "Azure"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279890508/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany\n\nAppGlide is a growth partner for fast growing software product companies globally. AppGlide leverages the latest technology and processes to enable SaaS companies to serve their customers better and grow faster. Based in Chennai, AppGlide is led by a team of IIT & IIM alumni.\n\n\n\n\nRole & Responsibility: \n\nWe are looking for a Junior Python Developer to join our customer's solutions engineering team. You will be working closely with customer to deploy solutions across global customer deployments.\n\n\n\n\nOur client is an industry leading AIOps platform designed to provide instant, real-time actionable insights for managing multi-domain network and application infrastructures. By bringing together multiple sources of data into one easy to use platform, IT teams can troubleshoot network issues faster, avoid downtime, reduce MTTR and improve efficiency.\n\n\n\n\nSkills:\n\n1+ years experience in python\n1+ years experience in DevOps\nBachelor’s degree or above in Computer Science / Information Technology\nYAML Expertise: Proficiency in YAML syntax and its usage for configuration and data serialization\nExposure to public cloud platforms such as AWS, GCP, and Azure\nHas a solid understanding and can demonstrate through daily tasks how the architecture, design, and data flow of the application they support for purposes of effective script design.\nCan read, develop, debug, and maintain simple to advanced automation scripts/ code Independently\n\n\n\n\nResponsibilities:\n\nBe a test expert on customer's operational analytics solution for networks, applications & security workflows;\nTake a hands-on role in the deployment of product to meet customer requirements;\nCollaborate with engineering team deployment plans for POC, and lead to completion of deployment;\nImprove the product features and quality through enhancement proposals and customer reviews.\n\n\n\n\nWhy you'll love AppGlide\n\nWe believe in a culture of mutual respect and ownership. We value employee’s work life balance and ensure you have ownership of your work streams. We invest in our employees training and development with structured learning plans.\n\n \n\nLocation\n\nThe role will be based in Chennai\n\n\n\n\n#Hiring #TechJobs #PythonJobs #DataJobs #NowHiring #JobOpening #JoinOurTeam #WeAreHiring #PythonDeveloper #PythonEngineer #PythonHiring #PythonProgrammer #DataEngineer #ETLJobs #GCPJobs #DataVisualization #OperationalAnalytics #NetworkAnalytics #CloudEngineer #DevOps #SiteReliabilityEngineering #AutomationEngineer #Ansible #Terraform #Kubernetes #Docker #CloudComputing",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior Python Django Developer",
    "job_id": "4279885779",
    "company_name": null,
    "location": "India",
    "experience": "entry level",
    "salary": "₹6,000 – ₹10,000/month",
    "key_skills": [
      "Python",
      "Django",
      "PostgreSQL",
      "REST APIs",
      "HTML",
      "CSS",
      "JavaScript",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279885779/",
    "posted_at": null,
    "job_description": "About the job\n\n🚀 We're Hiring: Junior Python Django Developer (Full-Time)\n\n📍 Remote | Salary: ₹6,000 – ₹10,000/month\n\n\n\n\nAre you a passionate and self-motivated Python/Django developer just starting your career? We’re looking for a Junior Django Developer to join our growing tech team and work on exciting real-world projects.\n\n\n\n\n 👨‍💻 About the Role\n\n\n\n\n Full-time opportunity with flexible working hours.\n\n Work closely with our senior developers and product teams.\n\n Learn, build, and grow while working on real applications and SaaS platforms.\n\n\n\n\n 🧩 Responsibilities\n\n\n\n\n Develop and maintain Django-based web applications.\n\n Write clean, efficient, and reusable code.\n\n Work with PostgreSQL, REST APIs, and front-end integration (basic HTML/CSS/JS).\n\n Debug issues and assist in code reviews.\n\n Participate in team stand-ups and planning meetings.\n\n\n\n\n ✅ Requirements\n\n\n\n\n Basic knowledge of Python and Django (projects or coursework).\n\n Familiarity with Git, REST APIs, and databases (PostgreSQL/MySQL).\n\n Willingness to learn, take feedback, and adapt.\n\n Good communication skills.\n\n Must be able to commit full-time (8 hours/day).\n\n\n\n\n 💸 Salary\n\n\n\n\n ₹6,000 to ₹10,000/month based on skills and performance.\n\n Regular performance reviews and growth opportunities.\n\n\n\n\n 🎯 Ideal for\n\n\n\n\n Recent graduates or self-taught developers looking for their first real-world experience.\n\n Freelancers or interns ready to transition into a full-time role.\n\n\n\n\n💼 About Us\n\nWe are a product-based software company building modern SaaS platforms across education, video conferencing, payments, and more. You'll be part of a small, focused team where your contributions truly matter.\n\n\n\n\n📬 How to Apply\n\nSend your resume, portfolio (if any), and a short note about why you’re interested to: careers@pybex.io or DM me directly here on LinkedIn.\n\n\n\n\nLet’s build something meaningful together. If you're eager to grow with a passionate team — we’d love to hear from you!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "React Native Developer",
    "job_id": "4281071779",
    "company_name": null,
    "location": "India",
    "experience": "2+ years",
    "salary": null,
    "key_skills": [
      "React Native",
      "JavaScript",
      "TypeScript",
      "iOS",
      "Android",
      "RESTful APIs",
      "React Navigation",
      "Java",
      "Kotlin",
      "Swift",
      "Objective-C",
      "CI/CD",
      "Firebase",
      "Jest",
      "Detox"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281807178/",
    "posted_at": null,
    "job_description": "About the job\n\nResponsibilities\n\n2+ years of hands-on experience in React Native\n\nProficient in JavaScript/TypeScript\n\nSolid understanding of iOS and Android development lifecycles\n\nFamiliar with RESTful APIs and integration of third-party libraries\n\nKnowledge of native modules and bridging\n\nExperience with navigation libraries like React Navigation\n\nGood understanding of mobile app architecture and performance tuning\n\nExperience with native Android (Java/Kotlin) or iOS (Swift/Objective-C)\n\nFamiliarity with mobile CI/CD pipelines\n\nKnowledge of App Store / Play Store deployment process\n\nExposure to testing frameworks like Jest, Detox, etc.\n\nFamiliarity with tools like Firebase, Push Notifications, and Crashlytics",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "WordPress Developer",
    "job_id": "4270175412",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "WordPress",
      "Elementor",
      "CSS3",
      "JavaScript",
      "HTML5",
      "jQuery",
      "WooCommerce",
      "Website Speed Optimization"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4270175412/",
    "posted_at": null,
    "job_description": "About the job\n\nRoles & Responsibilities:\n\nWorking on full projects of WordPress website development, from scratch to finish. (Using Elementor).\n\nDelivering 100% responsive & perfect cross browser compatibility on projects.\n\nExpert knowledge about Elementor in WordPress.\n\nTheme Customization.\n\nDoing the website maintenance of existing WordPress clients & for new ones.\n\nCommunicating with client for changes in website, layout, bugs fixing and delivering the project.\n\nKnowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQuery.\n\nKnowledge of WooCommerce & Standard Features with customizations.\n\nWebsite Speed Optimization.\n\nExperience in creating multilingual websites.\n\n\n\n\nKey Requirements:\n\nEffectively meet deadlines and troubleshoot issues while handling multiple priorities.\n\nSelf-motivated with a high degree of initiative.\n\nAbility to get the job done in time with strong sense of urgency.\n\nStrong problem solving and analytical skills.\n\nDemonstrates ability to learn quickly within a continually changing, challenging environment.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Advance Auto Parts Technology Team",
    "job_id": "4280969909",
    "company_name": "Advance Auto Parts",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4280969909/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 1-2 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Dotnet Developer",
    "job_id": "4281586759",
    "company_name": "Triangle Mind Technologies Private Limited",
    "location": "Lucknow",
    "experience": "2+ years",
    "salary": null,
    "key_skills": [
      "Dotnet",
      ".NET Core",
      "ASP.NET MVC",
      "Object-Oriented Programming (OOP)",
      "Software Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281586759/",
    "posted_at": null,
    "job_description": "About the job\n\nPlease APPLY only if you can come for interview.\n\n\n\n\nCompany Description\n\nTriangle Mind Technologies Private Limited is an India-based IT company with expertise in ERP, PeopleSoft, Oracle Apps, web designing, and web-applications. Our services include IT Training, Web Solutions, and Software Solutions tailored to meet clients' unique needs. We are committed to delivering value through customized IT services and solutions.\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for a Dotnet Developer, located in Lucknow. The Dotnet Developer will be responsible for developing, configuring, and maintaining software applications using .NET technologies. Day-to-day tasks include writing clean, scalable code, collaborating with team members to design and implement software solutions, troubleshooting and debugging applications, and participating in code reviews. The developer will also be involved in creating and managing databases, ensuring performance, quality, and responsiveness of applications.\n\n\n\n\nQualifications\n\nStrong skills in Object-Oriented Programming (OOP) and Software Development\nProficiency in .NET Core and Programming\nExperience with ASP.NET MVC\nExcellent problem-solving and analytical abilities\nStrong teamwork and communication skills\nAbility to work on-site in Lucknow\nExperience in developing and maintaining enterprise-level applications is a plus\nBachelor's degree in Computer Science, Engineering, or related field\n\n\n\n\nLocation: Lucknow\n\nExperience: 2-3 years\n\nMail: ajay@trianglemind.in, trianglemindtechnology@gmail.com\n\nAddress: 5/183 A, First Floor, Vipul Khand, Near Dayal Pardise, Lucknow.\n\nVisit Us: www.trianglemind.in\n\nWhatsApp: +919648111197, 9335818839",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Oracle Cloud HCM Fast Formula Developer",
    "job_id": "4282134217",
    "company_name": "MyRemoteTeam, Inc",
    "location": "Bangalore",
    "experience": "3 Years to 5 Years",
    "salary": null,
    "key_skills": [
      "Oracle Cloud HCM",
      "Fast Formula",
      "Payroll",
      "Absence Management",
      "Benefits",
      "OTL",
      "Compensation",
      "HCM Cloud"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282134217/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout Us\n\nMyRemoteTeam, Inc is a fast-growing distributed workforce enabler, helping companies scale with top global talent. We empower businesses by providing world-class software engineers, operations support, and infrastructure to help them grow faster and better.\n\n\n\n\nJob Title:  Oracle Cloud HCM Fast Formula Developer\n\nExperience: 3 Years to 5 Years\n\nWork Location: Affintrix Office, Bangalore\n\n\n\n\nJob Summary:\n\nWe are looking for an experienced Oracle Cloud HCM Fast Formula Developer who can design, develop, and maintain Fast Formulas across various HCM modules like Payroll, Absence, Benefits, OTL, and Compensation.\n\n\n\n\nKey Responsibilities:\n\nDevelop and manage Fast Formulas in Oracle HCM Cloud\nWrite complex logic and calculations for:\nPayroll rules\nLeave/absence plans\nBenefits eligibility\nCompensation policies\nTroubleshoot and fix formula-related issues\nUse tools like Formula Results, Messages, and Logging for testing and debugging\nWork with database items (DBIs), context variables, and input values in formulas\nCollaborate with technical and functional teams during implementations\n\n\n\n\nRequirements:\n\nStrong hands-on experience with Oracle Cloud HCM Fast Formulas\nGood understanding of HCM modules: Payroll, OTL, Absence, Benefits, etc.\nExperience in Oracle HCM Cloud implementation or support projects\nAbility to work with cross-functional teams",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Field Application Engineer – AMC Services",
    "job_id": "4279858469",
    "company_name": null,
    "location": "Surat",
    "experience": null,
    "salary": null,
    "key_skills": [
      "PLC",
      "SCADA",
      "HMI",
      "Software",
      "Troubleshooting",
      "Configuration",
      "Documentation"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279858469/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Profile / Description: Field Application Engineer – AMC Services\n\nJob Title\n\nField Application Engineer\n\nDepartment\n\nTechnical / Service\n\nLocation\n\nSurat, RIL Site (with frequent travel to customer sites)\n\nReports To\n\nTechnical Manager / Project Manager\n\nMission Statement\n\nWork for the delivery of AMC services, including troubleshooting, configuration, verification, and documentation for software, PLC, and SCADA systems. Ensure successful site visits and proper closure by collecting signed MoM (Minutes of Meeting) and JMS (Job Movement Slip).\n\nMain Responsibilities\n\nKey Area\n\nDescription\n\nAMC Site Visits\n\n→Visit customer sites as per AMC schedule\n\n→Inspect and maintain software and application of X-Force, PLC, SCADA, HMI systems\n\n→Verify and document system health status\n\nService Execution\n\n→Troubleshoot and resolve site issues\n\n→Perform necessary configuration or software updates\n\n→Coordinate with Lead/Project Manager\n\nCustomer Interaction\n\n→Interact with site engineers for issue understanding\n\n→Update customer on actions taken and get MoM signed\n\nDocumentation\n\n→Prepare and get MoM (Minutes of Meeting) signed\n\n→Fill and get JMS (Job Measurement sheet) signed\n\n→Customer satisfaction form and signed of user.\n\n→Update visit logs and service reports\n\nReporting\n\n→Daily/Weekly reporting to Technical Manager\n\n→Maintain backup of configurations and documents\n\nCompliance\n\n→Adhere to company policies and customer safety protocols\n\n→Maintain discipline and professional behaviour on-site\n\nDeputation\n\n→RIL Site (3 month of deputation)",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Back End Developer",
    "job_id": "4281534269",
    "company_name": "Ravian AI",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Back-End Development",
      "Software Development",
      "Object-Oriented Programming (OOP)",
      "Front-End Development",
      "Python",
      "Fast API",
      "Web-sockets",
      "Agentic architecture",
      "Database Management"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281534269/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\n Ravian, AI that Thinks, Decides & Acts on Your Device\n\n\n\n\n\n\n\n\n\n\nRole Description\n\nThis is a full-time remote/WFH role for a Back End Developer at Ravian AI. The Back End Developer will be responsible for designing, developing, and maintaining server-side, MAC os and Windows, applications and databases. Daily tasks include creating and optimizing APIs, ensuring system stability, handling back-end integration with front-end elements, and collaborating with front-end developers and other team members. The developer will also troubleshoot and debug any back-end issues.\n\n\n\n\nQualifications\n\nProficiency in Back-End Web Development and Software Development\nSolid foundation in Object-Oriented Programming (OOP) principles\nBasic knowledge of Front-End Development to assist in integration\nStrong programming skills in relevant languages ( Python, Fast API, Web-sockets and Agentic architecture)\nSelf driven individual with excellent problem-solving and critical thinking abilities\nAbility to work independently and remotely, while collaborating effectively with team members\nFamiliarity with database management and server-side operations is a mandate\nBachelor's degree in Computer Science, Software Engineering, or a related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Machine Learning Expert",
    "job_id": "4281534191",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Machine Learning",
      "Deep Learning",
      "algorithms",
      "Computer Science",
      "Statistics",
      "model performance evaluation",
      "deployment",
      "transformers development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281534191/",
    "posted_at": null,
    "job_description": "About the job\n\nRole Description\n\nThis is a contract role for a Machine Learning Expert. The Machine Learning Expert will be responsible for developing and implementing machine learning models, conducting research, and analyzing data sets. Day-to-day tasks include designing algorithms, evaluating model performance, and collaborating with cross-functional teams to deploy solutions.\n\n\n\n\nQualifications\n\nProficient in Machine Learning, Deep Learning, and developing algorithms\nStrong background in Computer Science and Statistics\nAbility to conduct research and analyze data sets\nExperience with model performance evaluation and deployment\nExcellent problem-solving and analytical skills\nAdvanced degree in Computer Science, Engineering, Mathematics, or a related field\nSolid knowledge of transformers development and understanding of the whole transformer infrastructure. \nShould have experience or won't be entertained.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Automation Test Engineer",
    "job_id": "4282138365",
    "company_name": null,
    "location": "India",
    "experience": "2 to 4 years",
    "salary": null,
    "key_skills": [
      "Automation Testing",
      "Java",
      "Python",
      "Selenium WebDriver",
      "TestNG",
      "JUnit",
      "PyTest",
      "Git",
      "Jenkins",
      "GitLab CI",
      "Agile",
      "Scrum"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282138365/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are looking for a skilled and detail-oriented Automation Test Engineer with hands-on experience in Java or Python and Selenium. The ideal candidate will be responsible for designing and maintaining automation frameworks, writing test scripts, and ensuring high-quality product delivery through continuous testing.\n\nKey Responsibilities:\n\nDesign, develop, and maintain automated test scripts using Java or Python and Selenium WebDriver.\nCreate and manage reusable test frameworks for functional, regression, and integration testing.\nExecute test plans, identify bugs, and provide comprehensive test reports.\nCollaborate closely with developers, product managers, and QA team members to understand requirements and resolve issues.\nIntegrate automated tests with CI/CD pipelines using tools like Jenkins, Git, etc.\nMaintain documentation for test processes, tools, and cases.\nParticipate in code reviews and contribute to overall test strategy improvements.\nPerform root cause analysis for test failures and track defect resolution.\n\nRequired Skills:\n\n2 to 4 years of experience in automation testing.\nProficient in either Java or Python programming.\nStrong hands-on experience with Selenium WebDriver.\nFamiliarity with frameworks like TestNG, JUnit, PyTest, or similar.\nExperience with version control tools like Git.\nExposure to CI/CD tools like Jenkins, GitLab CI, or similar.\nUnderstanding of Agile/Scrum methodologies.\nGood problem-solving and analytical skills.\nExcellent communication and documentation skills.\n\nPreferred Skills (Good to Have):\n\nExperience with API testing tools like Postman, RestAssured, or SOAP UI.\nKnowledge of test management tools like JIRA, TestRail, or Zephyr.\nBasic knowledge of databases and SQL for backend validation.\nExposure to cloud platforms (AWS/Azure) is a plus.\n\nQualifications:\n\nBachelor's or Masters degree in Computer Science, Engineering, or a related field.",
    "source": "linkedin",
    "relevance_score": "high"
  }
]