[
  {
    "title": "Java and React JS Developer",
    "job_id": "4261524414",
    "company_name": "Infosys",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "React.js",
      "Software Configuration Management"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/java-and-react-js-developer-at-infosys-4261524414",
    "posted_at": null,
    "job_description": "Primary skills:Java,Java->reactjs developer\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction.\nYou will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain.\nYou will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews.\nYou will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.\nYou would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Ability to develop value-creating strategies and models that enable clients to innovate, drive growth and increase their business profitability\nGood knowledge on software configuration management systems\nAwareness of latest technologies and Industry trends\nLogical thinking and problem solving skills along with an ability to collaborate\nUnderstanding of the financial processes for various types of projects and the various pricing models available\nAbility to assess the current processes, identify improvement areas and suggest the technology solutions\nOne or two industry domain knowledge\nClient Interfacing skills\nProject and Team management",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4205909191",
    "company_name": "Persistent Systems",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/full-stack-developer-at-persistent-systems-4205909191",
    "posted_at": null,
    "job_description": "About Persistent\n\nWe are an AI-led, platform-driven Digital Engineering and Enterprise Modernization partner, combining deep technical expertise and industry experience to help our clients anticipate what’s next. Our offerings and proven solutions create a unique competitive advantage for our clients by giving them the power to see beyond and rise above. We work with many industry-leading organizations across the world, including 12 of the 30 most innovative global companies, 60% of the largest banks in the US and India, and numerous innovators across the healthcare ecosystem.\n\nOur disruptor’s mindset, commitment to client success, and agility to thrive in the dynamic environment have enabled us to sustain our growth momentum by reporting $1,409.1M revenue in FY25, delivering 18.8% Y-o-Y growth. Our 23,900+ global team members, located in 19 countries, have been instrumental in helping the market leaders transform their industries. We are also pleased to share that Persistent won in four categories at the prestigious 2024 ISG Star of Excellence™ Awards , including the Overall Award based on the voice of the customer. We were included in the Dow Jones Sustainability World Index, setting high standards in sustainability and corporate responsibility. We were awarded for our state-of-the-art learning and development initiatives at the 16 th TISS LeapVault CLO Awards. In addition, we were cited as the fastest-growing IT services brand in the 2024 Brand Finance India 100 Report. Throughout our market-leading growth, we’ve maintained a strong employee satisfaction score of 8.2/10.\n\nAt Persistent, we embrace diversity to unlock everyone's potential. Our programs empower our workforce by harnessing varied backgrounds for creative, innovative problem-solving. Our inclusive environment fosters belonging, encouraging employees to unleash their full potential.\n\nFor more details please login to www.persistent.com\n\nAbout The Position\n\nWe are looking for a Full Stack Developer who is a skilled professional with exposure to cloud platforms, DevOps, and data visualization, preferably with networking domain (Cisco) product exposure. You will collaborate with internal teams to design, develop, deploy, and maintain software applications at scale.\n\nTo succeed as a Full Stack Developer, you will be required to ensure the timely completion and approvals of project deliverables. You will also be expected to recommend new technologies and techniques for application development.\n\nWhat You?ll Do\n\n\nDesign, develop, deploy, and maintain software applications at scale using Java / J2EE, JavaScript frameworks (Angular or React) and associated technologies\nDeploy software using CI / CD tools such as Jenkins\nUnderstand the technologies implemented, and interface with the project manager on status and technical issues\nSolve and articulate simple and complex problems with application design, development, and user experiences\nCollaborate with other developers and designers, as well as assist with technical matters when required\n\n\nExpertise You?ll Bring\n\n\nExperience: Proven ability in Java / j2ee, Spring, Python, Docker, Kubernetes, and Microservices\nKnowledge in the distributed technologies below will give you an added advantage\nApache Spark\nMapReduce Principles\nKafka (MSK)\nApache Hadoop (AWS EMR)\n\n\nBenefits\n\n\nCompetitive salary and benefits package\nCulture focused on talent development with quarterly promotion cycles and company-sponsored higher education and certifications\nOpportunity to work with cutting-edge technologies\nEmployee engagement initiatives such as project parties, flexible work hours, and Long Service awards\nAnnual health check-ups\nInsurance coverage : group term life , personal accident, and Mediclaim hospitalization for self, spouse, two children, and parents\n\n\nPersistent Ltd. is dedicated to fostering diversity and inclusion in the workplace. We invite applications from all qualified individuals, including those with disabilities, and regardless of gender or gender preference. We welcome diverse candidates from all backgrounds.\n\nInclusive Environment\n\n\nWe offer hybrid work options and flexible working hours to accommodate various needs and preferences.\nOur office is equipped with accessible facilities, including adjustable workstations, ergonomic chairs, and assistive technologies to support employees with physical disabilities.\nIf you are a person with disabilities and have specific requirements, please inform us during the application process or at any time during your employment. We are committed to creating an inclusive environment where all employees can thrive.\n\n\nOur company fosters a values-driven and people-centric work environment that enables our employees to:\n\n\nAccelerate growth, both professionally and personally\nImpact the world in powerful, positive ways, using the latest technologies\nEnjoy collaborative innovation, with diversity and work-life wellbeing at the core\nUnlock global opportunities to work and learn with the industry’s best\n\n\nLet’s unleash your full potential at Persistent - persistent.com/careers",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "JavaScript Developer",
    "job_id": "4270872247",
    "company_name": "Aura Marketing Group",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Front-End Development",
      "JavaScript",
      "Back-End Web Development",
      "Software Development",
      "Redux.js"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/javascript-developer-at-aura-marketing-group-4270872247",
    "posted_at": null,
    "job_description": "Company Description\n\n\nAnisht is building a competitive alternative to existing image generation platforms, designed to serve creators, not corporate interests. Our mission is to provide powerful AI capabilities at affordable prices, making professional-quality image generation accessible to students, artists, small businesses, and individual creators. We aim to empower users who have been priced out by existing solutions.\n\n\nRole Description\n\n\nThis is a full-time hybrid role for a JavaScript Developer. As part of the team, you will be located in Chennai with some work from home flexibility. The JavaScript Developer will be responsible for both front-end and back-end web development tasks. Daily responsibilities include developing software, coding in JavaScript, and utilizing Redux.js for state management. Collaboration with design and engineering teams to ensure the creation of interactive and user-friendly applications will also be a key part of the role.\n\n\nQualifications\n\nFront-End Development and JavaScript skills\nBack-End Web Development and Software Development experience\nKnowledge and experience with Redux.js\nExcellent problem-solving and analytical skills\nAbility to work independently and collaboratively in a hybrid environment\nBachelor’s degree in Computer Science, Information Technology, or a related field is preferred",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Developer",
    "job_id": "4273053799",
    "company_name": "Duruper",
    "location": "India",
    "experience": "2+ years",
    "salary": null,
    "key_skills": [
      "JavaScript",
      "HTML",
      "CSS",
      "Scrum",
      "Agile"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/frontend-developer-at-duruper-4273053799",
    "posted_at": null,
    "job_description": "The ideal candidate will be responsible for designing, developing, testing, and debugging responsive web and mobile applications for the company. Using JavaScript, HTML, and CSS, this candidate will be able to translate user and business needs into functional frontend design. \n\n \n\nResponsibilities\nDesigning, developing, and testing UI for mobile and web applications\nBuild reusable code and libraries for future use\nAccurately translate user and business needs into functional frontend code\n\n\n\n\nQualifications\n\nBachelor's degree or equivalent in Computer Science\n2+ years' experience in frontend development\nFamiliarity using Scrum/Agile development methodologies\nExperience building object oriented web applications in JavaScript, HTML5, and CSS3",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java and Angular Developer - Associate Technology",
    "job_id": "4261735661",
    "company_name": "Morgan Stanley",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "Angular"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/java-and-angular-developer-associate-technology-at-morgan-stanley-4261735661",
    "posted_at": null,
    "job_description": "Job Description: Associate Developer - Java & Angular\n\nJob Level: Associate\n\nTier: P2 / Software Eng II\n\nDepartment: IMIT - Ops Tech\n\nLocation: Mumbai\n\nEmployment Type: Full-time\n\nAbout Us:-\n\nMorgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, wealth management and investment management services. With offices in more than 41 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions, and individuals. For further information about Morgan Stanley, please visit www.morganstanley.com.\n\nTechnology/Role/Department at Morgan Stanley:-\n\nTechnology is the key differentiator that ensures that we manage our global businesses and serve clients on a market leading platform that is resilient, safe, efficient, smart, fast, and flexible. Technology redefines how we do business in global, complex, and dynamic financial markets. We have a large number of award-winning technology platforms that help to propel our Firm's businesses to be the top in the market. Our India technology teams are based in Mumbai and Bengaluru. We have built strong techno-functional teams which partner with our offices globally taking global ownership of systems and products. We have a vibrant and diverse mix of technologists working on different technologies and functional domains. There is a large focus on innovation, inclusion, giving back to the community and sharing knowledge.\n\nDepartment profile:-\n\nMorgan Stanley Investment Management Technology (MSIMIT) strives to provide a technology platform that helps the business deliver outstanding long-term investment performance, service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations, and individuals worldwide.\n\nWhat you'll bring to the role:-\n\nWe are looking for a motivated Associate Developer with experience in Java and Angular to join our development team. This is a hands-on development role and requires the candidate to be involved in all parts of the software development life cycle including requirements, software design, writing code, testing, deployment and maintenance.\n\nKey Responsibilities:-\n\n> Develop, test, and deploy web applications using Java (Spring/Spring boot) for backend and Angular for frontend.\n\n> Write clean, efficient, and maintainable code following best practices and coding standards.\n\n> Participate in requirement analysis, design discussions, and code reviews.\n\n> Debug, troubleshoot, and fix issues across the stack.\n\n> Work closely with business users, SMEs, QA teams and other stakeholders to deliver features on time.\n\n> Collaborate in Agile/Scrum environments, attend daily stand-ups, and update progress.\n\n> Maintain proper documentation for code, APIs, and development processes.\n\nWhat you'll bring to the role:-\n\nSkill Set: Java and Angular\n\n> 2~4 years of experience in software development with Java and Angular.\n\n> Strong knowledge of Core Java JDK 8+, Spring Framework/Spring Boot.\n\n> Good understanding of Angular, TypeScript, HTML, CSS, and JavaScript.\n\n> Familiarity with RESTful API integration.\n\n> Basic understanding of SQL/relational databases.\n\n> Knowledge of version control systems (e.g., Git).\n\n> Good problem-solving and debugging skills.\n\n> Strong communication and teamwork abilities.\n\n> Experience with CI/CD pipelines\n\nPreferred Skills (Nice To Have)\n\n> Experience with CI/CD pipelines.\n\n> Familiarity with unit testing frameworks (JUnit, Jasmine, Karma).\n\n> Knowledge of Agile methodologies.\n\nWhat You Can Expect From Morgan Stanley\n\nWe are committed to maintaining the first-class service and high standard of excellence that have defined Morgan Stanley for over 89 years. Our values - putting clients first, doing the right thing, leading with exceptional ideas, committing to diversity and inclusion, and giving back - aren’t just beliefs, they guide the decisions we make every day to do what's best for our clients, communities and more than 80,000 employees in 1,200 offices across 42 countries. At Morgan Stanley, you’ll find an opportunity to work alongside the best and the brightest, in an environment where you are supported and empowered. Our teams are relentless collaborators and creative thinkers, fueled by their diverse backgrounds and experiences. We are proud to support our employees and their families at every point along their work-life journey, offering some of the most attractive and comprehensive employee benefits and perks in the industry. There’s also ample opportunity to move about the business for those who show passion and grit in their work.\n\nTo learn more about our offices across the globe, please copy and paste https://www.morganstanley.com/about-us/global-offices into your browser.\n\nMorgan Stanley is an equal opportunities employer. We work to provide a supportive and inclusive environment where all individuals can maximize their full potential. Our skilled and creative workforce is comprised of individuals drawn from a broad cross section of the global communities in which we operate and who reflect a variety of backgrounds, talents, perspectives, and experiences. Our strong commitment to a culture of inclusion is evident through our constant focus on recruiting, developing, and advancing individuals based on their skills and talents.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Frontend Developer",
    "job_id": "4273020926",
    "company_name": "Blockstats",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Front-End Development",
      "Responsive Web Design",
      "React.js",
      "Next.js",
      "Software Development",
      "Web Development",
      "Figma",
      "HTML",
      "CSS",
      "JavaScript",
      "UI/UX"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/frontend-developer-at-blockstats-4273020926",
    "posted_at": null,
    "job_description": "Company Description\n\nBlockstats is an AI-powered crypto portfolio management and tax solution designed to simplify digital asset management for investors, CPAs, and institutions. Our platform offers comprehensive tracking, performance analysis, staking rewards management, and tax form generation in one place. Supporting both EVM and non-EVM chains, Blockstats provides complete visibility across wallets, exchanges, and protocols, leveraging AI-driven insights for confident decision-making and compliance. Currently in Beta, you can try our platform at blockstats.app.\n\n\n\n\nRole Description\n\nThis is a full-time remote role for a Frontend Developer. The Frontend Developer will be responsible for designing and developing user-facing features, ensuring the technical feasibility of UI/UX designs, and optimizing applications for maximum speed and scalability. The role involves collaborating with back-end developers and web designers to improve usability and ensuring all designs are responsive and adaptive to various devices and platforms.\n\n\n\n\nQualifications\n\nFront-End Development and Responsive Web Design skills\nStrong experience in React.js & Next.js\nExperience in Software Development and Web Development\nKnowledge of Figma, Back-End Web Development as an added advantage\nProficiency in HTML, CSS, JavaScript, and modern front-end frameworks\nStrong understanding of UI/UX principles and responsive design\nAbility to work independently and remotely\nExcellent problem-solving and communication skills\nBachelor's degree in Computer Science, Information Technology, or a related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Web Developer",
    "job_id": "4276074732",
    "company_name": "RN JobForce",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Front-End Development",
      "Web Design",
      "Back-End Web Development",
      "Programming",
      "Web Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/web-developer-at-rn-jobforce-4276074732",
    "posted_at": null,
    "job_description": "Company Description\n\n\nRN JobForce empowers job seekers and employers worldwide with cutting-edge job search tools and a growing professional community to find opportunities and advance their careers. We work collaboratively with our clients, using our multi-layer candidate delivery function to ensure we supply them with the best and most suitable candidates. Our platform is dedicated to making your job search efficient and tailored to your professional needs.\n\n\nRole Description\n\n\nThis is a full-time remote role for a Web Developer. The Web Developer will be responsible for designing, coding, and modifying websites from layout to function. Daily tasks include front-end and back-end web development, creating visually appealing, user-friendly, and feature-rich applications, and collaborating with team members to bring innovative web solutions to life.\n\n\nQualifications\n\n\\n\n\nFront-End Development and Web Design skills\nBack-End Web Development and Programming skills\nExperience in overall Web Development\nExcellent problem-solving and analytical skills\nStrong collaboration and communication skills\nAbility to work independently and remotely\nBachelor's degree in Computer Science, Web Development, or related field\nExperience in the technology industry is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4276381325",
    "company_name": "Teamified",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "ReactJS",
      "Microsoft .NET",
      "ASP.NET",
      "Azure"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/full-stack-developer-at-teamified-4276381325",
    "posted_at": null,
    "job_description": "Teamified works with top enterprises and digital native businesses in Australia helping them build their remote teams in India, Philippines and Sri Lanka. We pride ourselves with hiring great teams to work on exciting game changing technology. Teamified currently has 200+ engineers, testers, product managers etc. working across 20+ partners. We focus on uplifting the way organisations build and manage their remote teams through great working relationships, trust, integrity, culture and hiring processes. Additional to this we are building our own technology product offerings. We strive to deliver the best outcomes for our customers, our partners and our people.\n\n\n\n\nKey Responsibilities:\n\nDevelop user friendly and functional interfaces in ReactJS ensuring performance, scalability and cross-platform compatibility.\nImplement backend API-driven services to support front-end functionality.\nParticipate in planning activities with your peers, including software design and workload estimation.\nWork with customer service and professional service teams to document feature sets and create comprehensive customer training manuals.\nCollaborate closely with testing and QA teams to deploy and test new software builds seamlessly.\nBe responsible for the monitoring and deployment of services in Azure cloud computing.\n\n\n\n\nKey Qualifications:\n\nA University degree in Software Engineering or a related discipline.\nExperience with Microsoft .NET, and ASP.NET microservices\nWeb Technologies such as ReactJS, AngularJS, or Node.js\nFamiliarity with databases including relational SQL and NoSQL\nExperience with RESTful APIs and web services\nExcellent communication and teamwork skills\nSelf-motivated with the ability to prioritise and meet deadlines\n\n\n\n\nRequirements:\n\nAt least 5 years of experience as a Full stack developer\nFlexibility in work hours and location, with a focus on managing energy rather than time.\nAccess to online learning platforms and a budget for professional development\nA collaborative, no-silos environment, encouraging learning and growth across teams\nA dynamic social culture with team lunches, social events, and opportunities for creative input\nHealth insurance\nLeave Benefits\n\n\n\n\nBenefits:\n\nFlexibility in work hours and location, with a focus on managing energy rather than time.\nAccess to online learning platforms and a budget for professional development\nA collaborative, no-silos environment, encouraging learning and growth across teams\nA dynamic social culture with team lunches, social events, and opportunities for creative input\nHealth insurance\nLeave Benefits\nProvident Fund\nGratuity\n\n\n\n\nIf you possess the required skills and are eager to contribute to our team's success, we encourage you to apply for this exciting opportunity. Apply now!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4272489866",
    "company_name": "Turtil",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Back-End Web Development",
      "Full-Stack Development",
      "Front-End Development",
      "CSS",
      "Software Development"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/full-stack-developer-at-turtil-4272489866",
    "posted_at": null,
    "job_description": "Role Description\n\nThis is a full-time on-site role for a Full Stack Developer, located in Hyderabad. The Full Stack Developer will be responsible for designing, developing, and maintaining web applications. Day-to-day tasks include front-end and back-end development, ensuring the responsiveness of applications, and collaborating with other team members to achieve project goals. The role also involves troubleshooting and debugging applications to optimize performance and implementing best practices in software development.\n\n\n\n\nQualifications\n\nProficiency in Back-End Web Development and Full-Stack Development\nStrong skills in Front-End Development and Cascading Style Sheets (CSS)\nExperience in Software Development\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a team environment\nGood understanding of web development frameworks and tools\nBachelor's degree in Computer Science, Information Technology, or related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Python Full Stack Developer",
    "job_id": "4273022562",
    "company_name": "Orbus International",
    "location": "India",
    "experience": "2.8+ years",
    "salary": null,
    "key_skills": [
      "Python",
      "Node.js",
      "Java",
      "HTML",
      "CSS",
      "JavaScript",
      "REST APIs",
      "React.js",
      "FastAPI",
      "MongoDB",
      "MySQL",
      "PostgreSQL",
      "Git",
      "GitHub",
      "Postman",
      "Docker",
      "AWS"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/python-full-stack-developer-at-orbus-international-4273022562",
    "posted_at": null,
    "job_description": "Experience Required: 2.8+ years of experience any one backend language (e.g., Python, Node.js, Java, etc.)\n\nIdeal Candidate Profile:\n\nHands-on knowledge of any one backend language (e.g., Python, Node.js, Java, etc.)\nFamiliarity with HTML, CSS, and JavaScript\nBasic understanding of REST APIs and databases\nWillingness to learn full stack technologies like React.js and FastAPI\nEagerness to work on live industry projects\nStrong problem-solving mindset and commitment to complete the program\n\n\n\n\nKey Technologies You Will Learn:\n\nFrontend: HTML5, CSS3, JavaScript (ES6+), React.js, Tailwind CSS, Bootstrap\nBackend: Python, FastAPI, RESTful API design\nDatabase: MongoDB, MySQL/PostgreSQL\nTools: Git, GitHub, Postman, Docker basics, AWS (intro)\nCapstone Projects: End-to-end full stack applications",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java Developer",
    "job_id": "4234630173",
    "company_name": "Persistent Systems",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/java-developer-at-persistent-systems-4234630173",
    "posted_at": null,
    "job_description": "About Persistent\n\nWe are an AI-led, platform-driven Digital Engineering and Enterprise Modernization partner, combining deep technical expertise and industry experience to help our clients anticipate what’s next. Our offerings and proven solutions create a unique competitive advantage for our clients by giving them the power to see beyond and rise above. We work with many industry-leading organizations across the world, including 12 of the 30 most innovative global companies, 60% of the largest banks in the US and India, and numerous innovators across the healthcare ecosystem.\n\nOur disruptor’s mindset, commitment to client success, and agility to thrive in the dynamic environment have enabled us to sustain our growth momentum by reporting $1,409.1M revenue in FY25, delivering 18.8% Y-o-Y growth. Our 23,900+ global team members, located in 19 countries, have been instrumental in helping the market leaders transform their industries. We are also pleased to share that Persistent won in four categories at the prestigious 2024 ISG Star of Excellence™ Awards , including the Overall Award based on the voice of the customer. We were included in the Dow Jones Sustainability World Index, setting high standards in sustainability and corporate responsibility. We were awarded for our state-of-the-art learning and development initiatives at the 16 th TISS LeapVault CLO Awards. In addition, we were cited as the fastest-growing IT services brand in the 2024 Brand Finance India 100 Report. Throughout our market-leading growth, we’ve maintained a strong employee satisfaction score of 8.2/10.\n\nAt Persistent, we embrace diversity to unlock everyone's potential. Our programs empower our workforce by harnessing varied backgrounds for creative, innovative problem-solving. Our inclusive environment fosters belonging, encouraging employees to unleash their full potential.\n\nFor more details please login to www.persistent.com\n\nAbout The Position\n\nWe are looking for a Java Developer to create and support web-based applications, web services and web interfaces. You will be responsible for service side component designing, detailed technical designing, development, testing, implementation, and maintenance.\n\nWorking with cross functional teams, you will participate in scrum calls and daily stand-up meets. You will also review and understand business requirements ensuring that development tasks are completed within the timeline provided and that issues are fully tested with minimal defects.\n\nWhat You?ll Do\n\n\nContribute to all phases of the development lifecycle\nWrite well designed, testable, efficient code\nEnsure designs are compliant with specifications\nPrepare and produce releases of software components\nSupport continuous improvement by investigating alternatives and technologies and presenting these for architectural review\n\n\nExpertise You?ll Bring\n\n\nDevelopment skills in Language and Framework\nStrong coding skills in Core Java 8.0\nExpertise in J2EE\nSpring Boot\nSpring Data JPA\nHibernate\nExpertise in REST API development and deployment using a microservices paradigm\nA good understanding of RDBMS concepts\nPostgreSQL DB and SQL\nKnowledge of deployment and build tools\nA good understanding of Terraform scripts (needing only minor changes / enhancements)\nFamiliarity with AWS Cloud ? especially EC2, S3, Cloud watch, and related services\n\n\nBenefits\n\n\nCompetitive salary and benefits package\nCulture focused on talent development with quarterly promotion cycles and company-sponsored higher education and certifications\nOpportunity to work with cutting-edge technologies\nEmployee engagement initiatives such as project parties, flexible work hours, and Long Service awards\nAnnual health check-ups\nInsurance coverage : group term life , personal accident, and Mediclaim hospitalization for self, spouse, two children, and parents\n\n\nPersistent Ltd. is dedicated to fostering diversity and inclusion in the workplace. We invite applications from all qualified individuals, including those with disabilities, and regardless of gender or gender preference. We welcome diverse candidates from all backgrounds.\n\nInclusive Environment\n\n\nWe offer hybrid work options and flexible working hours to accommodate various needs and preferences.\nOur office is equipped with accessible facilities, including adjustable workstations, ergonomic chairs, and assistive technologies to support employees with physical disabilities.\nIf you are a person with disabilities and have specific requirements, please inform us during the application process or at any time during your employment. We are committed to creating an inclusive environment where all employees can thrive.\n\n\nOur company fosters a values-driven and people-centric work environment that enables our employees to:\n\n\nAccelerate growth, both professionally and personally\nImpact the world in powerful, positive ways, using the latest technologies\nEnjoy collaborative innovation, with diversity and work-life wellbeing at the core\nUnlock global opportunities to work and learn with the industry’s best\n\n\nLet’s unleash your full potential at Persistent - persistent.com/careers",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Java Developer",
    "job_id": "4261597926",
    "company_name": "Persistent Systems",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/java-developer-at-persistent-systems-4261597926",
    "posted_at": null,
    "job_description": "About Persistent\n\nWe are an AI-led, platform-driven Digital Engineering and Enterprise Modernization partner, combining deep technical expertise and industry experience to help our clients anticipate what’s next. Our offerings and proven solutions create a unique competitive advantage for our clients by giving them the power to see beyond and rise above. We work with many industry-leading organizations across the world, including 12 of the 30 most innovative global companies, 60% of the largest banks in the US and India, and numerous innovators across the healthcare ecosystem.\n\nOur disruptor’s mindset, commitment to client success, and agility to thrive in the dynamic environment have enabled us to sustain our growth momentum by reporting $1,409.1M revenue in FY25, delivering 18.8% Y-o-Y growth. Our 23,900+ global team members, located in 19 countries, have been instrumental in helping the market leaders transform their industries. We are also pleased to share that Persistent won in four categories at the prestigious 2024 ISG Star of Excellence™ Awards , including the Overall Award based on the voice of the customer. We were included in the Dow Jones Sustainability World Index, setting high standards in sustainability and corporate responsibility. We were awarded for our state-of-the-art learning and development initiatives at the 16 th TISS LeapVault CLO Awards. In addition, we were cited as the fastest-growing IT services brand in the 2024 Brand Finance India 100 Report. Throughout our market-leading growth, we’ve maintained a strong employee satisfaction score of 8.2/10.\n\nAt Persistent, we embrace diversity to unlock everyone's potential. Our programs empower our workforce by harnessing varied backgrounds for creative, innovative problem-solving. Our inclusive environment fosters belonging, encouraging employees to unleash their full potential.\n\nFor more details please login to www.persistent.com\n\nAbout The Position\n\nWe are looking for a Java Developer to create and support web-based applications, web services and web interfaces. You will be responsible for service side component designing, detailed technical designing, development, testing, implementation, and maintenance.\n\nWorking with cross functional teams, you will participate in scrum calls and daily stand-up meets. You will also review and understand business requirements ensuring that development tasks are completed within the timeline provided and that issues are fully tested with minimal defects.\n\nWhat You?ll Do\n\n\nContribute to all phases of the development lifecycle\nWrite well designed, testable, efficient code\nEnsure designs are compliant with specifications\nPrepare and produce releases of software components\nSupport continuous improvement by investigating alternatives and technologies and presenting these for architectural review\n\n\nExpertise You?ll Bring\n\n\nDevelopment skills in Language and Framework\nStrong coding skills in Core Java 8.0\nExpertise in J2EE\nSpring Boot\nSpring Data JPA\nHibernate\nExpertise in REST API development and deployment using a microservices paradigm\nA good understanding of RDBMS concepts\nPostgreSQL DB and SQL\nKnowledge of deployment and build tools\nA good understanding of Terraform scripts (needing only minor changes / enhancements)\nFamiliarity with AWS Cloud ? especially EC2, S3, Cloud watch, and related services\n\n\nBenefits\n\n\nCompetitive salary and benefits package\nCulture focused on talent development with quarterly promotion cycles and company-sponsored higher education and certifications\nOpportunity to work with cutting-edge technologies\nEmployee engagement initiatives such as project parties, flexible work hours, and Long Service awards\nAnnual health check-ups\nInsurance coverage : group term life , personal accident, and Mediclaim hospitalization for self, spouse, two children, and parents\n\n\nPersistent Ltd. is dedicated to fostering diversity and inclusion in the workplace. We invite applications from all qualified individuals, including those with disabilities, and regardless of gender or gender preference. We welcome diverse candidates from all backgrounds.\n\nInclusive Environment\n\n\nWe offer hybrid work options and flexible working hours to accommodate various needs and preferences.\nOur office is equipped with accessible facilities, including adjustable workstations, ergonomic chairs, and assistive technologies to support employees with physical disabilities.\nIf you are a person with disabilities and have specific requirements, please inform us during the application process or at any time during your employment. We are committed to creating an inclusive environment where all employees can thrive.\n\n\nOur company fosters a values-driven and people-centric work environment that enables our employees to:\n\n\nAccelerate growth, both professionally and personally\nImpact the world in powerful, positive ways, using the latest technologies\nEnjoy collaborative innovation, with diversity and work-life wellbeing at the core\nUnlock global opportunities to work and learn with the industry’s best\n\n\nLet’s unleash your full potential at Persistent - persistent.com/careers",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Java Developer",
    "job_id": "4273034084",
    "company_name": "Infosys",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "SQL tuning",
      "Core Java",
      "Java",
      "Spring MVC",
      "Springboot",
      "Agile"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/java-developer-at-infosys-4273034084",
    "posted_at": null,
    "job_description": "Primary skills:Technology->Database->SQL tuning,Technology->Java->Core Java,Technology->Java->Java - ALL,Technology->Java->Spring MVC,Technology->Java->Springboot\n\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction.\nYou will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain.\nYou will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews.\nYou will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.\nYou would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!\nKnowledge of more than one technology\nBasics of Architecture and Design fundamentals\nKnowledge of Testing tools\nKnowledge of agile methodologies\nUnderstanding of Project life cycle activities on development and maintenance projects\nUnderstanding of one or more Estimation methodologies, Knowledge of Quality processes\nBasics of business domain to understand the business requirements\nAnalytical abilities, Strong Technical Skills, Good communication skills\nGood understanding of the technology and domain\nAbility to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods\nAwareness of latest technologies and trends\nExcellent problem solving, analytical and debugging skills",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java Developer",
    "job_id": "4273032609",
    "company_name": "Infosys",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Core Java",
      "Springboot",
      "Microservices API Management",
      "Agile"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/java-developer-at-infosys-4273032609",
    "posted_at": null,
    "job_description": "Primary skills:Technology->Java->Core Java,Technology->Java->Springboot,Technology->Microservices->Microservices API Management\n\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction.\nYou will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain.\nYou will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews.\nYou will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.\nYou would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!\nKnowledge of more than one technology\nBasics of Architecture and Design fundamentals\nKnowledge of Testing tools\nKnowledge of agile methodologies\nUnderstanding of Project life cycle activities on development and maintenance projects\nUnderstanding of one or more Estimation methodologies, Knowledge of Quality processes\nBasics of business domain to understand the business requirements\nAnalytical abilities, Strong Technical Skills, Good communication skills\nGood understanding of the technology and domain\nAbility to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods\nAwareness of latest technologies and trends\nExcellent problem solving, analytical and debugging skills",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer",
    "job_id": "4273204137",
    "company_name": "TBO.com",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-tbo-com-4273204137",
    "posted_at": null,
    "job_description": "Job Description\n\n\n\n\nSoftware Engineer\n\n\n\n\nTBO–(www.tbo.com)\n\n\n\n\nTBO is a global platform that aims to simplify all buying and selling travel needs of travel partners across the world. The proprietary technology platform aims to simplify the demands of the complex world of global travel by seamlessly connecting the highly distributed travel buyers and travel suppliers at scale.\n\n\n\n\nThe TBO journey began in 2006 with a simple goal – to address the evolving needs of travel buyers and suppliers, and what started off as a single product air ticketing company, has today become the leading B2A (Business to Agents) travel portal across the Americas, UK & Europe, Africa, Middle East, India, and Asia Pacific.\n\n\n\n\nToday, TBO’s product range from air, hotels, rail, holiday packages, car rentals, transfers, sightseeing, cruise, and cargo. Apart from these products, our proprietary platform relies heavily on AI/ML to offer unique listings and products, meeting specific requirements put forth by customers, thus increasing conversions.\n\n\n\n\nTBO’s approach has always been technology-first and we continue to invest on new innovations and new offerings to make travel easy and simple. TBO’s travel APIs are serving large travel ecosystems across the world while the modular architecture of the platform enables new travel products while expanding across new geographies.\n\n\n\n\nWhy TBO:\n\n\n\n\n• You will influence & contribute to “Building World Largest Technology Led Travel Distribution Network” for a $ 9 Trillion global travel business market.\n\n• We are the emerging leaders in technology led end-to-end travel management, in the B2B space.\n\n• Physical Presence in 47 countries with business in 110 countries.\n\n• We are reputed for our-long lasting trusted relationships. We stand by our eco system of suppliers and buyers to service the end customer.\n\n• An open & informal start-up environment which cares.\n\nWhat TBO offers to a Life Traveller in You:\n\n\n\n\n• Enhance Your Leadership Acumen. Join the journey to create global scale and ‘World Best’.\n\n• Challenge Yourself to do something path breaking. Be Empowered. The only thing to stop you will be your imagination.\n\n• Post pandemic: travel space is likely to see significant growth. Witness and shape this space. It will be one exciting journey.\n\n• As a fastest growing B2B platform our priority is purpose-building scalable systems.\n\n• Adopting industry leading technologies to support best-in-class business capabilities for high performing and scalable solutions.\n\n• Fast response to the evolving regulatory environment and helping to meet the firm's regulatory commitments by addressing internal and external commitments.\n\nTop Sights During Your Role Stay (Key Expectations):\n\nMore than 1 years of Prior experience as Backend Developer in any SAAS product .\nExposure to languages/ framworks like GoLang/Java/Node /Python / RUST will be preferred.Capacity to use SQL server with ease. Exposure to Redis / MongoDB/ PostgreSQL is desired.\nShould have worked with cloud platforms like AWS / Azure.\nA flair for creating well-presented software that is technically sound.\nOutstanding analytical, problem-solving, and communication skills.\nExcellent organizational and time management skills.\nSelf-driven, flexible, and innovative.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Java Specialist Programmer",
    "job_id": "4273040768",
    "company_name": "Infosys",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "Architecture",
      "Design",
      "Testing tools",
      "Agile methodologies"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/java-specialist-programmer-at-infosys-4273040768",
    "posted_at": null,
    "job_description": "Primary skills:Technology->Java->Java - ALL\n\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction.\nYou will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain.\nYou will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews.\nYou will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.\nYou would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!\nKnowledge of more than one technology\nBasics of Architecture and Design fundamentals\nKnowledge of Testing tools\nKnowledge of agile methodologies\nUnderstanding of Project life cycle activities on development and maintenance projects\nUnderstanding of one or more Estimation methodologies, Knowledge of Quality processes\nBasics of business domain to understand the business requirements\nAnalytical abilities, Strong Technical Skills, Good communication skills\nGood understanding of the technology and domain\nAbility to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods\nAwareness of latest technologies and trends\nExcellent problem solving, analytical and debugging skills",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java AWS Developer",
    "job_id": "4273034001",
    "company_name": "Infosys",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Groovy",
      "Java",
      "Postgres",
      "AWS",
      "software configuration management systems"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/java-aws-developer-at-infosys-4273034001",
    "posted_at": null,
    "job_description": "Primary Skills- Groovy, Java, Postgres, AWS\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys consulting team, your primary role would be to get to the heart of customer issues, diagnose problem areas, design innovative solutions and facilitate deployment resulting in client delight.\nYou will develop a proposal by owning parts of the proposal document and by giving inputs in solution design based on areas of expertise.\nYou will plan the activities of configuration, configure the product as per the design, conduct conference room pilots and will assist in resolving any queries related to requirements and solution design\nYou will conduct solution/product demonstrations, POC/Proof of Technology workshops and prepare effort estimates which suit the customer budgetary requirements and are in line with organization’s financial guidelines\nActively lead small projects and contribute to unit-level and organizational initiatives with an objective of providing high quality value adding solutions to customers. If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Ability to develop value-creating strategies and models that enable clients to innovate, drive growth and increase their business profitability\nGood knowledge on software configuration management systems\nAwareness of latest technologies and Industry trends\nLogical thinking and problem solving skills along with an ability to collaborate\nUnderstanding of the financial processes for various types of projects and the various pricing models available\nAbility to assess the current processes, identify improvement areas and suggest the technology solutions\nOne or two industry domain knowledge\nClient Interfacing skills\nProject and Team management",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Backend Developer Intern with AI Knowledge Intership 6 Months In-Office Role",
    "job_id": "4276107322",
    "company_name": "Sirma Business Consulting India Private Ltd",
    "location": "India",
    "experience": null,
    "salary": "₹15,000 per month",
    "key_skills": [
      "Java",
      "Spring Boot",
      "Microservices",
      "HTML",
      "RESTful APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/backend-developer-intern-with-ai-knowledge-intership-6-months-in-office-role-at-sirma-business-consulting-india-private-ltd-4276107322",
    "posted_at": null,
    "job_description": "Subject: Job Description â Backend Developer Intern (IBangalore)\n\nPosition: Backend Developer Intern\n\nLocation: Bangalore (Whitefield) | In-Office Role\n\nInternship Duration: 6 Months\n\nWorking Days: Monday to Saturday (Alternate Saturdays Working)\n\nWorking Hours: 10:30 AM â 7:30 PM\n\nStipend: â¹15,000 per month\n\nJob Description\n\nWe are looking for a Backend Developer Intern who is proficient in Java, Spring Boot, Microservices, and HTML. This is an Intern-to-Hire opportunity, where candidates demonstrating strong skills and performance during the 3-month internship will be considered for a full-time Backend Developer role.\n\nKey Responsibilities\n\n\nDevelop and maintain server-side applications using Java and Spring Boot.\nDesign and implement RESTful APIs and Microservices architecture.\nCollaborate with frontend developers and other teams to integrate applications efficiently.\nOptimize application performance and ensure scalability.\nTroubleshoot and debug backend issues to maintain system reliability.\n\n\nRequired Skills & Qualifications\n\n\nProficiency in Java, Spring Boot, and Microservices architecture.\nBasic understanding of HTML and frontend-backend integration.\nStrong problem-solving and debugging skills.\nKnowledge of database management and RESTful API development.\n\n\nThis internship provides an excellent opportunity to gain hands-on experience, work on real-world projects,\n\nIf you are passionate about backend development and eager to build scalable applications, we encourage you to apply!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4273055274",
    "company_name": "Nordek",
    "location": "India",
    "experience": "2–3 years",
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/full-stack-developer-at-nordek-4273055274",
    "posted_at": null,
    "job_description": "About Us\n\n\n\n\nNORDEK is a blockchain company building next-generation Layer-2 infrastructure to power seamless, scalable, and mainstream Web3 payments. bepay is a flagship product of the NORDEK group of companies, designed to redefine the future of digital payments. As a non-custodial Web3 super app, bepay enables fast, secure, and borderless payments across fiat, crypto, and CBDCs. It brings together digital payments, wallet services, and cross-chain infrastructure into one seamless, mobile-first experience for both users and merchants.\n\n\n\n\nAs we scale our presence in the fintech and Web3 ecosystem, we are hiring a Brand Manager to lead and grow bepay’s brand identity, craft viral campaigns, and build strong emotional connections with users globally.\n\n\n\n\nPosition Summary\n\nWe’re seeking a Junior Full Stack Developer with a strong foundation in both frontend and backend technologies. The ideal candidate should have experience building mobile-first applications, modifying responsive websites, supporting DevOps pipelines, QA testing, and leveraging modern AI tools for faster frontend workflows.\n\nYou will work on developing features for the bepay mobile app, maintain and enhance our website, and contribute to backend APIs and services. This is a versatile role ideal for candidates with 2–3 years of experience who are comfortable working across the full development lifecycle — from code to deployment to testing.\n\n\n\n\nKey Responsibilities\nManage and enhance the company website using modern frontend frameworks (React.js, Next.js)\nBuild and maintain lead capture forms, waitlists, and onboarding workflows for users and merchants. \nDevelop backend APIs and services using Node.js to securely process and store user data\nDesign and optimize NoSQL databases for scalability and performance\nLeverage AI-powered tools (like GitHub Copilot, Figma AI, Framer AI) to accelerate frontend development and workflow automation\nHandle QA testing (manual + automated) for website and internal tools before each release\nAssist in configuring and monitoring CI/CD pipelines using GitHub Actions, Vercel, Netlify, or Docker\nMonitor site performance, form conversion, and data flows to recommend improvements\nImplement secure authentication (JWT, OAuth2.0, biometric login) and ensure code security best practices\nEnsure cross-platform compatibility and performance optimization for mobile and web\nCollaborate closely with designers, product managers, and senior developers to deliver high-quality features\nWrite clean, well-documented, and testable code\n\n\n\n\nMust-Have Skills & Experience\n2–3 years of professional experience as a Full Stack Developer\nStrong skills in React.js/Next.js for building responsive, SEO-friendly websites\nProficiency in Node.js for backend development and API integration\nExperience with form handling, lead management workflows, and integrating third-party APIs\nHands-on experience with NoSQL databases \nFamiliarity with AI-powered developer tools (e.g., GitHub Copilot, AI UI builders like Framer or Figma AI plugins)\nHands-on exposure to DevOps – GitHub Actions, CI/CD, Docker, or cloud platforms (Vercel, GCP, AWS)\nPrior experience in QA testing – writing test cases, catching bugs, performing regressions\nAbility to write clean, efficient, and maintainable code\nStrong problem-solving skills and willingness to work in a fast-paced environment\nNice to Have\nExposure to fintech or Web3 applications\nKnowledge of GraphQL APIs\nExperience with fintech, digital banking, or regulated financial services\nFamiliarity with cloud services like AWS or Firebase\nApplication Instructions\n\nTo apply, please send your resume, GitHub/portfolio link (if available), and a short note on your experience  to careers@bepay.money",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Java-utvikler",
    "job_id": "4276593204",
    "company_name": "Skatteetaten",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "Kotlin"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/java-utvikler%3F-hos-oss-bygger-du-l%C3%B8sninger-som-betyr-noe%21-at-skatteetaten-4276593204",
    "posted_at": null,
    "job_description": "Ønsker du å jobbe som Java-utvikler i et stort IT-miljø med kompetente, dyktige og hyggelige kollegaer?\n\nSkatteetatens IT-miljø er i vekst, og vi har behov for å styrke vår kapasitet. Vi ser etter backend-utviklere som har erfaring med Java eller Kotlin, og som ønsker å jobbe med samfunnsviktige systemer. Hos oss får du utvikle løsninger som berører hver innbygger, bedrift og organisasjon i Norge. I tillegg får du jobbe med moderne teknologi, nyutvikling og tjenester som skal gi gode digitale opplevelser for hele Norges befolkning.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Python Developer",
    "job_id": "4261269444",
    "company_name": "Infosys",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Python",
      "Machine Learning",
      "Architecture",
      "Design",
      "Testing tools",
      "Agile methodologies"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4261269444",
    "posted_at": null,
    "job_description": "Primary skills: Technology->Machine Learning->Python\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction.\nYou will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain.\nYou will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews.\nYou will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.\nYou would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of more than one technology\nBasics of Architecture and Design fundamentals\nKnowledge of Testing tools\nKnowledge of agile methodologies\nUnderstanding of Project life cycle activities on development and maintenance projects\nUnderstanding of one or more Estimation methodologies, Knowledge of Quality processes\nBasics of business domain to understand the business requirements\nAnalytical abilities, Strong Technical Skills, Good communication skills\nGood understanding of the technology and domain\nAbility to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods\nAwareness of latest technologies and trends\nExcellent problem solving, analytical and debugging skills",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer - Cactus",
    "job_id": "4165258415",
    "company_name": "Tower Research Capital",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "low-latency programming",
      "FPGA technology",
      "hardware acceleration",
      "machine learning"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-cactus-at-tower-research-capital-4165258415",
    "posted_at": null,
    "job_description": "Tower Research Capital is a leading quantitative trading firm founded in 1998. Tower has built its business on a high-performance platform and independent trading teams. We have a 25+ year track record of innovation and a reputation for discovering unique market opportunities.\n\nTower is home to some of the world’s best systematic trading and engineering talent. We empower portfolio managers to build their teams and strategies independently while providing the economies of scale that come from a large, global organization.\n\nEngineers thrive at Tower while developing electronic trading infrastructure at a world class level. Our engineers solve challenging problems in the realms of low-latency programming, FPGA technology, hardware acceleration and machine learning. Our ongoing investment in top engineering talent and technology ensures our platform remains unmatched in terms of functionality, scalability and performance.\n\nAt Tower, every employee plays a role in our success. Our Business Support teams are essential to building and maintaining the platform that powers everything we do — combining market access, data, compute, and research infrastructure with risk management, compliance, and a full suite of business services. Our Business Support teams enable our trading and engineering teams to perform at their best.\n\nAt Tower, employees will find a stimulating, results-oriented environment where highly intelligent and motivated colleagues inspire each other to reach their greatest potential.\n\nResponsibilities:\n\n\nDesign, build, and maintain efficient, reusable, and reliable code.\nAugmenting, improving, redesigning, and/or re-implementing Cactus’s low-latency/high-throughput production trading environment.\nBuilding risk-management and performance-tracking tools\nDeveloping applications that manage various aspects of post trade life cycle – including state-of-the-art reconciliation workflows, etc.\nDesign and implement scalable software solutions that support trading, market analysis, and operational workflows.\nCollaborate with cross-functional teams to assess business needs and translate them into technical requirements\n\n\nQualifications:\n\n\nA strong background in data structures, algorithms, and object-oriented programming, preferably in C++\nBrilliant problem-solving abilities\nA passion for new technologies and ideas\nThe ability to manage multiple tasks in a fast-paced environment\nStrong communication skills\nA working knowledge of Linux\nKnowledge of Python and shell scripts (a plus)\nFinancial experience is not required.\n\n\nBenefits:\n\nTower’s headquarters are in the historic Equitable Building, right in the heart of NYC’s Financial District and our impact is global, with over a dozen offices around the world.\n\nAt Tower, we believe work should be both challenging and enjoyable. That is why we foster a culture where smart, driven people thrive – without the egos. Our open concept workplace, casual dress code, and well-stocked kitchens reflect the value we place on a friendly, collaborative environment where everyone is respected, and great ideas win.\n\nOur benefits include:\n\n\nGenerous paid time off policies\nSavings plans and other financial wellness tools available in each region\nHybrid working opportunities\nFree breakfast, lunch and snacks daily\nIn-office wellness experiences and reimbursement for select wellness expenses (e.g., gym, personal training and more)\nVolunteer opportunities and charitable giving\nSocial events, happy hours, treats and celebrations throughout the year\nWorkshops and continuous learning opportunities\n\n\nAt Tower, you’ll find a collaborative and welcoming culture, a diverse team and a workplace that values both performance and enjoyment. No unnecessary hierarchy. No ego. Just great people doing great work – together.\n\nTower Research Capital is an equal opportunity employer.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Software Engineer - CAA",
    "job_id": "4144348683",
    "company_name": "The Goodyear Tire & Rubber Company",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "CATIA",
      "C++",
      "DevOps"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-caa-at-the-goodyear-tire-rubber-company-4144348683",
    "posted_at": null,
    "job_description": "Location: IN - Hyderabad Telangana\n\nGoodyear Talent Acquisition Representative: Kerr Bianca Beech\n\nSponsorship Available: No\n\nRelocation Assistance Available: No\n\nPrimary Responsibilities\n\nSoftware Application Development:\n\n\nDesign, develop, and implement custom solutions using the CATIA Customization Application Architecture (CAA) toolkit to meet specific engineering and design requirements.\nUtilize strong C++ programming skills to create robust and efficient software modules that seamlessly integrate with CATIA software.\nOptimize existing code and troubleshoot issues to ensure high performance and reliability.\nIntegrate CATIA CAA development processes into a DevOps environment to streamline workflows and enhance overall project efficiency.\nCreate and maintain detailed documentation for developed software modules, including design specifications, user manuals, and release notes.\n\n\nRequirement Analysis\n\n\nWork closely with end-users and stakeholders to gather and analyze software requirements, translating them into technical specifications for CATIA CAA development.\n\n\nTesting And Quality Assurance\n\n\nDevelop and implement comprehensive testing plans to ensure the functionality, performance, and reliability of CATIA CAA solutions.\nConduct thorough testing and debugging of software modules, addressing any issues promptly.\n\n\nCollaboration And Communication\n\n\nCollaborate with interdisciplinary teams, including mechanical engineers, designers, and software developers, to ensure seamless integration of CATIA CAA solutions into the overall project workflow.\nProvide regular updates on project progress and collaborate with team members to address challenges.\n\n\nDesired Skills And Abilities\n\n\nKnowledge of 3D modeling concepts and practices, particularly within the CATIA environment.\nSolid understanding of geometry, topology, and mathematics, with the ability to apply these principles to solve complex engineering and design challenges.\nProficiency in Git version control tools, with a strong understanding of git flow, branching, merging, and repository management.\nExperience with continuous integration and deployment (CI/CD) pipelines like Jenkins and GitHub Actions.\nStrong problem-solving skills with the ability to troubleshoot and resolve issues in a timely manner\nProactive mindset towards staying updated on industry trends and emerging technologies in CATIA development, Git, and DevOps.\n\n\nNice to have\n\n\nFamiliarity in Python, Visual Basic for Applications (VBA) for CATIA automation and customization, .NET framework and C# programming.\nBatch and shell scripting for Windows and Unix/Linux environments.\nFamiliarity with other CAD tools beyond CATIA, such as SolidWorks, AutoCAD, Creo or Siemens NX.\nFamiliarity with PLM tools such as SMARTEAM, Enovia, Siemens Teamcenter, PTC Windchill, or others.\n\n\nGoodyear is an Equal Employment Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to that individual's race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender identity, age, physical or mental disability, ethnicity, citizenship, or any other characteristic protected by law.\n\nGoodyear is one of the world’s largest tire companies. It employs about 74,000 people and manufactures its products in 57 facilities in 23 countries around the world. Its two Innovation Centers in Akron, Ohio and Colmar-Berg, Luxembourg strive to develop state-of-the-art products and services that set the technology and performance standard for the industry. For more information about Goodyear and its products, go to www.goodyear.com/corporate",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Software Engineer, India",
    "job_id": "4227402416",
    "company_name": "Cartesia",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-india-at-cartesia-4227402416",
    "posted_at": null,
    "job_description": "About Cartesia\n\nOur mission is to build the next generation of AI: ubiquitous, interactive intelligence that runs wherever you are. Today, not even the best models can continuously process and reason over a year-long stream of audio, video and text—1B text tokens, 10B audio tokens and 1T video tokens—let alone do this on-device.\n\nWe're pioneering the model architectures that will make this possible. Our founding team met as PhDs at the Stanford AI Lab, where we invented State Space Models or SSMs, a new primitive for training large-scale foundation models. Our team combines deep expertise in model innovation and systems engineering paired with a design-minded product engineering team to build and ship cutting edge models and experiences.\n\nWe're funded by leading investors at Index Ventures and Lightspeed Venture Partners, along with Factory, Conviction, A Star, General Catalyst, SV Angel, Databricks and others. We're fortunate to have the support of many amazing advisors, and 90+ angels across many industries, including the world's foremost experts in AI.\n\nRole Responsibilities\n\nWe’re opening our first ever office in India, and looking to hire for a Software Engineer to advance our mission of building real-time multimodal intelligence.\n\nWhat You'll Do\n\n\nDesign and build low latency, scalable, and reliable model inference and serving stack for our cutting edge SSM foundation models\nWork closely with our research team and product engineers to translate cutting edge research into incredible products\nBuild highly parallel, high quality data processing and evaluation infrastructure for foundation model training\n\n\nYou'll have significant autonomy to shape our products and directly impact how cutting-edge AI is applied across various devices and applications.\n\nWhat You'll Bring\n\nGiven the scale and difficulty of problems we work on, we value strong engineering skills at Cartesia.\n\n\nStrong engineering skills, comfortable navigating complex codebases and monorepos.\nAn eye for craft and writing clean and maintainable code.\nYou're comfortable diving into new technologies and can quickly adapt your skills to our tech stack (Go and Python on the backend, Next.js for the frontend).\nExperience building large-scale distributed systems with high demands on performance, reliability, and observability.\nTechnical leadership with the ability to execute and deliver zero-to-one results amidst ambiguity.\n[bonus] Background in or experience working with machine learning and generative models.\n\n\nEven if you don’t meet every requirement above, we'd encourage you to apply.\n\nOur culture\n\n🏢 We’re an in-person team based out of San Francisco and Bangalore. We love being in the office, hanging out together and learning from each other everyday.\n\n🚢 We ship fast. All of our work is novel and cutting edge, and execution speed is paramount. We have a high bar, and we don’t sacrifice quality and design along the way.\n\n🤝 We support each other. We have an open and inclusive culture that’s focused on giving everyone the resources they need to succeed.\n\nOur perks\n\n🍽 Lunch, dinner and snacks at the office.\n\n🏥 Stipend to cover medical insurance\n\n🦖 Your own personal Yoshi.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Python Django Developer",
    "job_id": "4273028915",
    "company_name": "Infosys",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Python",
      "Django developer"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/python-django-developer-at-infosys-4273028915",
    "posted_at": null,
    "job_description": "Primary skills: Python, Django developer\n\nA day in the life of an Infoscion\n\n\nAs part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction.\nYou will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain.\nYou will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews.\nYou will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes.\nYou would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Ability to develop value-creating strategies and models that enable clients to innovate, drive growth and increase their business profitability\nGood knowledge on software configuration management systems\nAwareness of latest technologies and Industry trends\nLogical thinking and problem solving skills along with an ability to collaborate\nUnderstanding of the financial processes for various types of projects and the various pricing models available\nAbility to assess the current processes, identify improvement areas and suggest the technology solutions\nOne or two industry domain knowledge\nClient Interfacing skills\nProject and Team management",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior Software Engineer",
    "job_id": "4273061848",
    "company_name": "Appinventiv",
    "location": "India",
    "experience": "2-5 years",
    "salary": null,
    "key_skills": [
      "Java",
      "Python",
      "C++",
      "JavaScript",
      "SQL",
      "NoSQL",
      "Agile",
      "Scrum"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/junior-software-engineer-at-appinventiv-4273061848",
    "posted_at": null,
    "job_description": "Company Description\n\nAppinventiv is a leading global product development and digital transformation agency that empowers startups and Fortune companies through new-age technology. With a team of over 1500+ mobile experts, we craft innovative solutions and deliver unparalleled results, breaking all growth records.\n\n\n\n\nRole Description\n\nAssist in the development and maintenance of software applications\nWrite clean, scalable, and efficient code\nCollaborate with cross-functional teams to define and implement new features\nTroubleshoot, debug, and upgrade existing software\nContribute to software testing and quality assurance processes\nParticipate in code reviews and maintain coding best practices\nLearn and grow in new technologies and methodologies\n\n\n\n\nQualifications\n\nBachelor’s degree in Computer Science, Engineering, or related field\n2-5 years of experience\nProficiency in one or more programming languages such as Java, Python, C++, or JavaScript\nBasic understanding of software development principles and methodologies (Agile, Scrum, etc.)\nFamiliarity with databases (SQL or NoSQL) and web development frameworks is a plus\nStrong problem-solving skills and a passion for coding",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Software Engineer",
    "job_id": "4276659450",
    "company_name": "Toppan Edge Inc",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-toppan-edge-inc-4276659450",
    "posted_at": null,
    "job_description": "Why Choose Bottomline?\n\nAre you ready to transform the way businesses pay and get paid? Bottomline is a global leader in business payments and cash management, with over 35 years of experience and moving more than $16 trillion in payments annually. We're looking for passionate individuals to join our team and help drive impactful results for our customers. If you're dedicated to delighting customers and promoting growth and innovation - we want you on our team!\n\nAbout Bottomline Technologies \n\nBottomline Technologies provides collaborative payment, invoice and document automation solutions to corporations, financial institutions and banks around the world. The company's solutions are used to streamline, automate and manage processes involving payments, invoicing, global cash management, supply chain finance and transactional documents. Organizations trust these solutions to meet their needs for cost reduction, competitive differentiation and optimization of working capital. \n\n \n\nServing industries such as financial services, insurance, health care, technology, communications, education, media, manufacturing and government, Bottomline provides products and services to approximately 80 of the Fortune 100 companies and 70 of the FTSE (Financial Times) 100 companies. \n\n \n\nBottomline is a participating employer in the Employment Verification (E-Verify) program EOE/AA/M/F/V/D/E-Verify Employer \n\nBottomline Technologies is an Equal Employment Opportunity and Affirmative Action Employer. \n\nPosition Summary: \n\nWe are looking for a strong developer to work on our Digital banking solutions. More than 4 trillion payments originate from our Digital banking solutions every year and 17 of the top 50 US banks, by asset size, use our solutions. \n\nYou will be working on customizing the solutions for our customers that have a direct impact on their end users. \n\nYou should possess excellent communication skills (written and verbal, formal and informal), be a go getter and problem solver and be comfortable working in agile teams that have autonomy and complete ownership. \n\nThis position is based at our Bangalore, India office (Hybrid) \n\nResponsibilities:\n\n\nFollows software development life cycle (SDLC)\nParticipates and contribute in formal and informal code reviews\nWrite Unit and Integration test cases.\nPerforms production support and troubleshooting and maintenance (defect resolution)\nWrite well-designed, testable code.\nCollaborate with cross-functional teams, including product, Production support, and operations, to ensure best-in class customer experience.\nAble to guide junior developers.\nPOC on new technologies/frameworks.\nParticipate in agile development processes and team meetings.\n\n\nRequired Skills:\n\n\n2-4 years of hands-on experience\nStrong coding experience with Java, J2EE, SQL.\nStrong experience in java frameworks, especially spring framework.\nSolid experience developing with SQL queries, stored procedures, views and triggers.\nExperience coding REST and SOAP services.\nExcellent communication (verbal and written) and interpersonal skills.  Able to step into complex situations and take responsibility.\nStrong problem solving and conflict resolution skills.\nWorking experience with version control systems like Git/bitbucket and build tools like maven.\nStrong in design and coding.\nExperience in team leading and provide technical support.\n\n\nWe welcome talent at all career stages and are dedicated to understanding and supporting additional needs. We're proud to be an equal opportunity employer, committed to creating an inclusive and open environment for everyone.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Python Developer Trainee",
    "job_id": "4271218639",
    "company_name": "MAKRO Group",
    "location": "India",
    "experience": "0 Month to 6 Months",
    "salary": "Rs. 12000 - Rs. 15000",
    "key_skills": [
      "MicroSoft(MS)SQL",
      "Artificial Intelligence",
      "Python",
      "Machine Learning",
      "NumPy",
      "Pandas",
      "Scikit-learn",
      "TensorFlow",
      "PyTorch"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/python-developer-trainee-at-makro-group-4271218639",
    "posted_at": "22-July-2025",
    "job_description": "Job Type: Full Time\n\nExperience: 0 Month to 6 Months\n\nType: Face to Face,Written Test\n\nLast Date: 21-Aug-2025\n\nPosted on: 22-July-2025\n\nSalary per month: Rs. 12000 - Rs. 15000\n\nNo. of vacancies: 6\n\nPassout Year: 2024-2025\n\nHighest qualification mark : 80%\n\nEducation: BE/B.Tech\n\nBranch: BE/B.Tech-Computer Science & Engineering (CSE),BE/B.Tech-Electronics & Communication Engineering(ECE),BE/B.Tech-Information Science/Technology (IS/IT)\n\nSublocation: Madhapur\n\nSkills: MicroSoft(MS)SQL,Artificial Intelligence,Python,Machine Learning\n\n\nAssist in developing Python-based applications and scripts supporting AI/ML workflows.\nSupport model building and data analysis using libraries like NumPy, Pandas, Scikit-learn, TensorFlow, or PyTorch.\nClean and preprocess datasets for training and validation using best practices in data wrangling.\nWork under senior developers/data scientists to deploy, test, and validate ML models.\nContribute to automation scripts and tools that optimize data pipelines and ML operations.\nDocument code, algorithms, and workflows for internal and external use.\nStay updated with emerging trends in Python development and machine learning frameworks.\nParticipate in code reviews and team meetings, ensuring continuous learning and improvement.\nGood knowledge in SQL.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Engineer",
    "job_id": "4273021252",
    "company_name": "Stealth Start-Up",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Python",
      "ParseHub",
      "OpenAI API (GPT-4)",
      "Claude 3.x Sonnet",
      "Google Cloud Natural Language API",
      "Retool",
      "AWS",
      "Generative AI",
      "Prompt Engineering",
      "Agents",
      "Vector databases",
      "RAGs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-stealth-start-up-4273021252",
    "posted_at": null,
    "job_description": "Job Description:\n\nIn this role, you will:\n\n* Build full web and app products with an AI assistant with world class user experience.  \n\n* Work with cutting-edge generative AI and agent-based platforms to deliver an exceptional user experience in conversational UI and data analysis.\n\n* Design and build robust integrations with various systems, apps, and platforms to expand the product’s ecosystem.\n\n* Take full ownership of what you build.\n\n* Partner well with international peers. \n\n\n\n\nTo be successful in this role, you should:\n\n* Be passionate about solving big problems for the underserved and build tech for good. \n\n* Be relentlessly self motivated, curious and operate well with peers but can fully manage yourself and your work. \n\n* Have strong knowledge of Python and be able to build an end to end coding infrastructure that scales from hundreds to millions of users. Past experience with this will be great.\n\n* Have experience working with generative AI architectures and stack, including prompt engineering, agents, vector databases, and RAGs.\n\n* Possess a basic understanding of computer science concepts (data structures, graphs, recursion, and building simple language parsers).\n\n* Be able to work with tools like Jira, GitHub, Sentry, and New Relic to follow a structured development process—or be willing to learn them quickly.\n\n* Be comfortable with the following tech stack: Python, ParseHub, OpenAI API (GPT-4) / Claude 3.x Sonnet, Google Cloud Natural Language API, Retool, AWS. (It's okay if you don't know all of these, but you should be willing to learn.)\n\n* If you can also handle some frontend, that’s a great bonus but not necessary. \n\n\n\n\nBenefits\n\n* We're fully remote - so you can work from anywhere within +/- 5hrs of UTC.\n\n* Flexible working hours.\n\n* Biweekly or monthly coaching with a senior Engineering mentor.\n\n\n\n\nAbout Us\n\n* We’re an early-stage AI startup, currently in stealth mode, led by a former Director of Insights at Meta. We've helped build products at Google, Uber and WhatsApp - all with a focus on world-class user experience at massive scale.\n\n* As a team, we're hard-working, impact-driven, and a little obsessed with solving meaningful problems for the underserved. \n\n* We believe deeply in tech for good and want to see the underdogs win through better technology and AI.\n\n\n\n\nMission\n\nIn AY, we are building an AI enabled customer experience improvement platform for small businesses. We have just started and our early customers are quite positive about what we are doing for them. You can help us get to more users and build out the product in real time. \n\n\n\n\nWhy join?\n\n\n\n\n* You love the challenges of a 0-1 product. \n\n* You operate autonomously and with accountability. You never miss deadlines.\n\n* You offer plans and ideas than expect to be told what to do\n\n* You believe that a superior product combined with grit, perseverance and tireless execution wins when you face competition / big tech and all sorts of curveballs.\n\n* You can think clearly under pressure or when things are tough. \n\n* You are a fast learner and drive your own growth. \n\n* You put your hand up to take on more and deliver with full accountability.\n\n* You diagnose your mistakes and figure out how to not repeat them.\n\n\n\n\nLevel - Suitable for Final Year Engineering graduates to upto 4 years of experience from reputable institutions like IITs only.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Associate Software Engineer (Internship Program to Full-time Employee)",
    "job_id": "4276581685",
    "company_name": "Kaplan",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/associate-software-engineer-internship-program-to-full-time-employee-at-kaplan-4276581685",
    "posted_at": null,
    "job_description": "Job Title\n\nAssociate Software Engineer (Internship Program to Full-time Employee)\n\nJob Description\n\nFor more than 80 years, Kaplan has been a trailblazer in education and professional advancement. We are a global company at the intersection of education and technology, focused on collaboration, innovation, and creativity to deliver a best in class educational experience and make Kaplan a great place to work.\n\nOur offices in India opened in Bengaluru in 2018. Since then, our team has fueled growth and innovation across the organization, impacting students worldwide. We are eager to grow and expand with skilled professionals like you who use their talent to build solutions, enable effective learning, and improve students’ lives.\n\nThe future of education is here and we are eager to work alongside those who want to make a positive impact and inspire change in the world around them.\n\nAs an Associate Software Engineer will be responsible for managing all phases of the software development lifecycle, including programming, testing, and documentation. Ensure high-quality software delivery to end-users while improving process documentation and actively participating in agile methodologies and scrum ceremonies.\n\nPrimary Responsibilities\n\n\nUnderstanding all the phases of the software development lifecycle.\nProgramming, testing and documenting applications.\nExecuting and troubleshooting existing code to identify and rectify errors.\nDelivering high-quality software products to end-users and ensuring that they meet the required standards.\nWriting test cases that cover various aspects of the software, including functional, integration, performance, and usability testing.\nImprove documentation of processes and systems.\nFamiliarizing oneself with agile methodologies and actively engaging in all scrum ceremonies.\n30-day notification period preferred\n\n\nMinimum Qualifications\n\n\nBS/MS in a relevant field (Computer Science, Engineering)\nUnderstands core software development concepts such as data structures, object oriented programming, n-tier architectures, unit testing.\nWrites unit tests and is able to debug code.\nFollows Agile workflow and uses team development tools (e.g., issue tracking, source control) effectively.\nUnderstands the importance of Atom architecture principles related to scalability, flexibility, stability and simplicity.\n\n\nPreferred Qualifications\n\n\nKnowledge on Front End and/or BackEnd technologies such as HTML, CSS, Angular, React, NodeJS, .Net, Java, Salesforce Apex, Visualforce, Lightening, JavaScript, Shell, Python.\nBasic knowledge of fundamentals on software development: modularization, object oriented design.\n\n\nLocation\n\nBangalore, KA, India\n\nAdditional Locations\n\nEmployee Type\n\nEmployee\n\nJob Functional Area\n\nDevelopment\n\nBusiness Unit\n\n00091 Kaplan Higher ED\n\nAt Kaplan, we recognize the importance of attracting and retaining top talent to drive our success in a competitive market. Our salary structure and compensation philosophy reflect the value we place on the experience, education, and skills that our employees bring to the organization, taking into consideration labor market trends and total rewards. All positions with Kaplan are paid at least $15 per hour or $31,200 per year for full-time positions. Additionally, certain positions are bonus or commission-eligible. And we have a comprehensive benefits package, learn more about our benefits here.\n\nDiversity & Inclusion Statement\n\nKaplan is committed to cultivating an inclusive workplace that values diversity, promotes equity, and integrates inclusivity into all aspects of our operations. We are an equal opportunity employer and all qualified applicants will receive consideration for employment regardless of age, race, creed, color, national origin, ancestry, marital status, sexual orientation, gender identity or expression, disability, veteran status, nationality, or sex. We believe that diversity strengthens our organization, fuels innovation, and improves our ability to serve our students, customers, and communities. Learn more about our culture here.\n\nKaplan considers qualified applicants for employment even if applicants have an arrest or conviction in their background check records. Kaplan complies with related background check regulations, including but not limited to, the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. There are various positions where certain convictions may disqualify applicants, such as those positions requiring interaction with minors, financial records, or other sensitive and/or confidential information.\n\nKaplan is a drug-free workplace and complies with applicable laws.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Associate Application Developer Java Angular",
    "job_id": "4248972464",
    "company_name": "UPS",
    "location": "India",
    "experience": "Not specified",
    "salary": null,
    "key_skills": [
      "Java",
      "Angular"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/associate-application-developer-java-angular-at-ups-4248972464",
    "posted_at": null,
    "job_description": "Before you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nThe Applications Development Associate supports programming, testing, and analysis duties and tasks. He/She performs tasks within planned durations to meet established deadlines. This position will provide coding, testing, and/or analysis for basic applications. He/She collaborates with teams to ensure effective communications and to support the achievement of objectives. This position provides support for applications and business functions. He/She contributes to the identification and reporting of defects in work products. This position assists with documentation (e.g., requirements, test and defect data, variances, problem resolution, etc.). The Applications Development Associate performs activities of lower complexity under close supervision.\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Associate Application Developer Java Angular",
    "job_id": "4248975095",
    "company_name": "UPS",
    "location": "India",
    "experience": "Not specified",
    "salary": null,
    "key_skills": [
      "Java",
      "Angular"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/associate-application-developer-java-angular-at-ups-4248975095",
    "posted_at": null,
    "job_description": "Before you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nThe Applications Development Associate supports programming, testing, and analysis duties and tasks. He/She performs tasks within planned durations to meet established deadlines. This position will provide coding, testing, and/or analysis for basic applications. He/She collaborates with teams to ensure effective communications and to support the achievement of objectives. This position provides support for applications and business functions. He/She contributes to the identification and reporting of defects in work products. This position assists with documentation (e.g., requirements, test and defect data, variances, problem resolution, etc.). The Applications Development Associate performs activities of lower complexity under close supervision.\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Applications Developer Location Chennai Fullstack Angular .Net",
    "job_id": "4248785240",
    "company_name": "UPS",
    "location": "India",
    "experience": "Not specified",
    "salary": null,
    "key_skills": [
      "Angular",
      ".Net"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/applications-developer-location-chennai-fullstack-angular-net-at-ups-4248785240",
    "posted_at": null,
    "job_description": "Before you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nMoving our world forward by delivering what matters! UPS is a company with a proud past and an even brighter future. Our values define us. Our culture differentiates us. Our strategy drives us. At UPS we are customer first, people led and innovation driven. UPS’s India based Technology Development Centers will bring UPS one step closer to creating a global technology workforce that will help accelerate our digital journey and help us engineer technology solutions that drastically improve our competitive advantage in the field of Logistics.\n\n‘Future You’ grows as a visible and valued Technology professional with UPS, driving us towards an exciting tomorrow. As a global Technology organization we can put serious resources behind your development. If you are solutions orientated, UPS Technology is the place for you. ‘Future You’ delivers ground-breaking solutions to some of the biggest logistics challenges around the globe. You’ll take technology to unimaginable places and really make a difference for UPS and our customers.\n\nJob Summary\n\nThis position performs duties and tasks to support full systems life cycle management (e.g., analyses, technical requirements, design, coding, testing, implementation of systems and applications software, etc.). He/She performs tasks within planned durations and established deadlines. This position collaborates with teams to ensure effective communication and support the achievement of objectives. He/She provides development, maintenance, and support for applications.\n\nResponsibilities\n\n\nAssists with Information Systems projects.\nAssists in system analysis and design.\nDesigns and develops low to moderately complex applications.\nGenerates application documentation.\nSupports integration builds.\nAssists with maintenance and support.\n\n\nPrimary Skills\n\nAzure Cloud, .NET core, Angular JS, SQL Server,\n\nSecondary Skills\n\nPython, CI/CD Technologies, Kubernetes.\n\nQualifications\n\n\nBachelor’s Degree or International equivalent\nBachelor's Degree or International equivalent in Computer Science, Information Systems, Mathematics, Statistics or related field - Preferred\n\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Intermediate Software Engineer Full Stack C# .Net MVC Angular Azure Cloud",
    "job_id": "4248972579",
    "company_name": "UPS",
    "location": "India",
    "experience": "Not specified",
    "salary": null,
    "key_skills": [
      "C#",
      ".Net Framework",
      ".Net Core",
      "MVC",
      "Entity Framework",
      "ASP.NET",
      "Angular",
      "MS SQL",
      "Azure Cloud"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/intermediate-software-engineer-full-stack-c%23-dotnet-mvc-angular-azure-cloud-at-ups-4248972579",
    "posted_at": null,
    "job_description": "Before you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nJob Summary\n\nThis position provides input and support for full systems life cycle management activities (e.g., analyses, technical requirements, design, coding, testing, implementation of systems and applications software, etc.). He/She performs tasks within planned durations and established deadlines. This position collaborates with teams to ensure effective communication and support the achievement of objectives. He/She provides knowledge, development, maintenance, and support for applications.\n\nResponsibilities\n\n\nGenerates application documentation.\nContributes to systems analysis and design.\nDesigns and develops moderately complex applications.\nContributes to integration builds.\nContributes to maintenance and support.\nMonitors emerging technologies and products.\n\n\nPrimary Skills\n\n\nC#/Dotnet Framework and Dotnet Core\nFramework - MVC, Entity Framework\nWeb-Development (ASP.NET/Angular)\nDatabase (MS SQL)\nREST API (Micro/Webservices), Web API\n\n\nSecondary Skills\n\n\nCloud Development - Azure Functions, Graph API\nAzure DevOps (CI/CD)\n\n\nQualifications\n\n\nBachelor’s Degree or International equivalent\nBachelor's Degree or International equivalent in Computer Science, Information Systems, Mathematics, Statistics or related field\n\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Junior PHP Web Developer (Work From Office)",
    "job_id": "4273062189",
    "company_name": "Viva Books Private Limited",
    "location": "India",
    "experience": "1 year",
    "salary": "Up to ₹3.36 Lakh CTC per annum",
    "key_skills": [
      "PHP",
      "MySql",
      "CSS",
      "Bootstrap",
      "JavaScript",
      "HTML5",
      "Node js",
      "Ajax"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/junior-php-web-developer-work-from-office-at-viva-books-private-limited-4273062189",
    "posted_at": null,
    "job_description": "Office Location: Daryaganj, Delhi\n\n\n\n\nSalary: Up to Rs. 3.36 Lakh CTC per annum\n\nLooking for a passionate PHP developer and front-end developer who wants to do quality work and improve their skills.\n\n\n\n\nWe are looking for a PHP Developer who is dedicated to the craft, writes code that they are proud of and can produce desired result of our websites or web based applications. You are responsible for creating and implementing an array of Web-based products using PHP, MySQL, Ajax, and JavaScript. You develop back-end as well as front end components too.\n\n\n\n\nSkills required - PHP, MySql, CSS, Bootstrap, JavaScript, HTML5, Node js, Ajax & Will power to learn.\n\nResponsibilities and Duties:\n\n·        Write \"clean\", well-designed code.\n\n·        Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality.\n\n·        Responsible for application design, code development, testing and deployment, and maintenance\n\n·        Write well designed and optimized code\n\n·        Contribute in all phases of the development\n\n·        Develop and deploy new features to facilitate related procedures and tools if necessary\n\n·        Troubleshoot, test and maintain the core product and database to ensure strong optimization and functionality\n\n \n\nMinimum Experience - 1 Year\n\nPHP: 1 year (Preferred)\n\nTotal Work: 1 year (Preferred)\n\nSoftware Development: 1 year (Preferred)\n\nBachelor's (Preferred)\n\n\n\n\nAbout the company:\n\nViva VOLT (Viva Online Learning Technologies) is a comprehensive educational programme taking care of the school curriculum, learning at school, self-learning and assessment. High-quality content developed by the best academic minds is delivered through video lessons by skilled presenters and accomplished teachers. Animations and graphical representations make lessons and key concepts come alive. VOLT is an innovative platform for curricular learning. With video and interactive course modules delivered through web, it turns learning into a fun-filled and engaging experience.\n\nViva Books is an independent publisher of quality educational books with nation-wide presence and a sales network covering the whole of South Asia. It publishes and distributes in subject areas like physical sciences, biosciences, computer science, literature, social sciences, medicine, management and subjects of general interest. Viva Books also specializes in school books and children's books. Viva has eight branches across India and has a strong presence in the domestic as well as in the international publishing world. Viva Books recently celebrated its 30th anniversary in 2021.\n\nFocusing on editorial quality and high production values, Viva Education (School Division of Viva Books) publishes books in all major subject areas in school education. With a young, talented and energetic team and an impressive list of titles, Viva is one of the fastest growing and future-oriented organizations in the Indian publishing industry.\n\nWebsites: https://vivadigital.in/ & https://vivavolt.in/",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Intermediate Software Engineer Full Stack C# .Net MVC Angular Azure Cloud",
    "job_id": "4248974286",
    "company_name": "UPS",
    "location": "India",
    "experience": "Not specified",
    "salary": null,
    "key_skills": [
      "C#",
      ".Net Framework",
      ".Net Core",
      "MVC",
      "Entity Framework",
      "ASP.NET",
      "Angular",
      "MS SQL",
      "Azure Cloud"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/intermediate-software-engineer-full-stack-c%23-dotnet-mvc-angular-azure-cloud-at-ups-4248974286",
    "posted_at": null,
    "job_description": "Before you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nJob Summary\n\nThis position provides input and support for full systems life cycle management activities (e.g., analyses, technical requirements, design, coding, testing, implementation of systems and applications software, etc.). He/She performs tasks within planned durations and established deadlines. This position collaborates with teams to ensure effective communication and support the achievement of objectives. He/She provides knowledge, development, maintenance, and support for applications.\n\nResponsibilities\n\n\nGenerates application documentation.\nContributes to systems analysis and design.\nDesigns and develops moderately complex applications.\nContributes to integration builds.\nContributes to maintenance and support.\nMonitors emerging technologies and products.\n\n\nPrimary Skills\n\n\nC#/Dotnet Framework and Dotnet Core\nFramework - MVC, Entity Framework\nWeb-Development (ASP.NET/Angular)\nDatabase (MS SQL)\nREST API (Micro/Webservices), Web API\n\n\nSecondary Skills\n\n\nCloud Development - Azure Functions, Graph API\nAzure DevOps (CI/CD)\n\n\nQualifications\n\n\nBachelor’s Degree or International equivalent\nBachelor's Degree or International equivalent in Computer Science, Information Systems, Mathematics, Statistics or related field\n\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Intermediate Software Engineer Full Stack C# .Net MVC Angular Azure Cloud",
    "job_id": "4248969973",
    "company_name": "UPS",
    "location": "India",
    "experience": "Not specified",
    "salary": null,
    "key_skills": [
      "C#",
      ".Net Framework",
      ".Net Core",
      "MVC",
      "Entity Framework",
      "ASP.NET",
      "Angular",
      "MS SQL",
      "Azure Cloud"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/intermediate-software-engineer-full-stack-c%23-dotnet-mvc-angular-azure-cloud-at-ups-4248969973",
    "posted_at": null,
    "job_description": "Before you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nJob Summary\n\nThis position provides input and support for full systems life cycle management activities (e.g., analyses, technical requirements, design, coding, testing, implementation of systems and applications software, etc.). He/She performs tasks within planned durations and established deadlines. This position collaborates with teams to ensure effective communication and support the achievement of objectives. He/She provides knowledge, development, maintenance, and support for applications.\n\nResponsibilities\n\n\nGenerates application documentation.\nContributes to systems analysis and design.\nDesigns and develops moderately complex applications.\nContributes to integration builds.\nContributes to maintenance and support.\nMonitors emerging technologies and products.\n\n\nPrimary Skills\n\n\nC#/Dotnet Framework and Dotnet Core\nFramework - MVC, Entity Framework\nWeb-Development (ASP.NET/Angular)\nDatabase (MS SQL)\nREST API (Micro/Webservices), Web API\n\n\nSecondary Skills\n\n\nCloud Development - Azure Functions, Graph API\nAzure DevOps (CI/CD)\n\n\nQualifications\n\n\nBachelor’s Degree or International equivalent\nBachelor's Degree or International equivalent in Computer Science, Information Systems, Mathematics, Statistics or related field\n\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Application Developer Java Angular Oracle",
    "job_id": "4248969871",
    "company_name": "UPS",
    "location": "India",
    "experience": "2 years +",
    "salary": null,
    "key_skills": [
      "Java",
      "Angular",
      "Oracle",
      "Devops"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/application-developer-java-angular-oracle-at-ups-4248969871",
    "posted_at": null,
    "job_description": "Before you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nJob Summary\n\nThis position provides input, support, and performs full systems life cycle management activities (e.g., analyses, technical requirements, design, coding, testing, implementation of systems and applications software, etc.). He/She participates in component and data architecture design, technology planning, and testing for Applications Development (AD) initiatives to meet business requirements. This position provides input to applications development project plans and integrations. He/She collaborates with teams and supports emerging technologies to ensure effective communication and achievement of objectives. This position provides knowledge and support for applications development, integration, and maintenance. He/She provides input to department and project teams on decisions supporting projects.\n\nResponsibilities\n\n\n2 years + for Full stack developer with Java, Oracle and Angular. Devops and Agile project management is a plus.\nPlans, develops, and manages the organization's information software, applications, systems, and networks.\nPerforms systems analysis and design.\nDesigns and develops moderate to highly complex applications.\nDevelops application documentation.\nProduces integration builds.\nPerforms maintenance and support.\nSupports emerging technologies and products.\nEnsures UPS's business needs are met through continual upgrades and development of new technical solutions.\n\n\nQualifications\n\n\nBachelor’s Degree or International equivalent in Computer Science, Information Systems, Mathematics, Statistics, or related field - Preferred\n\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer .Net Core React Devops",
    "job_id": "4273203232",
    "company_name": "kauverymeds.com",
    "location": "India",
    "experience": "Not specified",
    "salary": null,
    "key_skills": [
      ".NET Core",
      "C#",
      "React",
      "Next.js",
      "TypeScript",
      "JavaScript",
      "PostgreSQL",
      "MySQL",
      "DevOps",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/full-stack-developer-net-core-react-devops-at-kauverymeds-com-4273203232",
    "posted_at": null,
    "job_description": "Job Summary:\n\nWe are looking for a highly skilled and motivated Full Stack Developer with strong experience in .NET Core (C#) for backend development and React/Next.js with TypeScript for frontend. The ideal candidate will have a deep understanding of modern web application architecture, database design (PostgreSQL/MySQL), and DevOps practices.\n\n \n\n \n\nKey Responsibilities:\n\nDesign, develop, and maintain scalable web applications using .NET Core (C#) for backend and React/Next.js for frontend.\n\nCollaborate with cross-functional teams to define, design, and ship new features.\n\nDevelop and maintain robust APIs and integrate with third-party services.\n\nWork with PostgreSQL and MySQL to manage and optimize database interactions.\n\nEnsure code quality through unit tests, integration tests, and code reviews.\n\nMonitor and optimize application performance, scalability, and security.\n\nStay updated with emerging technologies and propose adoption where appropriate.\n\n \n\nRequired Skills:\n\nBackend: Strong proficiency in .NET Core, C#\n\nFrontend: Experience with React, Next.js, TypeScript, JavaScript\n\nDatabase: Proficiency in PostgreSQL and MySQL\n\nDevOps: Experience with DevOps, and version control (Git)\n\nSolid understanding of RESTful APIs, authentication/authorization (e.g., JWT, OAuth), and security best practices\n\nExcellent problem-solving skills and ability to work in a fast-paced environment",
    "source": "linkedin",
    "relevance_score": "high"
  }
]