[
  {
    "title": "Dot Net Developer - Asp.net MVC",
    "job_id": "4256545499",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      ".Net MVC",
      ".Net Core",
      "MS SQL Server",
      "JavaScript",
      "JQuery"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4256545499/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nExperience with .Net MVC, .Net core, MS SQL Server.\n\nGood to have Experience in agile development\n\nGood to have Experience in java script ,JQuery\n\nExperience to handle activities such as release coordination, interaction with various teams\n\nStrong understanding and Experience with .Net Framework\n\nSkills Required\n\nRoleDot Net Developer - Asp.net MVC\n\nIndustry TypeIT/ Computers - Software\n\nFunctional AreaIT-Software\n\nRequired EducationB Tech, B. COM, BBA\n\nEmployment TypeFull Time, Permanent\n\nKey Skills\n\n\n.NET DEVELOPER\nJAVASCRIPT\n\n\nOther Information\n\nJob CodeGO/JC/480/2025\n\nRecruiter NameMithra Dayalan\n\n\n\nDesired Skills and Experience\n\nNET DEVELOPER, JAVASCRIPT",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Unity Game Developer",
    "job_id": "4282032188",
    "company_name": "David's Studio",
    "location": "India",
    "experience": "Freshers",
    "salary": null,
    "key_skills": [
      "Unity",
      "Game Programming",
      "Gameplay Programming",
      "Object-Oriented Programming (OOP)",
      "Game Design"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282032188/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nDavid's Studio, A Indian game development group dedicated to creating immersive and innovative gaming experiences. Our expert team excels in using cutting-edge tools like Unity, Unreal Engine, Blender, and SpeedTree to deliver visually stunning and highly interactive games across PC, console, and mobile platforms. We pride ourselves on our commitment to quality and innovation, ensuring each project meets the highest standards. Our collaborative approach allows us to tailor game mechanics and narratives to the unique needs of our clients. Join us on our journey to shape the future of gaming.\n\n Role Description\n \nThis is a Part-Time remote role for a Unity Game Developer. We Offer Experience for the Freshers. The Unity Game Developer will be responsible for game programming and designing, developing gameplay, programming in object-oriented languages, and refining game mechanics. The developer will work closely with other team members to build and deploy interactive games across multiple platforms.\n\n Qualifications\n \n\nProficiency in Game Programming and Gameplay Programming\nStrong skills in Programming and Object-Oriented Programming (OOP)\nExperience with Game Design principles and practices\nExcellent problem-solving and analytical skills\nAbility to work collaboratively in a remote environment\nExperience with Unity or other game engines is a plus\nBachelor's degree in Computer Science, Game Development, or a related field",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Software Test Engineer",
    "job_id": "4280611586",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Test Execution",
      "Software Testing",
      "Test Cases",
      "Software Development",
      "Testing methodologies"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280611586/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nWe suggest you enter details here\n\n Role Description\n \nThis is a full-time on-site role for a Software Test Engineer, located in Kadapa Mandal. The Software Test Engineer will be responsible for executing tests, developing and maintaining test cases, performing software testing, and collaborating with the software development team. The Engineer will ensure that all software products meet the highest standards of quality before they are released.\n\n Qualifications\n \n\nTest Execution and Software Testing skills\nAbility to develop and maintain Test Cases\nExperience in Software Development\nProficiency in Testing methodologies and tools\nExcellent analytical and problem-solving skills\nStrong communication and collaboration skills\nBachelor's degree in Computer Science, Engineering, or related field\nRelevant certifications in software testing is a plus",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "MERN Stack Developer",
    "job_id": "4280622823",
    "company_name": "RudrX Techlabs",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "MERN Stack",
      "MongoDB",
      "Express.js",
      "React.js",
      "Node.js",
      "RESTful APIs",
      "Git",
      "CI/CD"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280622823/",
    "posted_at": null,
    "job_description": "About the job\n\nMERN Stack Developer (Contract - 2 Months)\nCompany: RudrX Techlabs\nLocation: Remote\nJob Type: Contract (2 Months)\nStart Date: Immediate\n\nAbout RudrX Techlabs:\nRudrX Techlabs is a fast-growing tech company specializing in delivering innovative digital solutions to clients across industries. We pride ourselves on a collaborative and efficient culture, working on impactful projects using modern technology stacks.\n\nRole Overview:\nWe’re looking for a MERN Stack Developer to join us on a short-term contract basis. You’ll be working closely with our product and design teams to build and deliver high-quality web applications. This role is perfect for someone who thrives in a fast-paced environment and can take ownership of the development cycle from start to finish.\n\nResponsibilities:\nDevelop, test, and deploy full-stack web applications using MongoDB, Express.js, React.js, and Node.js\nCollaborate with UI/UX designers and backend engineers to implement clean and scalable code\nIntegrate RESTful APIs and third-party services\nOptimize applications for maximum speed and scalability\nTroubleshoot and debug issues as they arise\nParticipate in code reviews and contribute to team knowledge sharing\n\nRequirements:\nProven experience with the MERN stack\nStrong understanding of REST APIs, Git, and modern development practices\nFamiliarity with deployment tools and CI/CD pipelines is a plus\nAbility to work independently and meet tight deadlines\nExcellent problem-solving skills and attention to detail\n\nContract Details:\nDuration: 2 months\nStart: ASAP\nType: Contract\nLocation: Remote\n\nHow to Apply:\nIf you’re a MERN Stack developer who’s ready to hit the ground running and make an impact, we’d love to hear from you!\n👉 Send your portfolio or GitHub, and resume to workwithme@dharmik.dev or apply directly via LinkedIn.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4282033005",
    "company_name": "PurpleMerit",
    "location": "India",
    "experience": "0-1 Years",
    "salary": null,
    "key_skills": [
      "Full-stack web applications",
      "RESTful APIs",
      "GraphQL APIs",
      "AWS/Azure/GCP",
      "CI/CD pipelines",
      "PostgreSQL",
      "MongoDB",
      "OAuth",
      "JWT"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282033005/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout the Role\n\nPurpleMerit is seeking smart, motivated individuals for a Full Stack Developer role. You will work alongside talented engineers, designers, and product managers to design and deliver end-to-end web and mobile applications that drive real business value. This position involves a mandatory internship-to-full-time pathway designed to nurture and evaluate your technical and collaborative skills in a real-world environment.\n\n \n\nExperience: 0-1 Years\n\nLocation: Onsite (Banashankari, Bengaluru ) \n\nPincode: 560085\n\n \n\nKey Responsibilities\n\nDesign and implement scalable full-stack web applications from concept to deployment.\nBuild and maintain end to end websites, Chrome extensions, PWAs, and mobile apps (Android & iOS).\nDevelop RESTful and GraphQL APIs for frontend-backend integration.\nArchitect systems with a strong focus on system design, scalability, and maintainability.\nImplement secure authentication and authorization: OAuth, JWT, session management, role-based access.\nIntegrate AI tools, agents, and APIs to support product innovation and team productivity.\nManage cloud infrastructure (AWS/Azure/GCP), CI/CD pipelines, and efficient deployments.\nDesign and optimize databases (PostgreSQL, MongoDB): schema design, normalization, indexing, and security.\nWrite reusable, testable, and efficient code; ensure code quality through testing and best practices.\nTroubleshoot and debug production issues and optimize application speed and scalability.\nSelf-manage tasks and deadlines independently in a remote startup environment.\nCollaborate effectively with UI/UX designers, product managers, and stakeholders.\nDocument software designs, decisions, and features.\nHandle domain connection, hosting, and deployment.\nStay current with new technologies, and contribute ideas to drive technical innovation.\n\n \n\nCore Skills\n\nProficiency in Java (Spring Boot, Spring MVC, Spring Security).\nExperience with JavaScript frameworks: React.js, Angular, Node.js, Express.js, Flask/Django (Python).\nKnowledge of RESTful API design, microservices architecture, and authentication protocols (OAuth, JWT).\nExperience with SQL (PostgreSQL) and NoSQL (MongoDB).\nFamiliarity with cloud platforms (AWS, Azure, or Google Cloud), Docker, Kubernetes, and CI/CD pipelines.\nExperience in Android (Java/Kotlin) and iOS (Swift/Objective-C) is a plus.\nServer management experience with Linux/Unix, Nginx, and Apache.\nAbility to integrate AI tools and APIs; basic knowledge of AI agents and prompt engineering.\nStrong problem-solving mindset emphasizing simplicity, performance, and continuous improvement.\n\n \n\nSoft Skills\n\nSelf-motivated and independent with the ability to manage time and meet deadlines without supervision.\nStrong collaboration skills in remote and distributed team environments.\nWillingness to quickly learn and adapt to new technologies and changing requirements.\nOwnership mindset, taking responsibility from design through deployment and maintenance.\n\n \n\nQualifications\n\nBachelor’s degree in computer science is required\n\n \n\nThings to Keep in Mind\n\nNo laptop or physical assets will be provided by PurpleMerit; candidates must use their own systems.\nPreferred system RAM size is 16GB or 32GB to handle development tasks efficiently.\nWork timings are fixed: 9:00 AM – 6:30 PM IST, Monday to Saturday.\nFreelancing or any other external work during the internship is strictly prohibited and may lead to termination.\nInternship duration is mandatory 6 months for consideration for full-time roles.\nCandidates must have strong remote communication skills and experience working in distributed teams.\nOnly applications sent to the specified email will be considered .\n\n \n\nSalary Structure\n\nInternship Fixed Stipend: ₹12,000 per month for 6 months. \nEvery 3 months, performance audits to determine eligibility for stipend hikes.\nPerformance-Based Increment: Interns will undergo performance reviews every three months, with top performers eligible for stipend increases up to ₹16,000 per month based on their project impact and growth during the internship.\nFull-Time Salary after successful internship completion: ₹3 LPA to ₹6.5 LPA, based on performance, leadership, and technical skills demonstrated during the internship period.\n\n \n\nHow to Apply\n\nSend your updated resume to career@purplemerit.com before 11:55 PM on 12 August 2025.\n\nOnly applications sent to this email will be considered.\n\nResumes submitted via LinkedIn or other channels will NOT be reviewed.\n\n Please ensure your application contains all relevant details requested in this job post.\n\n \n\nWhy Join PurpleMerit?\n\nMake direct impact your work shapes real products and business outcomes.\nWork remotely with agile, collaborative teams.\nLeverage cutting-edge technologies and AI tools.\nContinuous learning: fresh challenges, mentorship, and growth opportunities.\nInclusive culture: Diversity valued, fresh perspectives encouraged.\nEnd-to-end ownership: You architect, build, deliver, and learn in every project.\n\n \n\nPurpleMerit is proud to be an equal opportunity employer. We value diversity, encourage fresh perspectives, and are committed to building an inclusive environment for all employees.\n\n\n\n\nIf you are passionate about building impactful software and eager to work in an AI-driven startup, apply now and start your career with PurpleMerit!\n\n\n\n\nApply now to start your career with PurpleMerit!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Shopify Developer",
    "job_id": "4280620062",
    "company_name": "UnfoldCRO",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Shopify",
      "Liquid",
      "HTML",
      "CSS",
      "JavaScript",
      "responsive design",
      "Shopify apps",
      "Shopify APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280620062/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout Us\n\nUnfoldCRO helps Shopify store owners maximize their online potential through conversion rate optimization, custom Shopify development, and SEO strategies. We work with clients worldwide to create ecommerce experiences that convert visitors into loyal customers.\n\n\n\n\nRole Overview\n\n We’re looking for a motivated Shopify Developer who is passionate about ecommerce and eager to learn. You will work closely with our design and optimization teams to build, customize, and enhance Shopify stores for our clients.\n\n\n\n\nKey Responsibilities\n\nDevelop and customize Shopify themes\nImplement responsive designs and ensure cross-browser compatibility\nAssist in optimizing store performance and speed\nCollaborate with the team to integrate CRO and SEO best practices\nTroubleshoot and fix bugs or functionality issues\n\n\n\n\nRequirements\n\nBasic knowledge of Shopify, Liquid, HTML, CSS, and JavaScript\nUnderstanding of responsive design principles\nProblem-solving mindset and attention to detail\nAbility to work independently in a remote setup\nStrong willingness to learn and adapt to new tools and processes\n\n\n\n\nNice to Have\n\nFamiliarity with Shopify apps and APIs\nUnderstanding of ecommerce conversion principles\n\n\n\n\nWhat We Offer\n\nFlexible remote work environment\nHands-on training and mentorship\nOpportunity to work on real client projects from day one\nCareer growth in a fast-paced ecommerce optimization agency",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Python Developer",
    "job_id": "4282028905",
    "company_name": "ARSoft Consulting",
    "location": "India",
    "experience": "2–3 years",
    "salary": null,
    "key_skills": [
      "Python",
      "API",
      "automated testing",
      "code quality",
      "Python frameworks",
      "Python libraries"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282028905/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Summary / About the Role\n\nARSoft Consulting is seeking a motivated and detail-oriented Python Developer with 2–3 years of professional experience to join our growing team. This role will involve designing, developing, and maintaining Python-based applications and solutions for enterprise clients. The ideal candidate will be adept at writing clean, efficient code and have a strong understanding of modern software development practices.\n\nYou will work closely with cross-functional teams, contributing to various phases of the development lifecycle, from concept through deployment. This is a remote, full-time position, offering flexibility and opportunities to work on projects with global impact.\n\nKey Responsibilities\nDevelop, test, and maintain Python-based applications and scripts.\nCollaborate with software engineers, business analysts, and stakeholders to gather requirements and translate them into technical solutions.\nOptimise code for performance, scalability, and maintainability.\nIntegrate third-party APIs and libraries into applications.\nImplement automated testing frameworks and ensure code quality standards are met.\nTroubleshoot, debug, and upgrade existing systems as required.\nMaintain detailed documentation for code, processes, and system configurations.\nStay up to date with emerging Python frameworks, libraries, and best practices.\nRequired Qualifications\nBachelor’s degree in Computer Science, Information Technology, or related discipline.\n2–3 years of professional experience in Python development.\nProficiency with Python 3.x and common libraries (e.g., Pandas, NumPy, Requests).\nExperience with Django, Flask, or FastAPI frameworks.\nSolid understanding of RESTful APIs and web services.\nFamiliarity with version control systems such as Git.\nStrong problem-solving skills and attention to detail.\nGood written and verbal communication skills in English.\nPreferred Qualifications (Nice-to-Have)\nExperience with cloud platforms such as AWS, Azure, or GCP.\nKnowledge of containerisation tools (e.g., Docker).\nFamiliarity with CI/CD pipelines.\nUnderstanding of database technologies (e.g., PostgreSQL, MySQL, MongoDB).\nExposure to agile software development methodologies.\nWhat We Offer\nCompetitive salary based on experience.\nFlexible remote working environment.\nOpportunities to work on diverse, international projects.\nProfessional development and learning opportunities.\nSupportive and collaborative team culture.\nAbout the Company\n\nARSoft Consulting is a boutique consulting firm founded by professionals with extensive international exposure and a collective experience of over 50 years. The founders have worked with a variety of Fortune 500 companies worldwide, spanning regions such as the United States, the United Kingdom, Europe, Australia, Singapore, and Latin America. This deep-rooted expertise enables ARSoft Consulting to bring valuable global insights and best practices to its clients.\n\nCurrently, the firm is supporting a major client headquartered in Australia, with operations extending to South Africa and New Zealand. This partnership reflects ARSoft Consulting’s commitment to delivering quality and reliable services across diverse markets.\n\nLocation & Work Mode: Remote, Full-Time\n\nEqual Opportunity Statement\n\nARSoft Consulting is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, or age.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Project Manager Intern",
    "job_id": "4280624529",
    "company_name": "Spikeera",
    "location": "India",
    "experience": "Intern",
    "salary": null,
    "key_skills": [
      "software development lifecycle (SDLC)",
      "project management tools",
      "Notion",
      "Trello",
      "Jira",
      "Zoom",
      "Google Meet",
      "Discord",
      "HTML",
      "CSS",
      "JavaScript",
      "Canva"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280624529/",
    "posted_at": null,
    "job_description": "About the job\n\nWe’re an early-stage startup at Spikeera, currently in the process of building our very first team and launching operations. At present, there are no team members on board — which means you’ll be part of the founding batch of interns, helping us set up systems, processes, and workflows from scratch.\n\n\n\n\nWe will be working across eCommerce, IT services, and developing our own digital products. We’re looking for a Project Manager Intern to join us at this exciting stage to help coordinate projects, organize workflows, and manage progress as we get started.\n\n\n\n\nKey Responsibility:\n\n\n\n\nAssist in hiring and onboarding developers, designers, and interns\nCreate and manage team workflows.\nTrack deadlines, task updates, and delivery timelines\nCoordinate remote meetings and stand-ups\nCommunicate progress reports and blockers to the founder\nHelp document internal processes and project updates\n\n\n\n\nRequirement:\n\n\n\n\nBasic understanding of software development lifecycle (SDLC)\nFamiliarity with project management tools like Notion, Trello, or Jira. (Not Mandatory)\nComfortable using communication tools like Zoom, Google Meet or Discord.\nAbility to create and maintain task boards, timelines, and progress reports\nBasic proficiency in Microsoft Word and Excel (or Google Docs and Sheets) is helpful but not mandatory\nBasic knowledge of web development (HTML, CSS, JavaScript) is a bonus but not required\nExperience with Canva or similar design tools is a plus but optional\nEnglish proficiency: Intermediate+\nMust have reliable Wi-Fi, a laptop/computer, and a microphone for remote communication\n\n\n\n\nWhat You Will Get:\n\n\n\n\nInternship Completion Certificate\nLetter of Recommendation (based on performance)\nOpportunity to grow with us and potential for a paid role as the company scales\nExposure to real-world projects (services + product)\nFlexible, remote-first internship\n\n\n\n\nIdeal For:\n\n\n\n\nFreshers, recent graduates, or early professionals available for full-time commitment\nAspiring project managers, business analysts, or startup enthusiasts looking to grow their skills\nAnyone eager to gain hands-on experience in real-world startup and tech operations\n\n\n\n\nInternship Details:\n\nDuration: 3 months (with possibility of extension based on performance and company needs)\nType: Unpaid Internship\nLocation: Remote\nWorking Hours: Full-time preferred\nStipend: Currently unpaid — may convert to a paid role as we grow and begin generating revenue",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Full Stack Developer",
    "job_id": "4282023447",
    "company_name": "PurpleMerit",
    "location": "India",
    "experience": "0-1 Years",
    "salary": null,
    "key_skills": [
      "Full-stack web applications",
      "RESTful APIs",
      "GraphQL APIs",
      "AWS/Azure/GCP",
      "CI/CD pipelines",
      "PostgreSQL",
      "MongoDB",
      "OAuth",
      "JWT"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282023447/",
    "posted_at": null,
    "job_description": "About the job\n\nAbout the Role\n\nPurpleMerit is seeking smart, motivated individuals for a Full Stack Developer role in a fully remote setup. You will work alongside talented engineers, designers, and product managers to design and deliver end-to-end web and mobile applications that drive real business value. This position involves a mandatory internship-to-full-time pathway designed to nurture and evaluate your technical and collaborative skills in a real-world environment.\n\n \n\nExperience: 0-1 Years\n\nEmployment type: Remote\n\n \n\nKey Responsibilities\n\nDesign and implement scalable full-stack web applications from concept to deployment.\nBuild and maintain websites, Chrome extensions, PWAs, and mobile apps (Android & iOS).\nDevelop RESTful and GraphQL APIs for frontend-backend integration.\nArchitect systems with a strong focus on system design, scalability, and maintainability.\nImplement secure authentication and authorization: OAuth, JWT, session management, role-based access.\nIntegrate AI tools, agents, and APIs to support product innovation and team productivity.\nManage cloud infrastructure (AWS/Azure/GCP), CI/CD pipelines, and efficient deployments.\nDesign and optimize databases (PostgreSQL, MongoDB): schema design, normalization, indexing, and security.\nWrite reusable, testable, and efficient code; ensure code quality through testing and best practices.\nTroubleshoot and debug production issues and optimize application speed and scalability.\nSelf-manage tasks and deadlines independently in a remote startup environment.\nCollaborate effectively with UI/UX designers, product managers, and stakeholders.\nDocument software designs, decisions, and features.\nHandle domain connection, hosting, and deployment.\nStay current with new technologies, and contribute ideas to drive technical innovation.\n\n \n\nEligibility Qualifications\n\nBachelor’s degree in computer science is required\n NOC for students still graduating \n\n\n\n\nCore Skills\n\nProficiency in Java (Spring Boot, Spring MVC, Spring Security).\nExperience with JavaScript frameworks: React.js, Angular, Node.js, Express.js, Flask/Django (Python).\nKnowledge of RESTful API design, microservices architecture, and authentication protocols (OAuth, JWT).\nExperience with SQL (PostgreSQL) and NoSQL (MongoDB).\nFamiliarity with cloud platforms (AWS, Azure, or Google Cloud), Docker, Kubernetes, and CI/CD pipelines.\nExperience in Android (Java/Kotlin) and iOS (Swift/Objective-C) is a plus.\nServer management experience with Linux/Unix, Nginx, and Apache.\nAbility to integrate AI tools and APIs; basic knowledge of AI agents and prompt engineering.\nStrong problem-solving mindset emphaswizing simplicity, performance, and continuous improvement.\n\n\n\n\nSoft Skills\n\nSelf-motivated and independent with the ability to manage time and meet deadlines without supervision.\nStrong collaboration skills in remote and distributed team environments.\nWillingness to quickly learn and adapt to new technologies and changing requirements.\nOwnership mindset, taking responsibility from design through deployment and maintenance.\n\n \n\nThings to Keep in Mind\n\nNo laptop or physical assets will be provided by PurpleMerit; candidates must use their own systems. As this is an remote environment.\nPreferred system RAM size is 16GB or 32GB to handle development tasks efficiently.\nWork timings are fixed: 9:00 AM – 6:00 PM IST, Monday to Saturday.\nFreelancing or any other external work during the internship is strictly prohibited and may lead to termination.\nInternship duration is mandatory 5 months for consideration for full-time roles.\nCandidates must have strong remote communication skills and experience working in distributed teams.\nOnly applications sent to the specified email will be considered .\n\n \n\nSalary Structure\n\nInternship Stipend: ₹8,000 per month for 5 months.\nFull-Time Salary after successful internship completion: ₹3 LPA to ₹5.5 LPA, based on performance, leadership, and technical skills demonstrated during the internship period.\n\n \n\nHow to Apply\n\nSend your updated resume to career@purplemerit.com before 11:55 PM on 11 August 2025.\n\n Only applications sent to this email will be considered.\n\nResumes submitted via LinkedIn or other channels will NOT be reviewed.\n\n Please ensure your application contains all relevant details requested in this job post.\n\n \n\nWhy Join PurpleMerit?\n\nMake direct impact your work shapes real products and business outcomes.\nWork remotely with agile, collaborative teams.\nLeverage cutting-edge technologies and AI tools.\nContinuous learning: fresh challenges, mentorship, and growth opportunities.\nInclusive culture: Diversity valued, fresh perspectives encouraged.\nEnd-to-end ownership: You architect, build, deliver, and learn in every project.\n\n \n\nPurpleMerit is proud to be an equal opportunity employer. We value diversity, encourage fresh perspectives, and are committed to building an inclusive environment for all employees.\n\n\n\n\nIf you are passionate about building impactful software and eager to work in an AI-driven startup, apply now and start your career with PurpleMerit!\n\n\n\n\nApply now to start your career with PurpleMerit!",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Digital Marketing Intern: SEO, Outreach & Conversion Strategy",
    "job_id": "4282016611",
    "company_name": "The Merc",
    "location": "India",
    "experience": "Intern",
    "salary": null,
    "key_skills": [
      "SEO",
      "keyword research",
      "content optimization",
      "technical SEO audits",
      "Smartlead",
      "Instantly",
      "email marketing",
      "A/B tests"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282016611/",
    "posted_at": null,
    "job_description": "About the job\n\nDigital Marketing Intern: SEO, Outreach & Conversion Strategy\n\n\n\n\nDuration & Compensation:\n\n • Duration: 3 months (extendable based on performance)\n\n • Type: Paid Internship with strong possibility of Pre-Placement Offer (PPO)\n\n • Stipend: Based on your experience and learning curve\n\n\n\n\nAbout Us: The Merc is a product-focused design studio that partners with SaaS companies, startups, and founders to craft clean, strategic digital experiences. We’re now expanding our growth and client performance capabilities, and looking for an ambitious digital marketing intern to join us on that journey.\n\n\n\n\nWhat You’ll Do:\n\n\n\n\nYou’ll work directly with the founder and get hands-on exposure across 3 core areas:\n\n\n\n\n1. SEO Strategy & Implementation\n\n • Assist in keyword research, content optimization, and technical SEO audits\n\n • Help analyze traffic data and suggest on-page improvements\n\n\n\n\n2. Direct Outreach & Demand Generation\n\n • Learn and support direct outreach strategies using tools like Smartlead, Instantly, etc.\n\n • Help personalize messaging for outbound campaigns (emails, LinkedIn, etc.)\n\n • Research and build lead lists for cold outreach\n\n\n\n\n3. Conversion Optimization for Clients\n\n • Assist in improving landing pages for higher conversions (strategy, not design)\n\n • Work on funnel analysis and user behavior to suggest optimizations\n\n • Collaborate with design and strategy teams to execute A/B tests\n\n\n\n\nWhat We’re Looking For:\n\n • Strong interest in digital marketing, growth, and conversion strategy\n\n • Basic understanding of SEO, email marketing, or landing page funnels is a plus\n\n • Hunger to learn, experiment, and build real-world skills\n\n • Strong communication and research skills\n\n • Proactive, self-driven, and detail-oriented mindset\n\n\n\n\nWhat You’ll Gain:\n\n • Direct mentorship from the founder\n\n • Real exposure to growth strategies that drive revenue\n\n • Portfolio-worthy projects and client experience\n\n • Certificate + recommendation letter upon successful completion\n\n • Possibility of PPO based on performance\n\n\n\n\nInternship Duration & Stipend:\n\n • Duration: 3 months (extendable)\n\n • Stipend: ₹7,000 – ₹10,000/month (based on experience and learning curve)\n\n\n\n\nWork Format:\n\n • Hybrid (Jaipur-based preferred, but remote candidates welcome if proactive)",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Flutter Intern",
    "job_id": "4281819034",
    "company_name": null,
    "location": "India",
    "experience": "Intern",
    "salary": "₹15,000 per month",
    "key_skills": [
      "Flutter",
      "Dart",
      "Android/iOS development",
      "APIs",
      "Git",
      "Firebase",
      "AI tools"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281819034/",
    "posted_at": null,
    "job_description": "About the job\n\nWe're on the lookout for a Flutter Intern who codes smart, builds fast, and brings some good vibes along the way 😎\n\nIf you're someone who uses AI tools (like ChatGPT, GitHub Copilot, etc.) to write cleaner and faster code, and you want to work on real mobile apps—not dummy tasks—this one’s for you.\n\n\n\n\nWhat We’re Looking For:\n\n ✅ Solid foundation in Flutter & Dart\n\n ✅ Familiarity with Android/iOS development\n\n ✅ Hands-on with APIs, Git, Firebase (bonus)\n\n ✅ Experience using AI tools to boost productivity\n\n ✅ Passionate learner with a builder mindset\n\n\nInternship Details:\n\n📍 Location: Remote\n\n 🕒 Duration: 3 months\n\n 💰 Stipend: ₹15,000 per month\n\n 🚀 High chance of full-time offer based on performance & fit\n\n\nWhat You’ll Get:\nReal product work, not side projects\nMentorship from experienced developers\nFast, startup-style environment\nOwnership, learning, and actual impact\nA team that ships fast and supports each other",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Intern",
    "job_id": "4282182243",
    "company_name": null,
    "location": "India",
    "experience": "Freshers, Entry Level",
    "salary": null,
    "key_skills": [
      "digital marketing",
      "social media",
      "Canva",
      "Excel"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282182243/",
    "posted_at": null,
    "job_description": "About the job\n\nWe are #hiring for Freshers and Intern.\n\n(College Students) & Entry Level candidates.\n\n\n\n\nLocation - Work from home/Remote\n\nDuration - 6 months (fulltime)\n\nSalary - Good stipend and candidate will be transferred on company roll \n\ni.e. permanent job with good hike in salary.\n\n\n\n\nExcellent verbal and written communication skills with basic excel.\n\nGood knowledge in digital marketing, social media and canva.",
    "source": "linkedin",
    "relevance_score": "low"
  },
  {
    "title": "Software Trainee / Software Engineer",
    "job_id": "4281343940",
    "company_name": "API Centrics",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "Python",
      "MuleSoft",
      "Salesforce",
      "AI"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281343940/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n\nAPI Centrics specializes in API-led transformation and is a trusted Salesforce and MuleSoft Partner. We are a go-to shop for MuleSoft projects, boasting multiple Certified Integration Architects, Platform Architects, and Certified Mule 4 Developers\n\n\n\n\nRole Description\n\nThis is a full-time on-site role for an Application Developer, located in Guntur. Process will be as follows\n\nTraining with Stipend - will be a software Trainee\nOnce you complete the training, - You become Software Engineer\nTwo years commitment needed\nSalary reviews every six months\n\n\n\n\n\n\n\nQualifications\n\nProgramming skills (Java or Python)\nStrong Communication Skills\nStrong problem-solving abilities and attention to detail\nStrong work Ethics\nBachelor's degree in Computer Science, Information Technology, or a related field\n\n\n\n\nTraining Areas:\n\nMuleSoft\nSalesforce\nAI",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Digital Marketing",
    "job_id": "4281808995",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "digital marketing",
      "social media marketing",
      "content creation",
      "Canva",
      "PowerPoint",
      "WordPress",
      "email marketing",
      "SEO",
      "Google AdWords",
      "Facebook Ads",
      "LinkedIn Ads",
      "SEM",
      "Content Marketing"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281808995/",
    "posted_at": null,
    "job_description": "About the job\n\nDeveloping and implementing digital marketing strategies that align with business goals and target audience. Managing social media accounts and creating social media content to engage with target audience and increase brand awareness.\n\nResearch & Designing:\nConducting market research to analyze customer behavior, trends, peers and competitors\nProficient in Digital content creation & design tools including Canva, PowerPoint, WordPress, etc\nRunning campaigns to increase followership & creating trends. Creating and executing email marketing campaigns to promote products or services and generate leads\nOptimizing website and landing pages for search engines to improve website traffic and search engine rankings\nCreating and publishing digital ads using platforms like Google AdWords, Facebook Ads, and LinkedIn Ads\nTracking and analyzing digital marketing campaigns to measure their effectiveness and identify areas for improvement\nAttend team meetings at the requested frequency\nCollaborating with other departments within the organization, such as sales and product development, to ensure marketing efforts are aligned with overall business objectives.\nSkills sought:\nRequired:\nStrategic thinking\nCreative\nAnalytical Ability\nSEO & SEM knowledge\nContent Marketing & Social Media expertise\nSelf-starter\nExcellent Communication Skills\nExcellent Presentation Skills\nAesthetic sense\nGood to have:\nUnderstanding of Trade Finance business",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "iOS Developer",
    "job_id": "4275064933",
    "company_name": "Arramton Infotech",
    "location": "India",
    "experience": "2-3 years",
    "salary": null,
    "key_skills": [
      "iOS development",
      "Swift",
      "Ui Kit",
      "Core Data",
      "Core Animation",
      "RESTful APIs",
      "Git"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4275064933/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Title: iOS Developer\n\nLocation: On-site – Plot No. 18, First Floor, Vaishali, Pitampura, New Delhi, Delhi 110034\n\nApply at: Simardeep_57@arramton.com\n\nJob Type: Full-time | On-site\n\nAbout Us\n\nAt Arramton Infotech, we’re passionate about building innovative digital solutions that solve real-world problems. We’re expanding our mobile development team and looking for a dedicated iOS Developer to work on exciting, high-impact projects in a fast-paced, collaborative environment.\n\nKey Responsibilities\n\nDesign and build advanced applications for the iOS platform using Swift/Ui Kit\nCollaborate with cross-functional teams to define, design, and ship new features\nWork on bug fixing and improving application performance\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency\nEnsure the performance, quality, and responsiveness of applications\n\nRequirements\n\nBachelor’s degree in Computer Science, Engineering, or a related field\n2-3 years of hands-on experience in iOS development\nStrong knowledge of Swift and Ui Kit\nExperience with iOS frameworks such as Core Data, Core Animation, etc.\nFamiliarity with RESTful APIs to connect iOS applications to back-end services\nUnderstanding of Apple’s design principles and interface guidelines\nProficient understanding of code versioning tools such as Git\nStrong problem-solving and debugging skills\n\nGood to Have\n\nExperience with third-party libraries and APIs\nKnowledge of the iOS ecosystem and the libraries available for common tasks\nUnderstanding of UI/UX standards\nExperience with push notifications and performance tuning",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java Software Engineer",
    "job_id": "4279896121",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "Spring Boot",
      "Hibernate",
      "JPA",
      "RESTful APIs",
      "microservices",
      "MySQL",
      "PostgreSQL",
      "MongoDB"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4279896121/",
    "posted_at": null,
    "job_description": "About the job\n\n\n\n\nJob Summary:\n\n\n\n\nWe are looking for a skilled Java Software Engineer to join our development team. The ideal candidate will have experience designing, developing, and maintaining scalable Java applications. You should be comfortable with both back-end and full-stack development, working in a collaborative environment to build high-performance, secure, and user-friendly solutions.\n\n\n\n\nKey Responsibilities:\n\n\n\n\nDesign, develop, and maintain robust Java-based applications.\nWrite clean, maintainable, and efficient code following best practices.\nCollaborate with cross-functional teams including product managers, QA, and DevOps.\nTroubleshoot and resolve technical issues in development, testing, and production environments.\nParticipate in code reviews and contribute to team knowledge sharing.\nDevelop and integrate APIs and external services.\nOptimize application performance and scalability.\nEnsure security and data protection compliance.\nMaintain documentation for software development and deployment processes.\n\n\n\n\nRequirements:\n\n\n\n\nBachelor’s degree in Computer Science, Engineering, or related field.\nProven experience as a Java Developer or Java Software Engineer.\nStrong knowledge of Java (preferably Java 8 or above), OOP, and design patterns.\nHands-on experience with frameworks like Spring Boot, Hibernate, or JPA.\nFamiliarity with RESTful APIs and microservices architecture.\nExperience with relational databases (e.g., MySQL, PostgreSQL) and/or NoSQL (e.g., MongoDB).\nProficient in version control tools like Git.\nBasic knowledge of front-end technologies (HTML, CSS, JavaScript) is a plus.\nGood understanding of Agile methodologies and SDLC.\n\n\n\n\nPreferred Qualifications:\n\n\n\n\nExperience with cloud platforms like AWS, Azure, or GCP.\nKnowledge of containerization tools like Docker and Kubernetes.\nFamiliarity with CI/CD pipelines (e.g., Jenkins, GitHub Actions).\nExperience with unit testing and test-driven development (TDD).\n\n\n\n\nSoft Skills:\n\n\n\n\nExcellent problem-solving skills.\nStrong communication and teamwork abilities.\nEagerness to learn and adapt to new technologies.\nAttention to detail and a passion for quality.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Golang Developer",
    "job_id": "4281585953",
    "company_name": null,
    "location": "India",
    "experience": "Minimum 2 years",
    "salary": null,
    "key_skills": [
      "Golang",
      "AI tools",
      "unit testing",
      "SQL",
      "Postgres",
      "OWASP",
      "Payment Service Providers"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281585953/",
    "posted_at": null,
    "job_description": "About the job\n\nAt Travel & Payments, we are looking to hire for one of our clients. While this seems like an outsourced work, but it is specialized because of two reasons:\n\nIt is in the same industry in which we do business consulting\nThe working will be the same like that of the client, based in South America & Singapore\n\n\n\n\nExperience required:\n\nMinimum 2 years\n\n\n\n\nMinimum Qualifications\n\n\n\n\n● Proficiency using Golang.\n\n● Adaptability to a constantly changing roadmap.\n\n● Demonstrated knowledge using AI tools.\n\n● Autonomy in tasks executions.\n\n● Demonstrated knowledge in unit testing\n\n● Ability to communicate complicated technical problems to both technical and business\n\naudiences.\n\n● Knowledge using SQL, Postgres\n\n● Willingness to learn new technologies and frameworks.\n\n● Entrepreneurship.\n\n● Security on OWASP.\n\n● Detail-oriented with a strategic mindset and the ability to think critically and creatively to\n\nsolve complex problems and drive business growth.\n\n● Fluency English.\n\n\n\n\nPreferred Qualifications\n\n● Experience in the payment industry.\n\n● Experience integrating Payment Service Providers.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Zoho Developer",
    "job_id": "4282028878",
    "company_name": "Techworkstalent",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Zoho CRM",
      "Zoho Books",
      "Zoho Inventory",
      "Zoho Creator",
      "Zoho Deluge scripting",
      "REST APIs"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4282028878/",
    "posted_at": null,
    "job_description": "About the job\n\nTechworkstalent Company Overview\n\nTechworkstalent (TWT) is an emerging startup in the technology and consulting sector, specializing in digital transformation for businesses. The company leverages new-age AI tools, cognitive computing, hyper-automation, analytics, cloud, and robotics to help clients navigate and adapt to the fast-evolving digital world. As an authorized Zoho Partner, Techworkstalent delivers consulting, implementation, and support services across Zoho's suite of apps, successfully completing numerous projects in varied industries and offering tailored solutions for unique business challenges. The team is led by veteran IT professionals with deep experience in program management and digital transformation.\n\n\n\n\nJob Description: Zoho Developer\n\nLocation\n\nAlwarpet, Chennai\n\n\n\n\n100% Work from Office\n\n\n\n\nResponsibilities\n\nDevelop, customize, and implement applications using Zoho CRM, Zoho Books, Zoho Inventory, Zoho Creator, and other Zoho apps.\n\n\n\n\nCreate custom modules, forms, and reports tailored to business needs.\n\n\n\n\nDesign and modify workflows, automations, and complex business logic with Zoho Deluge scripting.\n\n\n\n\nIntegrate Zoho apps with third-party applications using REST APIs for seamless data flow.\n\n\n\n\nUnit test and debug solutions to ensure reliability and quality.\n\n\n\n\nProvide ongoing technical support and troubleshoot issues within Zoho applications.\n\n\n\n\nDocument changes, prepare user guides, and support training initiatives.\n\n\n\n\nCollaborate closely with company stakeholders to gather requirements and translate into technical specifications.\n\n\n\n\nRequirements\n\nBachelor's degree in Computer Science, Information Technology, or a related field.\n\n\n\n\nAt least 2 years of hands-on experience in Zoho app development and customization.\n\n\n\n\nProficiency in Zoho CRM, Zoho Creator, Zoho Books, Inventory, and other core Zoho platforms.\n\n\n\n\nSolid understanding of web technologies (HTML, CSS, JavaScript) and API integrations.\n\n\n\n\nStrong communication skills and collaborative work ethic.\n\n\n\n\nAbility to manage multiple projects and prioritize tasks efficiently.",
    "source": "linkedin",
    "relevance_score": "medium"
  },
  {
    "title": "Node JS & Backend Developer - Co-founding team member",
    "job_id": "4281823028",
    "company_name": "ICEGlobal ECommerce Technology Pvt. Ltd.",
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Node JS",
      "Backend development",
      "JavaScript",
      "Redux.js"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4263608674/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 1-2 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "AI/ML Engineer",
    "job_id": "4280201401",
    "company_name": null,
    "location": "India",
    "experience": "1 to 4 years",
    "salary": null,
    "key_skills": [
      "AI",
      "Machine Learning",
      "cloud-based platforms",
      "proofs-of-concept",
      "software development lifecycle",
      "SQL",
      "scripting languages"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4281823028/",
    "posted_at": null,
    "job_description": "About the job\n\nCompany Description\n \nICEGlobal ECommerce Technology Pvt. Ltd. is launching a MY MOVIES - Online Exhibition Portal for Movie Industry and with millions of Film Fan Club Members Community and over 10000 movies promotion and ICE is also launching and operating a scalable and innovative business model that has been tested by thousands of sellers across 20 cities in 14 Indian states. ICEGlobal (ICE 2.0) brings this trusted platform online, allowing brands to showcase and sell their products while gaining meaningful insights through weekly themed expos on ICEBUY. This unique model offers buyers fresh deals, discounts, and opportunities every week, integrating social media capabilities, AR/VR, Web 3, and metaverse experiences. ICEBUY aims to significantly boost online sales for both high-value established brands and the Indian MSME sector, making it a catalyst for the Indian economy.\n\n Role Description\n \nThis is a full-time on-site role for a Node JS & Backend Developer - Co-founding team member for the MY MOVIES Portal at ICEGlobal ECommerce Technology Pvt. Ltd. Based in Bengaluru, the developer will be responsible for front-end and back-end web development, software development, and working with JavaScript and Redux.js. Day-to-day tasks include designing and developing server-side logic, ensuring high performance and responsiveness to front-end requests, and collaborating with team members to deliver high-quality products.\n\n Qualifications\n \n\nFront-End Development and JavaScript skills\nBack-End Web Development, including experience with Node.js\nSoftware Development skills\nExperience with Redux.js\nStrong problem-solving abilities and collaboration skills\nBachelor's degree in Computer Science, Engineering, or related field\nExperience in eCommerce platforms is a plus",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "HTML/CSS Frontend Designer",
    "job_id": "4282028633",
    "company_name": "Cygnus Advertising",
    "location": "India",
    "experience": "2–4 Years",
    "salary": "₹20,000 – ₹30,000/month",
    "key_skills": [
      "HTML/CSS",
      "HTML5",
      "CSS3",
      "JavaScript",
      "responsive design",
      "Bootstrap",
      "AngularJS",
      "ReactJS",
      "Adobe Photoshop"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280201401/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description for the AI/ML Role: \n\n\n\n\nJob Role: AI/ML Engineer\n\nJob Type: Permanent Full time\n\nLocation: Pune (Hybrid) \n\nNotice Period: Immediate Joiners\n\nExperience: 1 to 4 years\n\n\n\n\nJob Description: \n\nWe are seeking a dynamic AI & Machine Learning Engineer to join our team. This role is pivotal in implementing AI and machine learning solutions on cloud-based platforms, staying abreast of emerging trends in AI, developing proofs-of-concept, and collaborating with internal and external stakeholders to transition concepts to production. Additionally, this role involves the application of engineering principles from the classical software development lifecycle to AI and machine learning.\n\n\n\n\nKey Responsibilities:\n\nDevelop AI & Machine Learning solutions on cloud-based platforms.\nIdentify, access, import, clean, and format data from various sources.\nImplement research findings and custom models effectively.\nConstruct backend systems to interface with other microservices.\nTrain and optimize machine learning models for optimal performance.\nEngineer scalable machine intelligence systems and infrastructure for real-world deployment.\nJustify the application of AI/ML solutions based on problem statements.\nPrototype solutions efficiently and deliver results promptly.\nManipulate data using SQL and scripting languages.\nCollaborate with internal and external teams to design and deploy AI & ML solutions.\nExplore emerging AI & Machine learning trends and develop prototypes.\nDemonstrate effective communication and teamwork skills.\n\n\n\n\nExperience And Qualifications Required:\n\nProven experience in leading AI projects.\nProficiency in cloud deployment of AI solutions (AWS, GCP, or Azure).\nFamiliarity with Lang chain, advanced RAG applications, and Vector database.\nExperience in developing advanced Gen AI solutions.\nStrong analytical skills including data pre-processing and various ML techniques.\nExpertise in model building, optimization, and data visualization.\nKnowledge of major ML algorithms for Natural Language Processing, Computer Vision & Graph Networks.\nHands-on experience with cloud platforms like AWS/Microsoft Azure.\nProficient in SQL query development.\nFamiliarity with data platforms such as Snowflake is advantageous.\nKnowledge of MLOps (Machine Learning Operations) is a plus.\nExperience in advanced Computer Vision model development is beneficial.\nPractical experience in deep learning projects is highly valued.\nAbility to enhance the accuracy, runtime, scalability, and reliability of machine intelligence systems.\nProficient in understanding underlying mathematical concepts and algorithms.\nEnthusiasm for continuous learning of state-of-the-art techniques in ML/Data science.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Java Developer",
    "job_id": "4282025141",
    "company_name": null,
    "location": "India",
    "experience": null,
    "salary": null,
    "key_skills": [
      "Java",
      "MongoDB",
      "REST APIs",
      "Postman",
      "Swagger",
      "Git",
      "Spring Boot",
      "React.js",
      "CI/CD"
    ],
    "job_url": "https://in.linkedin.com/jobs/view/4280976081/",
    "posted_at": null,
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 2-4 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "high"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4280969909/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nJob Description\n\nWHO WE ARE \n\nCome join our Technology Team and start reimagining the future of the automotive aftermarket. We are a highly motivated tech-focused organization, excited to be amid dynamic innovation and transformational change. Driven by Advance’s top-down commitment to empowering our team members, we are focused on delighting our Customers with Care and Speed, through delivery of world class technology solutions and products. \n\nWe value and cultivate our culture by seeking to always be collaborative, intellectually curious, fun, open, and diverse.   You will be a key member of a growing and passionate group focused on collaborating across business and technology resources to drive forward key programs and projects building enterprise capabilities across Advance Auto Parts. \n\nThe Opportunity\n\nJoin the AAP team and start reimagining the future of automotive retail. Disrupt the way consumers buy auto parts and take on the industry’s biggest challengers to execute on AAP's top-down commitment to digital expansion. \n\nAs a member of the Advance Auto Parts team, you will have an opportunity to disrupt a $150B auto parts industry to bring better and faster solutions to customers. You will be part of a team helping the company live its mission of “Advancing a World in Motion”. The role is part of a merit-based organization with a culture of professional growth and development, and emphasis on the latest tools, platforms and technologies. \n\nResponsibilities\n\n\nHelp in the migration and modernization of data platforms, moving applications and pipelines to Google Cloud-based solutions. \nEnsure data security and governance, enforcing compliance with industry standards and regulations. \nHelp in managing and scale data pipelines from internal and external data sources to support new product launches and ensure high data quality. \nHelp in developing automation and monitoring frameworks to capture key metrics and operational KPIs for pipeline performance. \nCollaborate with internal teams, including data science and product teams, to drive solutioning and proof-of-concept (PoC) discussions. \nHelp in developing and optimizing procedures to transition data into production. \nCreate and maintain technical documentation for sharing knowledge. \nHelp in developing reusable packages and libraries to enhance development efficiency. \nHelp in developing real-time and batch data processing solutions, integrating structured and unstructured data sources. \n\n\nRequired Qualification\n\n\nWe are looking for a candidate with 1-2 years of experience in Data Engineering and Application development. They must have a graduate degree in Computer Science or a related field of study. They must have experience with programming languages such as Python, Java & DS&Algo, Spark, and Scala. Expertise in Python and Spark is a must. \nExposure of AWS and Cloud technologies. Experience in data platform engineering, with a focus on cloud transformation and modernization. \nHands-on experience building large, scaled data pipelines in cloud environments and handling of data in PBs. \nExperience with CI/CD pipeline management in GCP DevOps. \nUnderstanding of data governance, security, and compliance best practices. \nExperience working in an Agile development environment. \nPrior experience in migrating applications from legacy platforms to the cloud. \nKnowledge of Terraform or Infrastructure-as-Code (IaC) for cloud resource management. \nFamiliarity with Kafka, Event Hubs, or other real-time data streaming solutions. \nExperience with legacy RDBMS (Oracle, DB2, Teradata) & DataStage/Talend \nHaving background supporting data science models in production. \n\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttps://jobs.advanceautoparts.com/us/en/disclosures\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4282028633/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\n🚀 We're Hiring! | HTML/CSS Frontend Designer\n\n 📍 Location: Kolkata\n\n 🕒 Experience: 2–4 Years\n\n 💼 Job Type: Full-Time\n\n 💰 Salary: ₹20,000 – ₹30,000/month \n\nAbout Us:\n\n Cygnus Advertising is a full-service Digital Solution Agency with over 15 years of experience delivering innovative Website Development, Social Media Marketing, and Digital Promotion Solutions to Government bodies, Corporates, PSUs, and Private Enterprises.\n\n 🌐 Learn more: cygnusadvertising.in\n\nRole Overview:\n\n We’re on the lookout for a talented HTML/CSS Frontend Designer to join our growing team! You’ll play a key role in translating design mockups into pixel-perfect, responsive web experiences that captivate users and drive engagement.\n\nWhat You'll Do:\n\n 🔹 Convert PSD, Adobe XD, or Figma designs into fully responsive HTML5/CSS3 layouts\n\n 🔹 Ensure UI/UX designs are technically feasible and optimized for speed & scalability\n\n 🔹 Collaborate with backend teams (PHP, WordPress, CodeIgniter, Drupal) for seamless integration\n\n 🔹 Maintain and enhance existing websites\n\n 🔹 Keep up with the latest web design trends and technologies\n\n 🔹 Adhere to visual design standards (fonts, colors, imagery)\n\nWhat We’re Looking For:\n\n ✅ 2–4 years of proven experience as an HTML/CSS Developer\n\n ✅ Strong grasp of HTML5, CSS3, JavaScript, and responsive design frameworks like Bootstrap\n\n ✅ Familiarity with frontend libraries/frameworks (AngularJS, ReactJS a plus)\n\n ✅ Proficiency in Adobe Photoshop and graphic design tools\n\n ✅ Understanding of SEO principles and best practices\n\n ✅ Excellent problem-solving and communication skills\n\nWhy Join Us?\n\n ✔ A dynamic, creative, and collaborative environment\n\n ✔ Exposure to a wide range of projects and industries\n\n ✔ Opportunity to grow with a team of digital experts\n\n📩 Interested?\n\n Send your resume/portfolio or connect with us directly on this mail id:  hr@cygnusadvertising.in —we’d love to hear from you!\n\n#Hiring #FrontendDeveloper #HTMLCSS #WebDesign #UIUX #RemoteJobs #DigitalAgency #JobOpening #TechJobs #HTML #CSS #Bootstrap #WebDeveloper",
    "source": "linkedin",
    "relevance_score": "unknown"
  },
  {
    "title": "Title not extracted",
    "job_id": "ID not extracted",
    "company_name": "Company not extracted",
    "location": "India",
    "experience": "Not specified",
    "salary": "Not specified",
    "key_skills": [],
    "job_url": "https://in.linkedin.com/jobs/view/4282025141/",
    "posted_at": "Not specified",
    "job_description": "About the job\n\nJoin a hybrid crew of technologists and business strategists that builds enterprise-grade platforms for global manufacturers, builders, D2C brands, and B2B brands. Work side-by-side with experienced mentors who’ve scaled systems to millions of users, and ship code to production in your first week while learning directly from senior engineers. \n\n\n\n\nWHAT YOU’LL DO\n\n* Design and develop high-quality Java applications with a strong focus on code reliability and maintainability\n\n* Model and query data in MongoDB; optimize indexes for <50 ms reads. \n\n* Consume & document REST APIs using Postman / Swagger. \n\n* Pair-program with front-end devs to deliver end-to-end features. \n\n* Write clean, peer-reviewed code, *test / debug rigorously,* and contribute to sprint demos. \n\n\n\n\nMUST-HAVE\n\n* Pursuing / completed CS or Engineering degree \n\n* Java fundamentals · Basic MongoDB schema/query · REST concepts · Git basics \n\n* Clear written & spoken English; collaborative, fast learner\n\n\n\n\nGREAT-TO-HAVE\n\nSpring Boot · React.js exposure · CI/CD (GitHub Actions) · API testing tools (Postman / Swagger)\n\n\n\n\nWHAT YOU’LL GET\n\n* Dedicated mentor, weekly code reviews, Udemy budget \n\n* PPO consideration for top performers\n\n* Remuneration best in Industry \n\n\n\n\nShow us your craft link a GitHub repo where your Java code talks to any NoSQL DB, or give us a short write-up of one you’ve built.",
    "source": "linkedin",
    "relevance_score": "unknown"
  }
]